levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/**
 *******************************************************************************
 ** \brief InterrUpt nUmber enumeration
 ******************************************************************************/
typedef enum en_int_src
{
    INT_SWI_IRQ0             = 0U,
    INT_SWI_IRQ1             = 1U,
    INT_SWI_IRQ2             = 2U,
    INT_SWI_IRQ3             = 3U,
    INT_SWI_IRQ4             = 4U,
    INT_SWI_IRQ5             = 5U,
    INT_SWI_IRQ6             = 6U,
    INT_SWI_IRQ7             = 7U,
    INT_SWI_IRQ8             = 8U,
    INT_SWI_IRQ9             = 9U,
    INT_SWI_IRQ10            = 10U,
    INT_SWI_IRQ11            = 11U,
    INT_SWI_IRQ12            = 12U,
    INT_SWI_IRQ13            = 13U,
    INT_SWI_IRQ14            = 14U,
    INT_SWI_IRQ15            = 15U,
    INT_SWI_IRQ16            = 16U,
    INT_SWI_IRQ17            = 17U,
    INT_SWI_IRQ18            = 18U,
    INT_SWI_IRQ19            = 19U,
    INT_SWI_IRQ20            = 20U,
    INT_SWI_IRQ21            = 21U,
    INT_SWI_IRQ22            = 22U,
    INT_SWI_IRQ23            = 23U,
    INT_SWI_IRQ24            = 24U,
    INT_SWI_IRQ25            = 25U,
    INT_SWI_IRQ26            = 26U,
    INT_SWI_IRQ27            = 27U,
    INT_SWI_IRQ28            = 28U,
    INT_SWI_IRQ29            = 29U,
    INT_SWI_IRQ30            = 30U,
    INT_SWI_IRQ31            = 31U,
    /*  External Interrupt   */
    INT_PORT_EIRQ0           = 0U,
    INT_PORT_EIRQ1           = 1U,
    INT_PORT_EIRQ2           = 2U,
    INT_PORT_EIRQ3           = 3U,
    INT_PORT_EIRQ4           = 4U,
    INT_PORT_EIRQ5           = 5U,
    INT_PORT_EIRQ6           = 6U,
    INT_PORT_EIRQ7           = 7U,
    INT_PORT_EIRQ8           = 8U,
    INT_PORT_EIRQ9           = 9U,
    INT_PORT_EIRQ10          = 10U,
    INT_PORT_EIRQ11          = 11U,
    INT_PORT_EIRQ12          = 12U,
    INT_PORT_EIRQ13          = 13U,
    INT_PORT_EIRQ14          = 14U,
    INT_PORT_EIRQ15          = 15U,
    /*  DMA_1  */
    INT_DMA1_TC0             = 32U,
    INT_DMA1_TC1             = 33U,
    INT_DMA1_TC2             = 34U,
    INT_DMA1_TC3             = 35U,
    INT_DMA1_TC4             = 36U,
    INT_DMA1_TC5             = 37U,
    INT_DMA1_TC6             = 38U,
    INT_DMA1_TC7             = 39U,
    INT_DMA1_BTC0            = 40U,
    INT_DMA1_BTC1            = 41U,
    INT_DMA1_BTC2            = 42U,
    INT_DMA1_BTC3            = 43U,
    INT_DAM1_BTC4            = 44U,
    INT_DMA1_BTC5            = 45U,
    INT_DMA1_BTC6            = 46U,
    INT_DMA1_BTC7            = 47U,
    INT_DMA1_ERR             = 48U,
    /*  EFM  */
    INT_EFM_PEERR            = 49U,
    INT_EFM_RDCOL            = 50U,
    INT_EFM_OPTEND           = 51U,
    /*  QSPI  */
    INT_QSPI_INTR            = 54U,
    /*  DCU  */
    INT_DCU1                 = 55U,
    INT_DCU2                 = 56U,
    INT_DCU3                 = 57U,
    INT_DCU4                 = 58U,
    INT_DCU5                 = 59U,
    INT_DCU6                 = 60U,
    INT_DCU7                 = 61U,
    INT_DCU8                 = 62U,
    /*  DMA2  */
    INT_DMA2_TC0             = 64U,
    INT_DMA2_TC1             = 65U,
    INT_DMA2_TC2             = 66U,
    INT_DMA2_TC3             = 67U,
    INT_DMA2_TC4             = 68U,
    INT_DMA2_TC5             = 69U,
    INT_DMA2_TC6             = 70U,
    INT_DMA2_TC7             = 71U,
    INT_DMA2_BTC0            = 72U,
    INT_DMA2_BTC1            = 73U,
    INT_DMA2_BTC2            = 74U,
    INT_DMA2_BTC3            = 75U,
    INT_DMA2_BTC4            = 76U,
    INT_DMA2_BTC5            = 77U,
    INT_DMA2_BTC6            = 78U,
    INT_DMA2_BTC7            = 79U,
    INT_DMA2_ERR             = 80U,
    /*  MAU  */
    INT_MAU_SQRT             = 83U,
    /*  DVP  */
    INT_DVP_FRAMSTA          = 84U,
    INT_DVP_LINESTA          = 85U,
    INT_DVP_LINEEND          = 86U,
    INT_DVP_FRAMEND          = 87U,
    INT_DVP_SQUERR           = 88U,
    INT_DVP_FIFOERR          = 89U,
    /*  FMAC  */
    INT_FMAC_1               = 91U,
    INT_FMAC_2               = 92U,
    INT_FMAC_3               = 93U,
    INT_FMAC_4               = 94U,
    /*  TIMER0  */
    INT_TMR0_1_CMPA          = 96U,
    INT_TMR0_1_CMPB          = 97U,
    INT_TMR0_2_CMPA          = 98U,
    INT_TMR0_2_CMPB          = 99U,
    /*  TIMER2  */
    INT_TMR2_1_CMPA          = 100U,
    INT_TMR2_1_CMPB          = 101U,
    INT_TMR2_1_OVFA          = 102U,
    INT_TMR2_1_OVFB          = 103U,
    INT_TMR2_2_CMPA          = 104U,
    INT_TMR2_2_CMPB          = 105U,
    INT_TMR2_2_OVFA          = 106U,
    INT_TMR2_2_OVFB          = 107U,
    INT_TMR2_3_CMPA          = 108U,
    INT_TMR2_3_CMPB          = 109U,
    INT_TMR2_3_OVFA          = 110U,
    INT_TMR2_3_OVFB          = 111U,
    INT_TMR2_4_CMPA          = 112U,
    INT_TMR2_4_CMPB          = 113U,
    INT_TMR2_4_OVFA          = 114U,
    INT_TMR2_4_OVFB          = 115U,
    /*  RTC  */
    INT_RTC_TP               = 120U,
    INT_RTC_ALM              = 121U,
    INT_RTC_PRD              = 122U,
    /*  XTAL  */
    INT_XTAL_STOP            = 125U,
    /*  WKTM  */
    INT_WKTM_PRD             = 126U,
    /*  SWDT  */
    INT_SWDT_REFUDF          = 127U,
    /*  TIMER6_1  */
    INT_TMR6_1_GCMA          = 128U,
    INT_TMR6_1_GCMB          = 129U,
    INT_TMR6_1_GCMC          = 130U,
    INT_TMR6_1_GCMD          = 131U,
    INT_TMR6_1_GCME          = 132U,
    INT_TMR6_1_GCMF          = 133U,
    INT_TMR6_1_GOVF          = 134U,
    INT_TMR6_1_GUDF          = 135U,
    /*  TIMER4_1  */
    INT_TMR4_1_GCMUH         = 136U,
    INT_TMR4_1_GCMUL         = 137U,
    INT_TMR4_1_GCMVH         = 138U,
    INT_TMR4_1_GCMVL         = 139U,
    INT_TMR4_1_GCMWH         = 140U,
    INT_TMR4_1_GCMWL         = 141U,
    INT_TMR4_1_GOVF          = 142U,
    INT_TMR4_1_GUDF          = 143U,
    /*  TIMER6_2  */
    INT_TMR6_2_GCMA          = 144U,
    INT_TMR6_2_GCMB          = 145U,
    INT_TMR6_2_GCMC          = 146U,
    INT_TMR6_2_GCMD          = 147U,
    INT_TMR6_2_GCME          = 148U,
    INT_TMR6_2_GCMF          = 149U,
    INT_TMR6_2_GOVF          = 150U,
    INT_TMR6_2_GUDF          = 151U,
    /*  TIMER4_2  */
    INT_TMR4_2_GCMUH         = 152U,
    INT_TMR4_2_GCMUL         = 153U,
    INT_TMR4_2_GCMVH         = 154U,
    INT_TMR4_2_GCMVL         = 155U,
    INT_TMR4_2_GCMWH         = 156U,
    INT_TMR4_2_GCMWL         = 157U,
    INT_TMR4_2_GOVF          = 158U,
    INT_TMR4_2_GUDF          = 159U,
    /*  TIMER6_3  */
    INT_TMR6_3_GCMA          = 160U,
    INT_TMR6_3_GCMB          = 161U,
    INT_TMR6_3_GCMC          = 162U,
    INT_TMR6_3_GCMD          = 163U,
    INT_TMR6_3_GCME          = 164U,
    INT_TMR6_3_GCMF          = 165U,
    INT_TMR6_3_GOVF          = 166U,
    INT_TMR6_3_GUDF          = 167U,
    /*  TIMER4_3  */
    INT_TMR4_3_GCMUH         = 168U,
    INT_TMR4_3_GCMUL         = 169U,
    INT_TMR4_3_GCMVH         = 170U,
    INT_TMR4_3_GCMVL         = 171U,
    INT_TMR4_3_GCMWH         = 172U,
    INT_TMR4_3_GCMWL         = 173U,
    INT_TMR4_3_GOVF          = 174U,
    INT_TMR4_3_GUDF          = 175U,
    /*  TIMER6_1  */
    INT_TMR6_1_GDTE          = 176U,
    INT_TMR6_1_SCMA          = 179U,
    INT_TMR6_1_SCMB          = 180U,
    /*  TIMER4_1  */
    INT_TMR4_1_RLOU          = 181U,
    INT_TMR4_1_RLOV          = 182U,
    INT_TMR4_1_RLOW          = 183U,
    /*  TIMER6_2  */
    INT_TMR6_2_GDTE          = 184U,
    INT_TMR6_2_SCMA          = 187U,
    INT_TMR6_2_SCMB          = 188U,
    /*  TIMER4_2  */
    INT_TMR4_2_RLOU          = 189U,
    INT_TMR4_2_RLOV          = 190U,
    INT_TMR4_2_RLOW          = 191U,
    /*  TIMER6_3  */
    INT_TMR6_3_GDTE          = 192U,
    INT_TMR6_3_SCMA          = 195U,
    INT_TMR6_3_SCMB          = 196U,
    /*  TIMER4_3  */
    INT_TMR4_3_RLOU          = 197U,
    INT_TMR4_3_RLOV          = 198U,
    INT_TMR4_3_RLOW          = 199U,
    /*  TIMER6_4 TIMER6_5  */
    INT_TMR6_4_GCMA          = 208U,
    INT_TMR6_4_GCMB          = 209U,
    INT_TMR6_4_GCMC          = 210U,
    INT_TMR6_4_GCMD          = 211U,
    INT_TMR6_4_GCME          = 212U,
    INT_TMR6_4_GCMF          = 213U,
    INT_TMR6_4_GOVF          = 214U,
    INT_TMR6_4_GUDF          = 215U,
    INT_TMR6_4_GDTE          = 216U,
    INT_TMR6_4_SCMA          = 219U,
    INT_TMR6_4_SCMB          = 220U,
    INT_TMR6_5_GCMA          = 224U,
    INT_TMR6_5_GCMB          = 225U,
    INT_TMR6_5_GCMC          = 226U,
    INT_TMR6_5_GCMD          = 227U,
    INT_TMR6_5_GCME          = 228U,
    INT_TMR6_5_GCMF          = 229U,
    INT_TMR6_5_GOVF          = 230U,
    INT_TMR6_5_GUDF          = 231U,
    INT_TMR6_5_GDTE          = 232U,
    INT_TMR6_5_SCMA          = 235U,
    INT_TMR6_5_SCMB          = 236U,
    /*  TIMERA_1  */
    INT_TMRA_1_OVF           = 237U,
    INT_TMRA_1_UDF           = 238U,
    INT_TMRA_1_CMP           = 239U,
    /*  TIMER6_6  */
    INT_TMR6_6_GCMA          = 240U,
    INT_TMR6_6_GCMB          = 241U,
    INT_TMR6_6_GCMC          = 242U,
    INT_TMR6_6_GCMD          = 243U,
    INT_TMR6_6_GCME          = 244U,
    INT_TMR6_6_GCMF          = 245U,
    INT_TMR6_6_GOVF          = 246U,
    INT_TMR6_6_GUDF          = 247U,
    INT_TMR6_6_GDTE          = 248U,
    INT_TMR6_6_SCMA          = 251U,
    INT_TMR6_6_SCMB          = 252U,
    /*  TIMERA_2  */
    INT_TMRA_2_OVF           = 253U,
    INT_TMRA_2_UDF           = 254U,
    INT_TMRA_2_CMP           = 255U,
    /*  TIMER6_7  */
    INT_TMR6_7_GCMA          = 256U,
    INT_TMR6_7_GCMB          = 257U,
    INT_TMR6_7_GCMC          = 258U,
    INT_TMR6_7_GCMD          = 259U,
    INT_TMR6_7_GCME          = 260U,
    INT_TMR6_7_GCMF          = 261U,
    INT_TMR6_7_GOVF          = 262U,
    INT_TMR6_7_GUDF          = 263U,
    INT_TMR6_7_GDTE          = 264U,
    INT_TMR6_7_SCMA          = 267U,
    INT_TMR6_7_SCMB          = 268U,
    /*  TIMERA_3  */
    INT_TMRA_3_OVF           = 269U,
    INT_TMRA_3_UDF           = 270U,
    INT_TMRA_3_CMP           = 271U,
    /*  TIMER6_8  */
    INT_TMR6_8_GCMA          = 272U,
    INT_TMR6_8_GCMB          = 273U,
    INT_TMR6_8_GCMC          = 274U,
    INT_TMR6_8_GCMD          = 275U,
    INT_TMR6_8_GCME          = 276U,
    INT_TMR6_8_GCMF          = 277U,
    INT_TMR6_8_GOVF          = 278U,
    INT_TMR6_8_GUDF          = 279U,
    INT_TMR6_8_GDTE          = 280U,
    INT_TMR6_8_SCMA          = 283U,
    INT_TMR6_8_SCMB          = 284U,
    /*  TIMERA_4  */
    INT_TMRA_4_OVF           = 285U,
    INT_TMRA_4_UDF           = 286U,
    INT_TMRA_4_CMP           = 287U,
    /*  EMB  */
    INT_EMB_GR0              = 288U,
    INT_EMB_GR1              = 289U,
    INT_EMB_GR2              = 290U,
    INT_EMB_GR3              = 291U,
    INT_EMB_GR4              = 292U,
    INT_EMB_GR5              = 293U,
    INT_EMB_GR6              = 294U,
    /*  USBHS  */
    INT_USBHS_EP1_OUT        = 295U,
    INT_USBHS_EP1_IN         = 296U,
    INT_USBHS_GLB            = 297U,
    INT_USBHS_WKUP           = 298U,
    /*  USART1 USART2  */
    INT_USART1_EI            = 300U,
    INT_USART1_RI            = 301U,
    INT_USART1_TI            = 302U,
    INT_USART1_TCI           = 303U,
    INT_USART1_RTO           = 304U,
    INT_USART2_EI            = 305U,
    INT_USART2_RI            = 306U,
    INT_USART2_TI            = 307U,
    INT_USART2_TCI           = 308U,
    INT_USART2_RTO           = 309U,
    /*  SPI1 SPI2  */
    INT_SPI1_SPRI            = 310U,
    INT_SPI1_SPTI            = 311U,
    INT_SPI1_SPII            = 312U,
    INT_SPI1_SPEI            = 313U,
    INT_SPI2_SPRI            = 315U,
    INT_SPI2_SPTI            = 316U,
    INT_SPI2_SPII            = 317U,
    INT_SPI2_SPEI            = 318U,
    /*  TIMERA_5 TIMERA_6 TIMERA_7 TIMERA_8  */
    INT_TMRA_5_OVF           = 320U,
    INT_TMRA_5_UDF           = 321U,
    INT_TMRA_5_CMP           = 322U,
    INT_TMRA_6_OVF           = 323U,
    INT_TMRA_6_UDF           = 324U,
    INT_TMRA_6_CMP           = 325U,
    INT_TMRA_7_OVF           = 326U,
    INT_TMRA_7_UDF           = 327U,
    INT_TMRA_7_CMP           = 328U,
    INT_TMRA_8_OVF           = 329U,
    INT_TMRA_8_UDF           = 330U,
    INT_TMRA_8_CMP           = 331U,
    /*  USART3 USART4  */
    INT_USART3_EI            = 332U,
    INT_USART3_RI            = 333U,
    INT_USART3_TI            = 334U,
    INT_USART3_TCI           = 335U,
    INT_USART4_EI            = 336U,
    INT_USART4_RI            = 337U,
    INT_USART4_TI            = 338U,
    INT_USART4_TCI           = 339U,
    /*  CAN1 CAN2  */
    INT_CAN1_HOST            = 340U,
    INT_CAN2_HOST            = 341U,
    /*  SPI3 SPI4  */
    INT_SPI3_SPRI            = 342U,
    INT_SPI3_SPTI            = 343U,
    INT_SPI3_SPII            = 344U,
    INT_SPI3_SPEI            = 345U,
    INT_SPI4_SPRI            = 347U,
    INT_SPI4_SPTI            = 348U,
    INT_SPI4_SPII            = 349U,
    INT_SPI4_SPEI            = 350U,
    /*  TIMERA_9 TIMERA_10 TIMER_11 TIMER_12  */
    INT_TMRA_9_OVF           = 352U,
    INT_TMRA_9_UDF           = 353U,
    INT_TMRA_9_CMP           = 354U,
    INT_TMRA_10_OVF          = 355U,
    INT_TMRA_10_UDF          = 356U,
    INT_TMRA_10_CMP          = 357U,
    INT_TMRA_11_OVF          = 358U,
    INT_TMRA_11_UDF          = 359U,
    INT_TMRA_11_CMP          = 360U,
    INT_TMRA_12_OVF          = 361U,
    INT_TMRA_12_UDF          = 362U,
    INT_TMRA_12_CMP          = 363U,
    /*  USART5 USART6  */
    INT_USART5_BRKWKPI       = 364U,
    INT_USART5_EI            = 365U,
    INT_USART5_RI            = 366U,
    INT_USART5_TI            = 367U,
    INT_USART5_TCI           = 368U,
    INT_USART6_EI            = 369U,
    INT_USART6_RI            = 370U,
    INT_USART6_TI            = 371U,
    INT_USART6_TCI           = 372U,
    INT_USART6_RTO           = 373U,
    /*  SPI5 SPI6  */
    INT_SPI5_SPRI            = 374U,
    INT_SPI5_SPTI            = 375U,
    INT_SPI5_SPII            = 376U,
    INT_SPI5_SPEI            = 377U,
    INT_SPI6_SPRI            = 379U,
    INT_SPI6_SPTI            = 380U,
    INT_SPI6_SPII            = 381U,
    INT_SPI6_SPEI            = 382U,
    /*  I2S1 I2S2  */
    INT_I2S1_TXIRQOUT        = 384U,
    INT_I2S1_RXIRQOUT        = 385U,
    INT_I2S1_ERRIRQOUT       = 386U,
    INT_I2S2_TXIRQOUT        = 387U,
    INT_I2S2_RXIRQOUT        = 388U,
    INT_I2S2_ERRIRQOUT       = 389U,
    /*  USART7 USART8  */
    INT_USART7_EI            = 390U,
    INT_USART7_RI            = 391U,
    INT_USART7_TI            = 392U,
    INT_USART7_TCI           = 393U,
    INT_USART7_RTO           = 394U,
    INT_USART8_EI            = 395U,
    INT_USART8_RI            = 396U,
    INT_USART8_TI            = 397U,
    INT_USART8_TCI           = 398U,
    /*  USBFS  */
    INT_USBFS_GLB            = 399U,
    INT_USBFS_WKUP           = 400U,
    /*  HASH  */
    INT_HASH                 = 401U,
    /*  SDIOC  */
    INT_SDIOC1_SD            = 404U,
    INT_SDIOC2_SD            = 407U,
    /*  EVENT PORT  */
    INT_EVENT_PORT1          = 408U,
    INT_EVENT_PORT2          = 409U,
    INT_EVENT_PORT3          = 410U,
    INT_EVENT_PORT4          = 411U,
    /*  ETHER  */
    INT_ETH_GLB_INT          = 412U,
    INT_ETH_WKP_INT          = 413U,
    /*  I2S3 I2S4  */
    INT_I2S3_TXIRQOUT        = 416U,
    INT_I2S3_RXIRQOUT        = 417U,
    INT_I2S3_ERRIRQOUT       = 418U,
    INT_I2S4_TXIRQOUT        = 419U,
    INT_I2S4_RXIRQOUT        = 420U,
    INT_I2S4_ERRIRQOUT       = 421U,
    /*  USART9 USART10  */
    INT_USART9_EI            = 422U,
    INT_USART9_RI            = 423U,
    INT_USART9_TI            = 424U,
    INT_USART9_TCI           = 425U,
    INT_USART10_BRKWKPI      = 426U,
    INT_USART10_EI           = 427U,
    INT_USART10_RI           = 428U,
    INT_USART10_TI           = 429U,
    INT_USART10_TCI          = 430U,
    /*  I2C1 I2C2 I2C3  */
    INT_I2C1_RXI             = 432U,
    INT_I2C1_TXI             = 433U,
    INT_I2C1_TEI             = 434U,
    INT_I2C1_EEI             = 435U,
    INT_I2C2_RXI             = 436U,
    INT_I2C2_TXI             = 437U,
    INT_I2C2_TEI             = 438U,
    INT_I2C2_EEI             = 439U,
    INT_I2C3_RXI             = 440U,
    INT_I2C3_TXI             = 441U,
    INT_I2C3_TEI             = 442U,
    INT_I2C3_EEI             = 443U,
    /*  ACMP  */
    INT_CMP1                 = 444U,
    INT_CMP2                 = 445U,
    INT_CMP3                 = 446U,
    INT_CMP4                 = 447U,
    /*  I2C4 I2C5 I2C6  */
    INT_I2C4_RXI             = 448U,
    INT_I2C4_TXI             = 449U,
    INT_I2C4_TEI             = 450U,
    INT_I2C4_EEI             = 451U,
    INT_I2C5_RXI             = 452U,
    INT_I2C5_TXI             = 453U,
    INT_I2C5_TEI             = 454U,
    INT_I2C5_EEI             = 455U,
    INT_I2C6_RXI             = 456U,
    INT_I2C6_TXI             = 457U,
    INT_I2C6_TEI             = 458U,
    INT_I2C6_EEI             = 459U,
    /*  USART1  */
    INT_USART1_WUPI          = 460U,
    /*  PVD  */
    INT_PVD_PVD1             = 461U,
    INT_PVD_PVD2             = 462U,
    /*  OTS  */
    INT_OTS                  = 463U,
    /*  FCM  */
    INT_FCMFERRI             = 464U,
    INT_FCMMENDI             = 465U,
    INT_FCMCOVFI             = 466U,
    /*  WDT  */
    INT_WDT_REFUDF           = 467U,
    /*  CTC  */
    INT_CTC_ERR              = 468U,
    /*  ADC  */
    INT_ADC1_EOCA            = 480U,
    INT_ADC1_EOCB            = 481U,
    INT_ADC1_CMP0            = 482U,
    INT_ADC1_CMP1            = 483U,
    INT_ADC2_EOCA            = 484U,
    INT_ADC2_EOCB            = 485U,
    INT_ADC2_CMP0            = 486U,
    INT_ADC2_CMP1            = 487U,
    INT_ADC3_EOCA            = 488U,
    INT_ADC3_EOCB            = 489U,
    INT_ADC3_CMP0            = 490U,
    INT_ADC3_CMP1            = 491U,
    /*  TRNG  */
    INT_TRNG_END             = 492U,
    /*  NFC  */
    INT_NFC_INT              = 496U,
    INT_MAX                  = 511U,
} en_int_src_t;

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/
/**
 * @brief ADC
 */
typedef struct
{
    __IO uint8_t  STR;
    uint8_t RESERVED0[1];
    __IO uint16_t CR0;
    __IO uint16_t CR1;
    uint8_t RESERVED1[4];
    __IO uint16_t TRGSR;
    __IO uint32_t CHSELRA;
    __IO uint32_t CHSELRB;
    __IO uint32_t AVCHSELR;
    __IO uint8_t  EXCHSELR;
    uint8_t RESERVED2[1];
    __IO uint16_t SHCR;
    uint8_t RESERVED3[4];
    __IO uint8_t  SSTR0;
    __IO uint8_t  SSTR1;
    __IO uint8_t  SSTR2;
    __IO uint8_t  SSTR3;
    __IO uint8_t  SSTR4;
    __IO uint8_t  SSTR5;
    __IO uint8_t  SSTR6;
    __IO uint8_t  SSTR7;
    __IO uint8_t  SSTR8;
    __IO uint8_t  SSTR9;
    __IO uint8_t  SSTR10;
    __IO uint8_t  SSTR11;
    __IO uint8_t  SSTR12;
    __IO uint8_t  SSTR13;
    __IO uint8_t  SSTR14;
    __IO uint8_t  SSTR15;
    __IO uint8_t  SSTRL;
    uint8_t RESERVED4[7];
    __IO uint16_t CHMUXR0;
    __IO uint16_t CHMUXR1;
    __IO uint16_t CHMUXR2;
    __IO uint16_t CHMUXR3;
    uint8_t RESERVED5[4];
    __IO uint8_t  ISR;
    __IO uint8_t  ICR;
    __IO uint8_t  ISCLRR;
    uint8_t RESERVED6[5];
    __IO uint16_t SYNCCR;
    uint8_t RESERVED7[2];
    __IO uint16_t DR0;
    __IO uint16_t DR1;
    __IO uint16_t DR2;
    __IO uint16_t DR3;
    __IO uint16_t DR4;
    __IO uint16_t DR5;
    __IO uint16_t DR6;
    __IO uint16_t DR7;
    __IO uint16_t DR8;
    __IO uint16_t DR9;
    __IO uint16_t DR10;
    __IO uint16_t DR11;
    __IO uint16_t DR12;
    __IO uint16_t DR13;
    __IO uint16_t DR14;
    __IO uint16_t DR15;
    __IO uint16_t DR16;
    __IO uint16_t DR17;
    __IO uint16_t DR18;
    __IO uint16_t DR19;
    uint8_t RESERVED8[40];
    __IO uint16_t AWDCR;
    __IO uint8_t  AWDSR;
    __IO uint8_t  AWDSCLRR;
    __IO uint16_t AWD0DR0;
    __IO uint16_t AWD0DR1;
    __IO uint16_t AWD0CHSR;
    uint8_t RESERVED9[2];
    __IO uint16_t AWD1DR0;
    __IO uint16_t AWD1DR1;
    __IO uint16_t AWD1CHSR;
    uint8_t RESERVED10[14];
    __IO uint8_t  PGACR1;
    __IO uint8_t  PGACR2;
    __IO uint8_t  PGACR3;
    uint8_t RESERVED11[1];
    __IO uint8_t  PGAVSSENR;
} M4_ADC_TypeDef;

/**
 * @brief AES
 */
typedef struct
{
    __IO uint32_t CR;
    uint8_t RESERVED0[12];
    __IO uint32_t DR0;
    __IO uint32_t DR1;
    __IO uint32_t DR2;
    __IO uint32_t DR3;
    __IO uint32_t KR0;
    __IO uint32_t KR1;
    __IO uint32_t KR2;
    __IO uint32_t KR3;
    __IO uint32_t KR4;
    __IO uint32_t KR5;
    __IO uint32_t KR6;
    __IO uint32_t KR7;
} M4_AES_TypeDef;

/**
 * @brief AOS
 */
typedef struct
{
    __IO uint32_t INT_SFTTRG;
    __IO uint32_t DCU_1_TRGSEL;
    __IO uint32_t DCU_2_TRGSEL;
    __IO uint32_t DCU_3_TRGSEL;
    __IO uint32_t DCU_4_TRGSEL;
    __IO uint32_t DMA_1_TRGSEL0;
    __IO uint32_t DMA_1_TRGSEL1;
    __IO uint32_t DMA_1_TRGSEL2;
    __IO uint32_t DMA_1_TRGSEL3;
    __IO uint32_t DMA_1_TRGSEL4;
    __IO uint32_t DMA_1_TRGSEL5;
    __IO uint32_t DMA_1_TRGSEL6;
    __IO uint32_t DMA_1_TRGSEL7;
    __IO uint32_t DMA_2_TRGSEL0;
    __IO uint32_t DMA_2_TRGSEL1;
    __IO uint32_t DMA_2_TRGSEL2;
    __IO uint32_t DMA_2_TRGSEL3;
    __IO uint32_t DMA_2_TRGSEL4;
    __IO uint32_t DMA_2_TRGSEL5;
    __IO uint32_t DMA_2_TRGSEL6;
    __IO uint32_t DMA_2_TRGSEL7;
    __IO uint32_t DMA_TRGSELRC;
    __IO uint32_t TMR6_HTSSR1;
    __IO uint32_t TMR6_HTSSR2;
    __IO uint32_t TMR6_HTSSR3;
    __IO uint32_t TMR6_HTSSR4;
    __IO uint32_t PORT_PEVNTTRGSR12;
    __IO uint32_t PORT_PEVNTTRGSR34;
    __IO uint32_t TMR0_HTSSR;
    __IO uint32_t TMR2_HTSSR;
    __IO uint32_t HASH_ITRGSELA;
    __IO uint32_t HASH_ITRGSELB;
    __IO uint32_t TMRA_HTSSR0;
    __IO uint32_t TMRA_HTSSR1;
    __IO uint32_t TMRA_HTSSR2;
    __IO uint32_t TMRA_HTSSR3;
    __IO uint32_t OTS_TRG;
    __IO uint32_t ADC_1_ITRGSELR0;
    __IO uint32_t ADC_1_ITRGSELR1;
    __IO uint32_t ADC_2_ITRGSELR0;
    __IO uint32_t ADC_2_ITRGSELR1;
    __IO uint32_t ADC_3_ITRGSELR0;
    __IO uint32_t ADC_3_ITRGSELR1;
    __IO uint32_t COMTRG1;
    __IO uint32_t COMTRG2;
    uint8_t RESERVED0[76];
    __IO uint32_t GPIO_PEVNTDIRR1;
    __IO uint32_t GPIO_PEVNTIDR1;
    __IO uint32_t GPIO_PEVNTODR1;
    __IO uint32_t GPIO_PEVNTORR1;
    __IO uint32_t GPIO_PEVNTOSR1;
    __IO uint32_t GPIO_PEVNTRISR1;
    __IO uint32_t GPIO_PEVNTFAL1;
    __IO uint32_t GPIO_PEVNTDIRR2;
    __IO uint32_t GPIO_PEVNTIDR2;
    __IO uint32_t GPIO_PEVNTODR2;
    __IO uint32_t GPIO_PEVNTORR2;
    __IO uint32_t GPIO_PEVNTOSR2;
    __IO uint32_t GPIO_PEVNTRISR2;
    __IO uint32_t GPIO_PEVNTFAL2;
    __IO uint32_t GPIO_PEVNTDIRR3;
    __IO uint32_t GPIO_PEVNTIDR3;
    __IO uint32_t GPIO_PEVNTODR3;
    __IO uint32_t GPIO_PEVNTORR3;
    __IO uint32_t GPIO_PEVNTOSR3;
    __IO uint32_t GPIO_PEVNTRISR3;
    __IO uint32_t GPIO_PEVNTFAL3;
    __IO uint32_t GPIO_PEVNTDIRR4;
    __IO uint32_t GPIO_PEVNTIDR4;
    __IO uint32_t GPIO_PEVNTODR4;
    __IO uint32_t GPIO_PEVNTORR4;
    __IO uint32_t GPIO_PEVNTOSR4;
    __IO uint32_t GPIO_PEVNTRISR4;
    __IO uint32_t GPIO_PEVNTFAL4;
    __IO uint32_t GPIO_PEVNTNFCR;
} M4_AOS_TypeDef;

