levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/**
 * @brief GPIO
 */
typedef struct
{
    __IO uint16_t PIDRA;
    uint8_t RESERVED0[2];
    __IO uint16_t PODRA;
    __IO uint16_t POERA;
    __IO uint16_t POSRA;
    __IO uint16_t PORRA;
    __IO uint16_t POTRA;
    uint8_t RESERVED1[2];
    __IO uint16_t PIDRB;
    uint8_t RESERVED2[2];
    __IO uint16_t PODRB;
    __IO uint16_t POERB;
    __IO uint16_t POSRB;
    __IO uint16_t PORRB;
    __IO uint16_t POTRB;
    uint8_t RESERVED3[2];
    __IO uint16_t PIDRC;
    uint8_t RESERVED4[2];
    __IO uint16_t PODRC;
    __IO uint16_t POERC;
    __IO uint16_t POSRC;
    __IO uint16_t PORRC;
    __IO uint16_t POTRC;
    uint8_t RESERVED5[2];
    __IO uint16_t PIDRD;
    uint8_t RESERVED6[2];
    __IO uint16_t PODRD;
    __IO uint16_t POERD;
    __IO uint16_t POSRD;
    __IO uint16_t PORRD;
    __IO uint16_t POTRD;
    uint8_t RESERVED7[2];
    __IO uint16_t PIDRE;
    uint8_t RESERVED8[2];
    __IO uint16_t PODRE;
    __IO uint16_t POERE;
    __IO uint16_t POSRE;
    __IO uint16_t PORRE;
    __IO uint16_t POTRE;
    uint8_t RESERVED9[2];
    __IO uint16_t PIDRF;
    uint8_t RESERVED10[2];
    __IO uint16_t PODRF;
    __IO uint16_t POERF;
    __IO uint16_t POSRF;
    __IO uint16_t PORRF;
    __IO uint16_t POTRF;
    uint8_t RESERVED11[2];
    __IO uint16_t PIDRG;
    uint8_t RESERVED12[2];
    __IO uint16_t PODRG;
    __IO uint16_t POERG;
    __IO uint16_t POSRG;
    __IO uint16_t PORRG;
    __IO uint16_t POTRG;
    uint8_t RESERVED13[2];
    __IO uint16_t PIDRH;
    uint8_t RESERVED14[2];
    __IO uint16_t PODRH;
    __IO uint16_t POERH;
    __IO uint16_t POSRH;
    __IO uint16_t PORRH;
    __IO uint16_t POTRH;
    uint8_t RESERVED15[2];
    __IO uint16_t PIDRI;
    uint8_t RESERVED16[2];
    __IO uint16_t PODRI;
    __IO uint16_t POERI;
    __IO uint16_t POSRI;
    __IO uint16_t PORRI;
    __IO uint16_t POTRI;
    uint8_t RESERVED17[870];
    __IO uint16_t PSPCR;
    uint8_t RESERVED18[2];
    __IO uint16_t PCCR;
    __IO uint16_t PINAER;
    __IO uint16_t PWPR;
    uint8_t RESERVED19[2];
    __IO uint16_t PCRA0;
    __IO uint16_t PFSRA0;
    __IO uint16_t PCRA1;
    __IO uint16_t PFSRA1;
    __IO uint16_t PCRA2;
    __IO uint16_t PFSRA2;
    __IO uint16_t PCRA3;
    __IO uint16_t PFSRA3;
    __IO uint16_t PCRA4;
    __IO uint16_t PFSRA4;
    __IO uint16_t PCRA5;
    __IO uint16_t PFSRA5;
    __IO uint16_t PCRA6;
    __IO uint16_t PFSRA6;
    __IO uint16_t PCRA7;
    __IO uint16_t PFSRA7;
    __IO uint16_t PCRA8;
    __IO uint16_t PFSRA8;
    __IO uint16_t PCRA9;
    __IO uint16_t PFSRA9;
    __IO uint16_t PCRA10;
    __IO uint16_t PFSRA10;
    __IO uint16_t PCRA11;
    __IO uint16_t PFSRA11;
    __IO uint16_t PCRA12;
    __IO uint16_t PFSRA12;
    __IO uint16_t PCRA13;
    __IO uint16_t PFSRA13;
    __IO uint16_t PCRA14;
    __IO uint16_t PFSRA14;
    __IO uint16_t PCRA15;
    __IO uint16_t PFSRA15;
    __IO uint16_t PCRB0;
    __IO uint16_t PFSRB0;
    __IO uint16_t PCRB1;
    __IO uint16_t PFSRB1;
    __IO uint16_t PCRB2;
    __IO uint16_t PFSRB2;
    __IO uint16_t PCRB3;
    __IO uint16_t PFSRB3;
    __IO uint16_t PCRB4;
    __IO uint16_t PFSRB4;
    __IO uint16_t PCRB5;
    __IO uint16_t PFSRB5;
    __IO uint16_t PCRB6;
    __IO uint16_t PFSRB6;
    __IO uint16_t PCRB7;
    __IO uint16_t PFSRB7;
    __IO uint16_t PCRB8;
    __IO uint16_t PFSRB8;
    __IO uint16_t PCRB9;
    __IO uint16_t PFSRB9;
    __IO uint16_t PCRB10;
    __IO uint16_t PFSRB10;
    __IO uint16_t PCRB11;
    __IO uint16_t PFSRB11;
    __IO uint16_t PCRB12;
    __IO uint16_t PFSRB12;
    __IO uint16_t PCRB13;
    __IO uint16_t PFSRB13;
    __IO uint16_t PCRB14;
    __IO uint16_t PFSRB14;
    __IO uint16_t PCRB15;
    __IO uint16_t PFSRB15;
    __IO uint16_t PCRC0;
    __IO uint16_t PFSRC0;
    __IO uint16_t PCRC1;
    __IO uint16_t PFSRC1;
    __IO uint16_t PCRC2;
    __IO uint16_t PFSRC2;
    __IO uint16_t PCRC3;
    __IO uint16_t PFSRC3;
    __IO uint16_t PCRC4;
    __IO uint16_t PFSRC4;
    __IO uint16_t PCRC5;
    __IO uint16_t PFSRC5;
    __IO uint16_t PCRC6;
    __IO uint16_t PFSRC6;
    __IO uint16_t PCRC7;
    __IO uint16_t PFSRC7;
    __IO uint16_t PCRC8;
    __IO uint16_t PFSRC8;
    __IO uint16_t PCRC9;
    __IO uint16_t PFSRC9;
    __IO uint16_t PCRC10;
    __IO uint16_t PFSRC10;
    __IO uint16_t PCRC11;
    __IO uint16_t PFSRC11;
    __IO uint16_t PCRC12;
    __IO uint16_t PFSRC12;
    __IO uint16_t PCRC13;
    __IO uint16_t PFSRC13;
    __IO uint16_t PCRC14;
    __IO uint16_t PFSRC14;
    __IO uint16_t PCRC15;
    __IO uint16_t PFSRC15;
    __IO uint16_t PCRD0;
    __IO uint16_t PFSRD0;
    __IO uint16_t PCRD1;
    __IO uint16_t PFSRD1;
    __IO uint16_t PCRD2;
    __IO uint16_t PFSRD2;
    __IO uint16_t PCRD3;
    __IO uint16_t PFSRD3;
    __IO uint16_t PCRD4;
    __IO uint16_t PFSRD4;
    __IO uint16_t PCRD5;
    __IO uint16_t PFSRD5;
    __IO uint16_t PCRD6;
    __IO uint16_t PFSRD6;
    __IO uint16_t PCRD7;
    __IO uint16_t PFSRD7;
    __IO uint16_t PCRD8;
    __IO uint16_t PFSRD8;
    __IO uint16_t PCRD9;
    __IO uint16_t PFSRD9;
    __IO uint16_t PCRD10;
    __IO uint16_t PFSRD10;
    __IO uint16_t PCRD11;
    __IO uint16_t PFSRD11;
    __IO uint16_t PCRD12;
    __IO uint16_t PFSRD12;
    __IO uint16_t PCRD13;
    __IO uint16_t PFSRD13;
    __IO uint16_t PCRD14;
    __IO uint16_t PFSRD14;
    __IO uint16_t PCRD15;
    __IO uint16_t PFSRD15;
    __IO uint16_t PCRE0;
    __IO uint16_t PFSRE0;
    __IO uint16_t PCRE1;
    __IO uint16_t PFSRE1;
    __IO uint16_t PCRE2;
    __IO uint16_t PFSRE2;
    __IO uint16_t PCRE3;
    __IO uint16_t PFSRE3;
    __IO uint16_t PCRE4;
    __IO uint16_t PFSRE4;
    __IO uint16_t PCRE5;
    __IO uint16_t PFSRE5;
    __IO uint16_t PCRE6;
    __IO uint16_t PFSRE6;
    __IO uint16_t PCRE7;
    __IO uint16_t PFSRE7;
    __IO uint16_t PCRE8;
    __IO uint16_t PFSRE8;
    __IO uint16_t PCRE9;
    __IO uint16_t PFSRE9;
    __IO uint16_t PCRE10;
    __IO uint16_t PFSRE10;
    __IO uint16_t PCRE11;
    __IO uint16_t PFSRE11;
    __IO uint16_t PCRE12;
    __IO uint16_t PFSRE12;
    __IO uint16_t PCRE13;
    __IO uint16_t PFSRE13;
    __IO uint16_t PCRE14;
    __IO uint16_t PFSRE14;
    __IO uint16_t PCRE15;
    __IO uint16_t PFSRE15;
    __IO uint16_t PCRF0;
    __IO uint16_t PFSRF0;
    __IO uint16_t PCRF1;
    __IO uint16_t PFSRF1;
    __IO uint16_t PCRF2;
    __IO uint16_t PFSRF2;
    __IO uint16_t PCRF3;
    __IO uint16_t PFSRF3;
    __IO uint16_t PCRF4;
    __IO uint16_t PFSRF4;
    __IO uint16_t PCRF5;
    __IO uint16_t PFSRF5;
    __IO uint16_t PCRF6;
    __IO uint16_t PFSRF6;
    __IO uint16_t PCRF7;
    __IO uint16_t PFSRF7;
    __IO uint16_t PCRF8;
    __IO uint16_t PFSRF8;
    __IO uint16_t PCRF9;
    __IO uint16_t PFSRF9;
    __IO uint16_t PCRF10;
    __IO uint16_t PFSRF10;
    __IO uint16_t PCRF11;
    __IO uint16_t PFSRF11;
    __IO uint16_t PCRF12;
    __IO uint16_t PFSRF12;
    __IO uint16_t PCRF13;
    __IO uint16_t PFSRF13;
    __IO uint16_t PCRF14;
    __IO uint16_t PFSRF14;
    __IO uint16_t PCRF15;
    __IO uint16_t PFSRF15;
    __IO uint16_t PCRG0;
    __IO uint16_t PFSRG0;
    __IO uint16_t PCRG1;
    __IO uint16_t PFSRG1;
    __IO uint16_t PCRG2;
    __IO uint16_t PFSRG2;
    __IO uint16_t PCRG3;
    __IO uint16_t PFSRG3;
    __IO uint16_t PCRG4;
    __IO uint16_t PFSRG4;
    __IO uint16_t PCRG5;
    __IO uint16_t PFSRG5;
    __IO uint16_t PCRG6;
    __IO uint16_t PFSRG6;
    __IO uint16_t PCRG7;
    __IO uint16_t PFSRG7;
    __IO uint16_t PCRG8;
    __IO uint16_t PFSRG8;
    __IO uint16_t PCRG9;
    __IO uint16_t PFSRG9;
    __IO uint16_t PCRG10;
    __IO uint16_t PFSRG10;
    __IO uint16_t PCRG11;
    __IO uint16_t PFSRG11;
    __IO uint16_t PCRG12;
    __IO uint16_t PFSRG12;
    __IO uint16_t PCRG13;
    __IO uint16_t PFSRG13;
    __IO uint16_t PCRG14;
    __IO uint16_t PFSRG14;
    __IO uint16_t PCRG15;
    __IO uint16_t PFSRG15;
    __IO uint16_t PCRH0;
    __IO uint16_t PFSRH0;
    __IO uint16_t PCRH1;
    __IO uint16_t PFSRH1;
    __IO uint16_t PCRH2;
    __IO uint16_t PFSRH2;
    __IO uint16_t PCRH3;
    __IO uint16_t PFSRH3;
    __IO uint16_t PCRH4;
    __IO uint16_t PFSRH4;
    __IO uint16_t PCRH5;
    __IO uint16_t PFSRH5;
    __IO uint16_t PCRH6;
    __IO uint16_t PFSRH6;
    __IO uint16_t PCRH7;
    __IO uint16_t PFSRH7;
    __IO uint16_t PCRH8;
    __IO uint16_t PFSRH8;
    __IO uint16_t PCRH9;
    __IO uint16_t PFSRH9;
    __IO uint16_t PCRH10;
    __IO uint16_t PFSRH10;
    __IO uint16_t PCRH11;
    __IO uint16_t PFSRH11;
    __IO uint16_t PCRH12;
    __IO uint16_t PFSRH12;
    __IO uint16_t PCRH13;
    __IO uint16_t PFSRH13;
    __IO uint16_t PCRH14;
    __IO uint16_t PFSRH14;
    __IO uint16_t PCRH15;
    __IO uint16_t PFSRH15;
    __IO uint16_t PCRI0;
    __IO uint16_t PFSRI0;
    __IO uint16_t PCRI1;
    __IO uint16_t PFSRI1;
    __IO uint16_t PCRI2;
    __IO uint16_t PFSRI2;
    __IO uint16_t PCRI3;
    __IO uint16_t PFSRI3;
    __IO uint16_t PCRI4;
    __IO uint16_t PFSRI4;
    __IO uint16_t PCRI5;
    __IO uint16_t PFSRI5;
    __IO uint16_t PCRI6;
    __IO uint16_t PFSRI6;
    __IO uint16_t PCRI7;
    __IO uint16_t PFSRI7;
    __IO uint16_t PCRI8;
    __IO uint16_t PFSRI8;
    __IO uint16_t PCRI9;
    __IO uint16_t PFSRI9;
    __IO uint16_t PCRI10;
    __IO uint16_t PFSRI10;
    __IO uint16_t PCRI11;
    __IO uint16_t PFSRI11;
    __IO uint16_t PCRI12;
    __IO uint16_t PFSRI12;
    __IO uint16_t PCRI13;
    __IO uint16_t PFSRI13;
} M4_GPIO_TypeDef;

/**
 * @brief HASH
 */
typedef struct
{
    __IO uint32_t CR;
    uint8_t RESERVED0[12];
    __IO uint32_t HR7;
    __IO uint32_t HR6;
    __IO uint32_t HR5;
    __IO uint32_t HR4;
    __IO uint32_t HR3;
    __IO uint32_t HR2;
    __IO uint32_t HR1;
    __IO uint32_t HR0;
    uint8_t RESERVED1[16];
    __IO uint32_t DR15;
    __IO uint32_t DR14;
    __IO uint32_t DR13;
    __IO uint32_t DR12;
    __IO uint32_t DR11;
    __IO uint32_t DR10;
    __IO uint32_t DR9;
    __IO uint32_t DR8;
    __IO uint32_t DR7;
    __IO uint32_t DR6;
    __IO uint32_t DR5;
    __IO uint32_t DR4;
    __IO uint32_t DR3;
    __IO uint32_t DR2;
    __IO uint32_t DR1;
    __IO uint32_t DR0;
} M4_HASH_TypeDef;

/**
 * @brief HRPWM
 */
typedef struct
{
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __IO uint32_t CR3;
    __IO uint32_t CR4;
    __IO uint32_t CR5;
    __IO uint32_t CR6;
    __IO uint32_t CR7;
    __IO uint32_t CR8;
    __IO uint32_t CR9;
    __IO uint32_t CR10;
    __IO uint32_t CR11;
    __IO uint32_t CR12;
    __IO uint32_t CR13;
    __IO uint32_t CR14;
    __IO uint32_t CR15;
    __IO uint32_t CR16;
    uint8_t RESERVED0[16];
    __IO uint32_t CALCR0;
    __IO uint32_t CALCR1;
} M4_HRPWM_TypeDef;

/**
 * @brief I2C
 */
typedef struct
{
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __IO uint32_t CR3;
    uint8_t RESERVED0[4];
    __IO uint32_t SLR0;
    __IO uint32_t SLR1;
    __IO uint32_t SLTR;
    __IO uint32_t SR;
    __IO uint32_t CLR;
    __IO uint8_t  DTR;
    uint8_t RESERVED1[3];
    __IO uint8_t  DRR;
    uint8_t RESERVED2[3];
    __IO uint32_t CCR;
    __IO uint32_t FLTR;
} M4_I2C_TypeDef;

/**
 * @brief I2S
 */
typedef struct
{
    __IO uint32_t CTRL;
    __IO uint32_t SR;
    __IO uint32_t ER;
    __IO uint32_t CFGR;
    __IO uint32_t TXBUF;
    __IO uint32_t RXBUF;
    __IO uint32_t PR;
} M4_I2S_TypeDef;

/**
 * @brief ICG
 */
typedef struct
{
    __IO uint32_t ICG0;
    __IO uint32_t ICG1;
    __IO uint32_t ICG2;
    __IO uint32_t ICG3;
} M4_ICG_TypeDef;

/**
 * @brief INTC
 */
typedef struct
{
    __IO uint32_t NOCCR;
    __IO uint32_t NMIENR;
    __IO uint32_t NMIFR;
    __IO uint32_t NMICFR;
    __IO uint32_t EIRQCR0;
    __IO uint32_t EIRQCR1;
    __IO uint32_t EIRQCR2;
    __IO uint32_t EIRQCR3;
    __IO uint32_t EIRQCR4;
    __IO uint32_t EIRQCR5;
    __IO uint32_t EIRQCR6;
    __IO uint32_t EIRQCR7;
    __IO uint32_t EIRQCR8;
    __IO uint32_t EIRQCR9;
    __IO uint32_t EIRQCR10;
    __IO uint32_t EIRQCR11;
    __IO uint32_t EIRQCR12;
    __IO uint32_t EIRQCR13;
    __IO uint32_t EIRQCR14;
    __IO uint32_t EIRQCR15;
    __IO uint32_t WUPEN;
    __IO uint32_t EIFR;
    __IO uint32_t EICFR;
    __IO uint32_t SEL0;
    __IO uint32_t SEL1;
    __IO uint32_t SEL2;
    __IO uint32_t SEL3;
    __IO uint32_t SEL4;
    __IO uint32_t SEL5;
    __IO uint32_t SEL6;
    __IO uint32_t SEL7;
    __IO uint32_t SEL8;
    __IO uint32_t SEL9;
    __IO uint32_t SEL10;
    __IO uint32_t SEL11;
    __IO uint32_t SEL12;
    __IO uint32_t SEL13;
    __IO uint32_t SEL14;
    __IO uint32_t SEL15;
    __IO uint32_t SEL16;
    __IO uint32_t SEL17;
    __IO uint32_t SEL18;
    __IO uint32_t SEL19;
    __IO uint32_t SEL20;
    __IO uint32_t SEL21;
    __IO uint32_t SEL22;
    __IO uint32_t SEL23;
    __IO uint32_t SEL24;
    __IO uint32_t SEL25;
    __IO uint32_t SEL26;
    __IO uint32_t SEL27;
    __IO uint32_t SEL28;
    __IO uint32_t SEL29;
    __IO uint32_t SEL30;
    __IO uint32_t SEL31;
    __IO uint32_t SEL32;
    __IO uint32_t SEL33;
    __IO uint32_t SEL34;
    __IO uint32_t SEL35;
    __IO uint32_t SEL36;
    __IO uint32_t SEL37;
    __IO uint32_t SEL38;
    __IO uint32_t SEL39;
    __IO uint32_t SEL40;
    __IO uint32_t SEL41;
    __IO uint32_t SEL42;
    __IO uint32_t SEL43;
    __IO uint32_t SEL44;
    __IO uint32_t SEL45;
    __IO uint32_t SEL46;
    __IO uint32_t SEL47;
    __IO uint32_t SEL48;
    __IO uint32_t SEL49;
    __IO uint32_t SEL50;
    __IO uint32_t SEL51;
    __IO uint32_t SEL52;
    __IO uint32_t SEL53;
    __IO uint32_t SEL54;
    __IO uint32_t SEL55;
    __IO uint32_t SEL56;
    __IO uint32_t SEL57;
    __IO uint32_t SEL58;
    __IO uint32_t SEL59;
    __IO uint32_t SEL60;
    __IO uint32_t SEL61;
    __IO uint32_t SEL62;
    __IO uint32_t SEL63;
    __IO uint32_t SEL64;
    __IO uint32_t SEL65;
    __IO uint32_t SEL66;
    __IO uint32_t SEL67;
    __IO uint32_t SEL68;
    __IO uint32_t SEL69;
    __IO uint32_t SEL70;
    __IO uint32_t SEL71;
    __IO uint32_t SEL72;
    __IO uint32_t SEL73;
    __IO uint32_t SEL74;
    __IO uint32_t SEL75;
    __IO uint32_t SEL76;
    __IO uint32_t SEL77;
    __IO uint32_t SEL78;
    __IO uint32_t SEL79;
    __IO uint32_t SEL80;
    __IO uint32_t SEL81;
    __IO uint32_t SEL82;
    __IO uint32_t SEL83;
    __IO uint32_t SEL84;
    __IO uint32_t SEL85;
    __IO uint32_t SEL86;
    __IO uint32_t SEL87;
    __IO uint32_t SEL88;
    __IO uint32_t SEL89;
    __IO uint32_t SEL90;
    __IO uint32_t SEL91;
    __IO uint32_t SEL92;
    __IO uint32_t SEL93;
    __IO uint32_t SEL94;
    __IO uint32_t SEL95;
    __IO uint32_t SEL96;
    __IO uint32_t SEL97;
    __IO uint32_t SEL98;
    __IO uint32_t SEL99;
    __IO uint32_t SEL100;
    __IO uint32_t SEL101;
    __IO uint32_t SEL102;
    __IO uint32_t SEL103;
    __IO uint32_t SEL104;
    __IO uint32_t SEL105;
    __IO uint32_t SEL106;
    __IO uint32_t SEL107;
    __IO uint32_t SEL108;
    __IO uint32_t SEL109;
    __IO uint32_t SEL110;
    __IO uint32_t SEL111;
    __IO uint32_t SEL112;
    __IO uint32_t SEL113;
    __IO uint32_t SEL114;
    __IO uint32_t SEL115;
    __IO uint32_t SEL116;
    __IO uint32_t SEL117;
    __IO uint32_t SEL118;
    __IO uint32_t SEL119;
    __IO uint32_t SEL120;
    __IO uint32_t SEL121;
    __IO uint32_t SEL122;
    __IO uint32_t SEL123;
    __IO uint32_t SEL124;
    __IO uint32_t SEL125;
    __IO uint32_t SEL126;
    __IO uint32_t SEL127;
    __IO uint32_t VSSEL128;
    __IO uint32_t VSSEL129;
    __IO uint32_t VSSEL130;
    __IO uint32_t VSSEL131;
    __IO uint32_t VSSEL132;
    __IO uint32_t VSSEL133;
    __IO uint32_t VSSEL134;
    __IO uint32_t VSSEL135;
    __IO uint32_t VSSEL136;
    __IO uint32_t VSSEL137;
    __IO uint32_t VSSEL138;
    __IO uint32_t VSSEL139;
    __IO uint32_t VSSEL140;
    __IO uint32_t VSSEL141;
    __IO uint32_t VSSEL142;
    __IO uint32_t VSSEL143;
    __IO uint32_t SWIER;
    __IO uint32_t EVTER;
    __IO uint32_t IER;
} M4_INTC_TypeDef;

/**
 * @brief KEYSCAN
 */
typedef struct
{
    __IO uint32_t SCR;
    __IO uint32_t SER;
    __IO uint32_t SSR;
} M4_KEYSCAN_TypeDef;

/**
 * @brief MAU
 */
typedef struct
{
    __IO uint32_t CSR;
    __IO uint32_t DTR0;
    uint8_t RESERVED0[4];
    __IO uint32_t RTR0;
    __IO uint32_t DTR1;
    __IO uint32_t RTR1;
} M4_MAU_TypeDef;

/**
 * @brief MPU
 */
typedef struct
{
    __IO uint32_t RGD0;
    __IO uint32_t RGD1;
    __IO uint32_t RGD2;
    __IO uint32_t RGD3;
    __IO uint32_t RGD4;
    __IO uint32_t RGD5;
    __IO uint32_t RGD6;
    __IO uint32_t RGD7;
    __IO uint32_t RGD8;
    __IO uint32_t RGD9;
    __IO uint32_t RGD10;
    __IO uint32_t RGD11;
    __IO uint32_t RGD12;
    __IO uint32_t RGD13;
    __IO uint32_t RGD14;
    __IO uint32_t RGD15;
    __IO uint32_t SR;
    __IO uint32_t ECLR;
    __IO uint32_t WP;
    __IO uint32_t IPPR;
    __IO uint32_t S1RGE;
    __IO uint32_t S1RGWP;
    __IO uint32_t S1RGRP;
    __IO uint32_t S1CR;
    __IO uint32_t S2RGE;
    __IO uint32_t S2RGWP;
    __IO uint32_t S2RGRP;
    __IO uint32_t S2CR;
    __IO uint32_t FRGE;
    __IO uint32_t FRGWP;
    __IO uint32_t FRGRP;
    __IO uint32_t FCR;
    __IO uint32_t HRGE;
    __IO uint32_t HRGWP;
    __IO uint32_t HRGRP;
    __IO uint32_t HCR;
    __IO uint32_t ERGE;
    __IO uint32_t ERGWP;
    __IO uint32_t ERGRP;
    __IO uint32_t ECR;
} M4_MPU_TypeDef;

/**
 * @brief NFC
 */
typedef struct
{
    __IO uint32_t DATR_BASE;
    uint8_t RESERVED0[32764];
    __IO uint32_t CMDR;
    __IO uint32_t IDXR0;
    uint8_t RESERVED1[40];
    __IO uint32_t IENR;
    __IO uint32_t ISTR;
    __IO uint32_t IRSR;
    uint8_t RESERVED2[12];
    __IO uint32_t IDXR1;
    __IO uint32_t TMCR0;
    __IO uint32_t TMCR1;
    __IO uint32_t BACR;
    uint8_t RESERVED3[4];
    __IO uint32_t TMCR2;
    __IO uint32_t ECCR0;
    __IO uint32_t ECCR1;
    __IO uint32_t ECCR2;
    __IO uint32_t ECCR3;
    __IO uint32_t ECCR4;
    __IO uint32_t ECCR5;
    __IO uint32_t ECCR6;
    __IO uint32_t ECC_STAT;
    __IO uint32_t ECC_SYND0_0;
    __IO uint32_t ECC_SYND0_1;
    __IO uint32_t ECC_SYND0_2;
    __IO uint32_t ECC_SYND0_3;
    __IO uint32_t ECC_SYND1_0;
    __IO uint32_t ECC_SYND1_1;
    __IO uint32_t ECC_SYND1_2;
    __IO uint32_t ECC_SYND1_3;
    __IO uint32_t ECC_SYND2_0;
    __IO uint32_t ECC_SYND2_1;
    __IO uint32_t ECC_SYND2_2;
    __IO uint32_t ECC_SYND2_3;
    __IO uint32_t ECC_SYND3_0;
    __IO uint32_t ECC_SYND3_1;
    __IO uint32_t ECC_SYND3_2;
    __IO uint32_t ECC_SYND3_3;
    __IO uint32_t ECC_SYND4_0;
    __IO uint32_t ECC_SYND4_1;
    __IO uint32_t ECC_SYND4_2;
    __IO uint32_t ECC_SYND4_3;
    __IO uint32_t ECC_SYND5_0;
    __IO uint32_t ECC_SYND5_1;
    __IO uint32_t ECC_SYND5_2;
    __IO uint32_t ECC_SYND5_3;
    __IO uint32_t ECC_SYND6_0;
    __IO uint32_t ECC_SYND6_1;
    __IO uint32_t ECC_SYND6_2;
    __IO uint32_t ECC_SYND6_3;
    __IO uint32_t ECC_SYND7_0;
    __IO uint32_t ECC_SYND7_1;
    __IO uint32_t ECC_SYND7_2;
    __IO uint32_t ECC_SYND7_3;
    __IO uint32_t ECC_SYND8_0;
    __IO uint32_t ECC_SYND8_1;
    __IO uint32_t ECC_SYND8_2;
    __IO uint32_t ECC_SYND8_3;
    __IO uint32_t ECC_SYND9_0;
    __IO uint32_t ECC_SYND9_1;
    __IO uint32_t ECC_SYND9_2;
    __IO uint32_t ECC_SYND9_3;
    __IO uint32_t ECC_SYND10_0;
    __IO uint32_t ECC_SYND10_1;
    __IO uint32_t ECC_SYND10_2;
    __IO uint32_t ECC_SYND10_3;
    __IO uint32_t ECC_SYND11_0;
    __IO uint32_t ECC_SYND11_1;
    __IO uint32_t ECC_SYND11_2;
    __IO uint32_t ECC_SYND11_3;
    __IO uint32_t ECC_SYND12_0;
    __IO uint32_t ECC_SYND12_1;
    __IO uint32_t ECC_SYND12_2;
    __IO uint32_t ECC_SYND12_3;
    __IO uint32_t ECC_SYND13_0;
    __IO uint32_t ECC_SYND13_1;
    __IO uint32_t ECC_SYND13_2;
    __IO uint32_t ECC_SYND13_3;
    __IO uint32_t ECC_SYND14_0;
    __IO uint32_t ECC_SYND14_1;
    __IO uint32_t ECC_SYND14_2;
    __IO uint32_t ECC_SYND14_3;
    __IO uint32_t ECC_SYND15_0;
    __IO uint32_t ECC_SYND15_1;
    __IO uint32_t ECC_SYND15_2;
    __IO uint32_t ECC_SYND15_3;
} M4_NFC_TypeDef;

/**
 * @brief OTS
 */
typedef struct
{
    __IO uint16_t CTL;
    __IO uint16_t DR1;
    __IO uint16_t DR2;
    __IO uint16_t ECR;
    __IO uint32_t LPR;
} M4_OTS_TypeDef;

/**
 * @brief PERIC
 */
typedef struct
{
    __IO uint32_t USB_SYCTLREG;
    __IO uint32_t SDIOC_SYCTLREG;
    __IO uint32_t NFC_SYCTLREG;
    __IO uint32_t EXMC_ENAR;
    uint8_t RESERVED0[8];
    __IO uint32_t CAN_SYCTLREG;
    __IO uint32_t USART1_NFC;
    uint8_t RESERVED1[8];
    __IO uint32_t NFC_SYSTATREG;
} M4_PERIC_TypeDef;

