levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*******************************************************************************
                Bit definition for Peripheral ADC
*******************************************************************************/
/*  Bit definition for ADC_STR register  */
#define ADC_STR_STRT                                   (0x01U)

/*  Bit definition for ADC_CR0 register  */
#define ADC_CR0_MS_POS                                 (0U)
#define ADC_CR0_MS                                     (0x0003U)
#define ADC_CR0_MS_0                                   (0x0001U)
#define ADC_CR0_MS_1                                   (0x0002U)
#define ADC_CR0_ACCSEL_POS                             (4U)
#define ADC_CR0_ACCSEL                                 (0x0030U)
#define ADC_CR0_ACCSEL_0                               (0x0010U)
#define ADC_CR0_ACCSEL_1                               (0x0020U)
#define ADC_CR0_CLREN_POS                              (6U)
#define ADC_CR0_CLREN                                  (0x0040U)
#define ADC_CR0_DFMT_POS                               (7U)
#define ADC_CR0_DFMT                                   (0x0080U)
#define ADC_CR0_AVCNT_POS                              (8U)
#define ADC_CR0_AVCNT                                  (0x0700U)
#define ADC_CR0_AVCNT_0                                (0x0100U)
#define ADC_CR0_AVCNT_1                                (0x0200U)
#define ADC_CR0_AVCNT_2                                (0x0400U)

/*  Bit definition for ADC_CR1 register  */
#define ADC_CR1_RSCHSEL_POS                            (2U)
#define ADC_CR1_RSCHSEL                                (0x0004U)

/*  Bit definition for ADC_TRGSR register  */
#define ADC_TRGSR_TRGSELA_POS                          (0U)
#define ADC_TRGSR_TRGSELA                              (0x0003U)
#define ADC_TRGSR_TRGSELA_0                            (0x0001U)
#define ADC_TRGSR_TRGSELA_1                            (0x0002U)
#define ADC_TRGSR_TRGENA_POS                           (7U)
#define ADC_TRGSR_TRGENA                               (0x0080U)
#define ADC_TRGSR_TRGSELB_POS                          (8U)
#define ADC_TRGSR_TRGSELB                              (0x0300U)
#define ADC_TRGSR_TRGSELB_0                            (0x0100U)
#define ADC_TRGSR_TRGSELB_1                            (0x0200U)
#define ADC_TRGSR_TRGENB_POS                           (15U)
#define ADC_TRGSR_TRGENB                               (0x8000U)

/*  Bit definition for ADC_CHSELRA register  */
#define ADC_CHSELRA_CHSELA                             (0x000FFFFFUL)

/*  Bit definition for ADC_CHSELRB register  */
#define ADC_CHSELRB_CHSELB                             (0x000FFFFFUL)

/*  Bit definition for ADC_AVCHSELR register  */
#define ADC_AVCHSELR_AVCHSEL                           (0x000FFFFFUL)

/*  Bit definition for ADC_EXCHSELR register  */
#define ADC_EXCHSELR_EXCHSEL                           (0x01U)

/*  Bit definition for ADC_SHCR register  */
#define ADC_SHCR_SHSST_POS                             (0U)
#define ADC_SHCR_SHSST                                 (0x00FFU)
#define ADC_SHCR_SHSST_0                               (0x0001U)
#define ADC_SHCR_SHSST_1                               (0x0002U)
#define ADC_SHCR_SHSST_2                               (0x0004U)
#define ADC_SHCR_SHSST_3                               (0x0008U)
#define ADC_SHCR_SHSST_4                               (0x0010U)
#define ADC_SHCR_SHSST_5                               (0x0020U)
#define ADC_SHCR_SHSST_6                               (0x0040U)
#define ADC_SHCR_SHSST_7                               (0x0080U)
#define ADC_SHCR_SHSEL_POS                             (8U)
#define ADC_SHCR_SHSEL                                 (0x0700U)
#define ADC_SHCR_SHSEL_0                               (0x0100U)
#define ADC_SHCR_SHSEL_1                               (0x0200U)
#define ADC_SHCR_SHSEL_2                               (0x0400U)

/*  Bit definition for ADC_SSTR0 register  */
#define ADC_SSTR0                                      (0xFFU)

/*  Bit definition for ADC_SSTR1 register  */
#define ADC_SSTR1                                      (0xFFU)

/*  Bit definition for ADC_SSTR2 register  */
#define ADC_SSTR2                                      (0xFFU)

/*  Bit definition for ADC_SSTR3 register  */
#define ADC_SSTR3                                      (0xFFU)

/*  Bit definition for ADC_SSTR4 register  */
#define ADC_SSTR4                                      (0xFFU)

/*  Bit definition for ADC_SSTR5 register  */
#define ADC_SSTR5                                      (0xFFU)

/*  Bit definition for ADC_SSTR6 register  */
#define ADC_SSTR6                                      (0xFFU)

/*  Bit definition for ADC_SSTR7 register  */
#define ADC_SSTR7                                      (0xFFU)

/*  Bit definition for ADC_SSTR8 register  */
#define ADC_SSTR8                                      (0xFFU)

/*  Bit definition for ADC_SSTR9 register  */
#define ADC_SSTR9                                      (0xFFU)

/*  Bit definition for ADC_SSTR10 register  */
#define ADC_SSTR10                                     (0xFFU)

/*  Bit definition for ADC_SSTR11 register  */
#define ADC_SSTR11                                     (0xFFU)

/*  Bit definition for ADC_SSTR12 register  */
#define ADC_SSTR12                                     (0xFFU)

/*  Bit definition for ADC_SSTR13 register  */
#define ADC_SSTR13                                     (0xFFU)

/*  Bit definition for ADC_SSTR14 register  */
#define ADC_SSTR14                                     (0xFFU)

/*  Bit definition for ADC_SSTR15 register  */
#define ADC_SSTR15                                     (0xFFU)

/*  Bit definition for ADC_SSTRL register  */
#define ADC_SSTRL                                      (0xFFU)

/*  Bit definition for ADC_CHMUXR0 register  */
#define ADC_CHMUXR0_CH00MUX_POS                        (0U)
#define ADC_CHMUXR0_CH00MUX                            (0x000FU)
#define ADC_CHMUXR0_CH00MUX_0                          (0x0001U)
#define ADC_CHMUXR0_CH00MUX_1                          (0x0002U)
#define ADC_CHMUXR0_CH00MUX_2                          (0x0004U)
#define ADC_CHMUXR0_CH00MUX_3                          (0x0008U)
#define ADC_CHMUXR0_CH01MUX_POS                        (4U)
#define ADC_CHMUXR0_CH01MUX                            (0x00F0U)
#define ADC_CHMUXR0_CH01MUX_0                          (0x0010U)
#define ADC_CHMUXR0_CH01MUX_1                          (0x0020U)
#define ADC_CHMUXR0_CH01MUX_2                          (0x0040U)
#define ADC_CHMUXR0_CH01MUX_3                          (0x0080U)
#define ADC_CHMUXR0_CH02MUX_POS                        (8U)
#define ADC_CHMUXR0_CH02MUX                            (0x0F00U)
#define ADC_CHMUXR0_CH02MUX_0                          (0x0100U)
#define ADC_CHMUXR0_CH02MUX_1                          (0x0200U)
#define ADC_CHMUXR0_CH02MUX_2                          (0x0400U)
#define ADC_CHMUXR0_CH02MUX_3                          (0x0800U)
#define ADC_CHMUXR0_CH03MUX_POS                        (12U)
#define ADC_CHMUXR0_CH03MUX                            (0xF000U)
#define ADC_CHMUXR0_CH03MUX_0                          (0x1000U)
#define ADC_CHMUXR0_CH03MUX_1                          (0x2000U)
#define ADC_CHMUXR0_CH03MUX_2                          (0x4000U)
#define ADC_CHMUXR0_CH03MUX_3                          (0x8000U)

/*  Bit definition for ADC_CHMUXR1 register  */
#define ADC_CHMUXR1_CH04MUX_POS                        (0U)
#define ADC_CHMUXR1_CH04MUX                            (0x000FU)
#define ADC_CHMUXR1_CH04MUX_0                          (0x0001U)
#define ADC_CHMUXR1_CH04MUX_1                          (0x0002U)
#define ADC_CHMUXR1_CH04MUX_2                          (0x0004U)
#define ADC_CHMUXR1_CH04MUX_3                          (0x0008U)
#define ADC_CHMUXR1_CH05MUX_POS                        (4U)
#define ADC_CHMUXR1_CH05MUX                            (0x00F0U)
#define ADC_CHMUXR1_CH05MUX_0                          (0x0010U)
#define ADC_CHMUXR1_CH05MUX_1                          (0x0020U)
#define ADC_CHMUXR1_CH05MUX_2                          (0x0040U)
#define ADC_CHMUXR1_CH05MUX_3                          (0x0080U)
#define ADC_CHMUXR1_CH06MUX_POS                        (8U)
#define ADC_CHMUXR1_CH06MUX                            (0x0F00U)
#define ADC_CHMUXR1_CH06MUX_0                          (0x0100U)
#define ADC_CHMUXR1_CH06MUX_1                          (0x0200U)
#define ADC_CHMUXR1_CH06MUX_2                          (0x0400U)
#define ADC_CHMUXR1_CH06MUX_3                          (0x0800U)
#define ADC_CHMUXR1_CH07MUX_POS                        (12U)
#define ADC_CHMUXR1_CH07MUX                            (0xF000U)
#define ADC_CHMUXR1_CH07MUX_0                          (0x1000U)
#define ADC_CHMUXR1_CH07MUX_1                          (0x2000U)
#define ADC_CHMUXR1_CH07MUX_2                          (0x4000U)
#define ADC_CHMUXR1_CH07MUX_3                          (0x8000U)

/*  Bit definition for ADC_CHMUXR2 register  */
#define ADC_CHMUXR2_CH08MUX_POS                        (0U)
#define ADC_CHMUXR2_CH08MUX                            (0x000FU)
#define ADC_CHMUXR2_CH08MUX_0                          (0x0001U)
#define ADC_CHMUXR2_CH08MUX_1                          (0x0002U)
#define ADC_CHMUXR2_CH08MUX_2                          (0x0004U)
#define ADC_CHMUXR2_CH08MUX_3                          (0x0008U)
#define ADC_CHMUXR2_CH09MUX_POS                        (4U)
#define ADC_CHMUXR2_CH09MUX                            (0x00F0U)
#define ADC_CHMUXR2_CH09MUX_0                          (0x0010U)
#define ADC_CHMUXR2_CH09MUX_1                          (0x0020U)
#define ADC_CHMUXR2_CH09MUX_2                          (0x0040U)
#define ADC_CHMUXR2_CH09MUX_3                          (0x0080U)
#define ADC_CHMUXR2_CH10MUX_POS                        (8U)
#define ADC_CHMUXR2_CH10MUX                            (0x0F00U)
#define ADC_CHMUXR2_CH10MUX_0                          (0x0100U)
#define ADC_CHMUXR2_CH10MUX_1                          (0x0200U)
#define ADC_CHMUXR2_CH10MUX_2                          (0x0400U)
#define ADC_CHMUXR2_CH10MUX_3                          (0x0800U)
#define ADC_CHMUXR2_CH11MUX_POS                        (12U)
#define ADC_CHMUXR2_CH11MUX                            (0xF000U)
#define ADC_CHMUXR2_CH11MUX_0                          (0x1000U)
#define ADC_CHMUXR2_CH11MUX_1                          (0x2000U)
#define ADC_CHMUXR2_CH11MUX_2                          (0x4000U)
#define ADC_CHMUXR2_CH11MUX_3                          (0x8000U)

/*  Bit definition for ADC_CHMUXR3 register  */
#define ADC_CHMUXR3_CH12MUX_POS                        (0U)
#define ADC_CHMUXR3_CH12MUX                            (0x000FU)
#define ADC_CHMUXR3_CH12MUX_0                          (0x0001U)
#define ADC_CHMUXR3_CH12MUX_1                          (0x0002U)
#define ADC_CHMUXR3_CH12MUX_2                          (0x0004U)
#define ADC_CHMUXR3_CH12MUX_3                          (0x0008U)
#define ADC_CHMUXR3_CH13MUX_POS                        (4U)
#define ADC_CHMUXR3_CH13MUX                            (0x00F0U)
#define ADC_CHMUXR3_CH13MUX_0                          (0x0010U)
#define ADC_CHMUXR3_CH13MUX_1                          (0x0020U)
#define ADC_CHMUXR3_CH13MUX_2                          (0x0040U)
#define ADC_CHMUXR3_CH13MUX_3                          (0x0080U)
#define ADC_CHMUXR3_CH14MUX_POS                        (8U)
#define ADC_CHMUXR3_CH14MUX                            (0x0F00U)
#define ADC_CHMUXR3_CH14MUX_0                          (0x0100U)
#define ADC_CHMUXR3_CH14MUX_1                          (0x0200U)
#define ADC_CHMUXR3_CH14MUX_2                          (0x0400U)
#define ADC_CHMUXR3_CH14MUX_3                          (0x0800U)
#define ADC_CHMUXR3_CH15MUX_POS                        (12U)
#define ADC_CHMUXR3_CH15MUX                            (0xF000U)
#define ADC_CHMUXR3_CH15MUX_0                          (0x1000U)
#define ADC_CHMUXR3_CH15MUX_1                          (0x2000U)
#define ADC_CHMUXR3_CH15MUX_2                          (0x4000U)
#define ADC_CHMUXR3_CH15MUX_3                          (0x8000U)

/*  Bit definition for ADC_ISR register  */
#define ADC_ISR_EOCAF_POS                              (0U)
#define ADC_ISR_EOCAF                                  (0x01U)
#define ADC_ISR_EOCBF_POS                              (1U)
#define ADC_ISR_EOCBF                                  (0x02U)
#define ADC_ISR_SASTPDF_POS                            (4U)
#define ADC_ISR_SASTPDF                                (0x10U)

