levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for ADC_AWD1DR1 register  */
#define ADC_AWD1DR1                                    (0xFFFFU)

/*  Bit definition for ADC_AWD1CHSR register  */
#define ADC_AWD1CHSR_AWDCH                             (0x001FU)

/*  Bit definition for ADC_PGACR1 register  */
#define ADC_PGACR1_PGACTL_POS                          (0U)
#define ADC_PGACR1_PGACTL                              (0x0FU)
#define ADC_PGACR1_PGACTL_0                            (0x01U)
#define ADC_PGACR1_PGACTL_1                            (0x02U)
#define ADC_PGACR1_PGACTL_2                            (0x04U)
#define ADC_PGACR1_PGACTL_3                            (0x08U)
#define ADC_PGACR1_PGAGAIN_POS                         (4U)
#define ADC_PGACR1_PGAGAIN                             (0xF0U)
#define ADC_PGACR1_PGAGAIN_0                           (0x10U)
#define ADC_PGACR1_PGAGAIN_1                           (0x20U)
#define ADC_PGACR1_PGAGAIN_2                           (0x40U)
#define ADC_PGACR1_PGAGAIN_3                           (0x80U)

/*  Bit definition for ADC_PGACR2 register  */
#define ADC_PGACR2_PGACTL_POS                          (0U)
#define ADC_PGACR2_PGACTL                              (0x0FU)
#define ADC_PGACR2_PGACTL_0                            (0x01U)
#define ADC_PGACR2_PGACTL_1                            (0x02U)
#define ADC_PGACR2_PGACTL_2                            (0x04U)
#define ADC_PGACR2_PGACTL_3                            (0x08U)
#define ADC_PGACR2_PGAGAIN_POS                         (4U)
#define ADC_PGACR2_PGAGAIN                             (0xF0U)
#define ADC_PGACR2_PGAGAIN_0                           (0x10U)
#define ADC_PGACR2_PGAGAIN_1                           (0x20U)
#define ADC_PGACR2_PGAGAIN_2                           (0x40U)
#define ADC_PGACR2_PGAGAIN_3                           (0x80U)

/*  Bit definition for ADC_PGACR3 register  */
#define ADC_PGACR3_PGACTL_POS                          (0U)
#define ADC_PGACR3_PGACTL                              (0x0FU)
#define ADC_PGACR3_PGACTL_0                            (0x01U)
#define ADC_PGACR3_PGACTL_1                            (0x02U)
#define ADC_PGACR3_PGACTL_2                            (0x04U)
#define ADC_PGACR3_PGACTL_3                            (0x08U)
#define ADC_PGACR3_PGAGAIN_POS                         (4U)
#define ADC_PGACR3_PGAGAIN                             (0xF0U)
#define ADC_PGACR3_PGAGAIN_0                           (0x10U)
#define ADC_PGACR3_PGAGAIN_1                           (0x20U)
#define ADC_PGACR3_PGAGAIN_2                           (0x40U)
#define ADC_PGACR3_PGAGAIN_3                           (0x80U)

/*  Bit definition for ADC_PGAVSSENR register  */
#define ADC_PGAVSSENR_PGAVSSEN                         (0x07U)

/*******************************************************************************
                Bit definition for Peripheral AES
*******************************************************************************/
/*  Bit definition for AES_CR register  */
#define AES_CR_START_POS                               (0U)
#define AES_CR_START                                   (0x00000001UL)
#define AES_CR_MODE_POS                                (1U)
#define AES_CR_MODE                                    (0x00000002UL)
#define AES_CR_KEYSIZE_POS                             (3U)
#define AES_CR_KEYSIZE                                 (0x00000018UL)

/*  Bit definition for AES_DR0 register  */
#define AES_DR0                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_DR1 register  */
#define AES_DR1                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_DR2 register  */
#define AES_DR2                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_DR3 register  */
#define AES_DR3                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR0 register  */
#define AES_KR0                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR1 register  */
#define AES_KR1                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR2 register  */
#define AES_KR2                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR3 register  */
#define AES_KR3                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR4 register  */
#define AES_KR4                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR5 register  */
#define AES_KR5                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR6 register  */
#define AES_KR6                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR7 register  */
#define AES_KR7                                        (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral AOS
*******************************************************************************/
/*  Bit definition for AOS_INT_SFTTRG register  */
#define AOS_INT_SFTTRG_STRG                            (0x00000001UL)

/*  Bit definition for AOS_DCU_1_TRGSEL register  */
#define AOS_DCU_1_TRGSEL_TRGSEL_POS                    (0U)
#define AOS_DCU_1_TRGSEL_TRGSEL                        (0x000001FFUL)
#define AOS_DCU_1_TRGSEL_COMTRG_EN_POS                 (30U)
#define AOS_DCU_1_TRGSEL_COMTRG_EN                     (0xC0000000UL)
#define AOS_DCU_1_TRGSEL_COMTRG_EN_0                   (0x40000000UL)
#define AOS_DCU_1_TRGSEL_COMTRG_EN_1                   (0x80000000UL)

/*  Bit definition for AOS_DCU_2_TRGSEL register  */
#define AOS_DCU_2_TRGSEL_TRGSEL_POS                    (0U)
#define AOS_DCU_2_TRGSEL_TRGSEL                        (0x000001FFUL)
#define AOS_DCU_2_TRGSEL_COMTRG_EN_POS                 (30U)
#define AOS_DCU_2_TRGSEL_COMTRG_EN                     (0xC0000000UL)
#define AOS_DCU_2_TRGSEL_COMTRG_EN_0                   (0x40000000UL)
#define AOS_DCU_2_TRGSEL_COMTRG_EN_1                   (0x80000000UL)

