levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for AOS_DCU_3_TRGSEL register  */
#define AOS_DCU_3_TRGSEL_TRGSEL_POS                    (0U)
#define AOS_DCU_3_TRGSEL_TRGSEL                        (0x000001FFUL)
#define AOS_DCU_3_TRGSEL_COMTRG_EN_POS                 (30U)
#define AOS_DCU_3_TRGSEL_COMTRG_EN                     (0xC0000000UL)
#define AOS_DCU_3_TRGSEL_COMTRG_EN_0                   (0x40000000UL)
#define AOS_DCU_3_TRGSEL_COMTRG_EN_1                   (0x80000000UL)

/*  Bit definition for AOS_DCU_4_TRGSEL register  */
#define AOS_DCU_4_TRGSEL_TRGSEL_POS                    (0U)
#define AOS_DCU_4_TRGSEL_TRGSEL                        (0x000001FFUL)
#define AOS_DCU_4_TRGSEL_COMTRG_EN_POS                 (30U)
#define AOS_DCU_4_TRGSEL_COMTRG_EN                     (0xC0000000UL)
#define AOS_DCU_4_TRGSEL_COMTRG_EN_0                   (0x40000000UL)
#define AOS_DCU_4_TRGSEL_COMTRG_EN_1                   (0x80000000UL)

/*  Bit definition for AOS_DMA_1_TRGSEL register  */
#define AOS_DMA_1_TRGSEL_TRGSEL_POS                    (0U)
#define AOS_DMA_1_TRGSEL_TRGSEL                        (0x000001FFUL)
#define AOS_DMA_1_TRGSEL_COMTRG_EN_POS                 (30U)
#define AOS_DMA_1_TRGSEL_COMTRG_EN                     (0xC0000000UL)
#define AOS_DMA_1_TRGSEL_COMTRG_EN_0                   (0x40000000UL)
#define AOS_DMA_1_TRGSEL_COMTRG_EN_1                   (0x80000000UL)

/*  Bit definition for AOS_DMA_2_TRGSEL register  */
#define AOS_DMA_2_TRGSEL_TRGSEL_POS                    (0U)
#define AOS_DMA_2_TRGSEL_TRGSEL                        (0x000001FFUL)
#define AOS_DMA_2_TRGSEL_COMTRG_EN_POS                 (30U)
#define AOS_DMA_2_TRGSEL_COMTRG_EN                     (0xC0000000UL)
#define AOS_DMA_2_TRGSEL_COMTRG_EN_0                   (0x40000000UL)
#define AOS_DMA_2_TRGSEL_COMTRG_EN_1                   (0x80000000UL)

/*  Bit definition for AOS_DMA_TRGSELRC register  */
#define AOS_DMA_TRGSELRC_TRGSEL_POS                    (0U)
#define AOS_DMA_TRGSELRC_TRGSEL                        (0x000001FFUL)
#define AOS_DMA_TRGSELRC_COMTRG_EN_POS                 (30U)
#define AOS_DMA_TRGSELRC_COMTRG_EN                     (0xC0000000UL)
#define AOS_DMA_TRGSELRC_COMTRG_EN_0                   (0x40000000UL)
#define AOS_DMA_TRGSELRC_COMTRG_EN_1                   (0x80000000UL)

/*  Bit definition for AOS_TMR6_HTSSR register  */
#define AOS_TMR6_HTSSR_TRGSEL_POS                      (0U)
#define AOS_TMR6_HTSSR_TRGSEL                          (0x000001FFUL)
#define AOS_TMR6_HTSSR_COMTRG_EN_POS                   (30U)
#define AOS_TMR6_HTSSR_COMTRG_EN                       (0xC0000000UL)
#define AOS_TMR6_HTSSR_COMTRG_EN_0                     (0x40000000UL)
#define AOS_TMR6_HTSSR_COMTRG_EN_1                     (0x80000000UL)

/*  Bit definition for AOS_PORT_PEVNTTRGSR12 register  */
#define AOS_PORT_PEVNTTRGSR12_TRGSEL_POS               (0U)
#define AOS_PORT_PEVNTTRGSR12_TRGSEL                   (0x000001FFUL)
#define AOS_PORT_PEVNTTRGSR12_COMTRG_EN_POS            (30U)
#define AOS_PORT_PEVNTTRGSR12_COMTRG_EN                (0xC0000000UL)
#define AOS_PORT_PEVNTTRGSR12_COMTRG_EN_0              (0x40000000UL)
#define AOS_PORT_PEVNTTRGSR12_COMTRG_EN_1              (0x80000000UL)

/*  Bit definition for AOS_PORT_PEVNTTRGSR34 register  */
#define AOS_PORT_PEVNTTRGSR34_TRGSEL_POS               (0U)
#define AOS_PORT_PEVNTTRGSR34_TRGSEL                   (0x000001FFUL)
#define AOS_PORT_PEVNTTRGSR34_COMTRG_EN_POS            (30U)
#define AOS_PORT_PEVNTTRGSR34_COMTRG_EN                (0xC0000000UL)
#define AOS_PORT_PEVNTTRGSR34_COMTRG_EN_0              (0x40000000UL)
#define AOS_PORT_PEVNTTRGSR34_COMTRG_EN_1              (0x80000000UL)

/*  Bit definition for AOS_TMR0_HTSSR register  */
#define AOS_TMR0_HTSSR_TRGSEL_POS                      (0U)
#define AOS_TMR0_HTSSR_TRGSEL                          (0x000001FFUL)
#define AOS_TMR0_HTSSR_COMTRG_EN_POS                   (30U)
#define AOS_TMR0_HTSSR_COMTRG_EN                       (0xC0000000UL)
#define AOS_TMR0_HTSSR_COMTRG_EN_0                     (0x40000000UL)
#define AOS_TMR0_HTSSR_COMTRG_EN_1                     (0x80000000UL)

/*  Bit definition for AOS_TMR2_HTSSR register  */
#define AOS_TMR2_HTSSR_TRGSEL_POS                      (0U)
#define AOS_TMR2_HTSSR_TRGSEL                          (0x000001FFUL)
#define AOS_TMR2_HTSSR_COMTRG_EN_POS                   (30U)
#define AOS_TMR2_HTSSR_COMTRG_EN                       (0xC0000000UL)
#define AOS_TMR2_HTSSR_COMTRG_EN_0                     (0x40000000UL)
#define AOS_TMR2_HTSSR_COMTRG_EN_1                     (0x80000000UL)

/*  Bit definition for AOS_HASH_ITRGSELA register  */
#define AOS_HASH_ITRGSELA_TRGSEL_POS                   (0U)
#define AOS_HASH_ITRGSELA_TRGSEL                       (0x000001FFUL)
#define AOS_HASH_ITRGSELA_COMTRG_EN_POS                (30U)
#define AOS_HASH_ITRGSELA_COMTRG_EN                    (0xC0000000UL)
#define AOS_HASH_ITRGSELA_COMTRG_EN_0                  (0x40000000UL)
#define AOS_HASH_ITRGSELA_COMTRG_EN_1                  (0x80000000UL)

/*  Bit definition for AOS_HASH_ITRGSELB register  */
#define AOS_HASH_ITRGSELB_TRGSEL_POS                   (0U)
#define AOS_HASH_ITRGSELB_TRGSEL                       (0x000001FFUL)
#define AOS_HASH_ITRGSELB_COMTRG_EN_POS                (30U)
#define AOS_HASH_ITRGSELB_COMTRG_EN                    (0xC0000000UL)
#define AOS_HASH_ITRGSELB_COMTRG_EN_0                  (0x40000000UL)
#define AOS_HASH_ITRGSELB_COMTRG_EN_1                  (0x80000000UL)

/*  Bit definition for AOS_TMRA_HTSSR register  */
#define AOS_TMRA_HTSSR_TRGSEL_POS                      (0U)
#define AOS_TMRA_HTSSR_TRGSEL                          (0x000001FFUL)
#define AOS_TMRA_HTSSR_COMTRG_EN_POS                   (30U)
#define AOS_TMRA_HTSSR_COMTRG_EN                       (0xC0000000UL)
#define AOS_TMRA_HTSSR_COMTRG_EN_0                     (0x40000000UL)
#define AOS_TMRA_HTSSR_COMTRG_EN_1                     (0x80000000UL)

/*  Bit definition for AOS_OTS_TRG register  */
#define AOS_OTS_TRG_TRGSEL_POS                         (0U)
#define AOS_OTS_TRG_TRGSEL                             (0x000001FFUL)
#define AOS_OTS_TRG_COMTRG_EN_POS                      (30U)
#define AOS_OTS_TRG_COMTRG_EN                          (0xC0000000UL)
#define AOS_OTS_TRG_COMTRG_EN_0                        (0x40000000UL)
#define AOS_OTS_TRG_COMTRG_EN_1                        (0x80000000UL)

/*  Bit definition for AOS_ADC_1_ITRGSELR register  */
#define AOS_ADC_1_ITRGSELR_TRGSEL_POS                  (0U)
#define AOS_ADC_1_ITRGSELR_TRGSEL                      (0x000001FFUL)
#define AOS_ADC_1_ITRGSELR_COMTRG_EN_POS               (30U)
#define AOS_ADC_1_ITRGSELR_COMTRG_EN                   (0xC0000000UL)
#define AOS_ADC_1_ITRGSELR_COMTRG_EN_0                 (0x40000000UL)
#define AOS_ADC_1_ITRGSELR_COMTRG_EN_1                 (0x80000000UL)

/*  Bit definition for AOS_ADC_2_ITRGSELR register  */
#define AOS_ADC_2_ITRGSELR_TRGSEL_POS                  (0U)
#define AOS_ADC_2_ITRGSELR_TRGSEL                      (0x000001FFUL)
#define AOS_ADC_2_ITRGSELR_COMTRG_EN_POS               (30U)
#define AOS_ADC_2_ITRGSELR_COMTRG_EN                   (0xC0000000UL)
#define AOS_ADC_2_ITRGSELR_COMTRG_EN_0                 (0x40000000UL)
#define AOS_ADC_2_ITRGSELR_COMTRG_EN_1                 (0x80000000UL)

/*  Bit definition for AOS_ADC_3_ITRGSELR register  */
#define AOS_ADC_3_ITRGSELR_TRGSEL_POS                  (0U)
#define AOS_ADC_3_ITRGSELR_TRGSEL                      (0x000001FFUL)
#define AOS_ADC_3_ITRGSELR_COMTRG_EN_POS               (30U)
#define AOS_ADC_3_ITRGSELR_COMTRG_EN                   (0xC0000000UL)
#define AOS_ADC_3_ITRGSELR_COMTRG_EN_0                 (0x40000000UL)
#define AOS_ADC_3_ITRGSELR_COMTRG_EN_1                 (0x80000000UL)

