levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for AOS_COMTRG1 register  */
#define AOS_COMTRG1_TRGSEL                             (0x000001FFUL)

/*  Bit definition for AOS_COMTRG2 register  */
#define AOS_COMTRG2_TRGSEL                             (0x000001FFUL)

/*  Bit definition for AOS_GPIO_PEVNTDIRR register  */
#define AOS_GPIO_PEVNTDIRR_PDIR                        (0x0000FFFFUL)

/*  Bit definition for AOS_GPIO_PEVNTIDR register  */
#define AOS_GPIO_PEVNTIDR_PIN                          (0x0000FFFFUL)

/*  Bit definition for AOS_GPIO_PEVNTODR register  */
#define AOS_GPIO_PEVNTODR_POUT                         (0x0000FFFFUL)

/*  Bit definition for AOS_GPIO_PEVNTORR register  */
#define AOS_GPIO_PEVNTORR_POR                          (0x0000FFFFUL)

/*  Bit definition for AOS_GPIO_PEVNTOSR register  */
#define AOS_GPIO_PEVNTOSR_POS                          (0x0000FFFFUL)

/*  Bit definition for AOS_GPIO_PEVNTRISR register  */
#define AOS_GPIO_PEVNTRISR_RIS                         (0x0000FFFFUL)

/*  Bit definition for AOS_GPIO_PEVNTFAL register  */
#define AOS_GPIO_PEVNTFAL_FAL                          (0x0000FFFFUL)

/*  Bit definition for AOS_GPIO_PEVNTNFCR register  */
#define AOS_GPIO_PEVNTNFCR_NFEN1_POS                   (0U)
#define AOS_GPIO_PEVNTNFCR_NFEN1                       (0x00000001UL)
#define AOS_GPIO_PEVNTNFCR_DIVS1_POS                   (1U)
#define AOS_GPIO_PEVNTNFCR_DIVS1                       (0x00000006UL)
#define AOS_GPIO_PEVNTNFCR_NFEN2_POS                   (8U)
#define AOS_GPIO_PEVNTNFCR_NFEN2                       (0x00000100UL)
#define AOS_GPIO_PEVNTNFCR_DIVS2_POS                   (9U)
#define AOS_GPIO_PEVNTNFCR_DIVS2                       (0x00000600UL)
#define AOS_GPIO_PEVNTNFCR_NFEN3_POS                   (16U)
#define AOS_GPIO_PEVNTNFCR_NFEN3                       (0x00010000UL)
#define AOS_GPIO_PEVNTNFCR_DIVS3_POS                   (17U)
#define AOS_GPIO_PEVNTNFCR_DIVS3                       (0x00060000UL)
#define AOS_GPIO_PEVNTNFCR_NFEN4_POS                   (24U)
#define AOS_GPIO_PEVNTNFCR_NFEN4                       (0x01000000UL)
#define AOS_GPIO_PEVNTNFCR_DIVS4_POS                   (25U)
#define AOS_GPIO_PEVNTNFCR_DIVS4                       (0x06000000UL)

/*******************************************************************************
                Bit definition for Peripheral CAN
*******************************************************************************/
/*  Bit definition for CAN_RBUF register  */
#define CAN_RBUF                                       (0xFFFFFFFFUL)

/*  Bit definition for CAN_TBUF register  */
#define CAN_TBUF                                       (0xFFFFFFFFUL)

/*  Bit definition for CAN_CFG_STAT register  */
#define CAN_CFG_STAT_BUSOFF_POS                        (0U)
#define CAN_CFG_STAT_BUSOFF                            (0x01U)
#define CAN_CFG_STAT_TACTIVE_POS                       (1U)
#define CAN_CFG_STAT_TACTIVE                           (0x02U)
#define CAN_CFG_STAT_RACTIVE_POS                       (2U)
#define CAN_CFG_STAT_RACTIVE                           (0x04U)
#define CAN_CFG_STAT_TSSS_POS                          (3U)
#define CAN_CFG_STAT_TSSS                              (0x08U)
#define CAN_CFG_STAT_TPSS_POS                          (4U)
#define CAN_CFG_STAT_TPSS                              (0x10U)
#define CAN_CFG_STAT_LBMI_POS                          (5U)
#define CAN_CFG_STAT_LBMI                              (0x20U)
#define CAN_CFG_STAT_LBME_POS                          (6U)
#define CAN_CFG_STAT_LBME                              (0x40U)
#define CAN_CFG_STAT_RESET_POS                         (7U)
#define CAN_CFG_STAT_RESET                             (0x80U)

/*  Bit definition for CAN_TCMD register  */
#define CAN_TCMD_TSA_POS                               (0U)
#define CAN_TCMD_TSA                                   (0x01U)
#define CAN_TCMD_TSALL_POS                             (1U)
#define CAN_TCMD_TSALL                                 (0x02U)
#define CAN_TCMD_TSONE_POS                             (2U)
#define CAN_TCMD_TSONE                                 (0x04U)
#define CAN_TCMD_TPA_POS                               (3U)
#define CAN_TCMD_TPA                                   (0x08U)
#define CAN_TCMD_TPE_POS                               (4U)
#define CAN_TCMD_TPE                                   (0x10U)
#define CAN_TCMD_LOM_POS                               (6U)
#define CAN_TCMD_LOM                                   (0x40U)
#define CAN_TCMD_TBSEL_POS                             (7U)
#define CAN_TCMD_TBSEL                                 (0x80U)

/*  Bit definition for CAN_TCTRL register  */
#define CAN_TCTRL_TSSTAT_POS                           (0U)
#define CAN_TCTRL_TSSTAT                               (0x03U)
#define CAN_TCTRL_TSSTAT_0                             (0x01U)
#define CAN_TCTRL_TSSTAT_1                             (0x02U)
#define CAN_TCTRL_TTTBM_POS                            (4U)
#define CAN_TCTRL_TTTBM                                (0x10U)
#define CAN_TCTRL_TSMODE_POS                           (5U)
#define CAN_TCTRL_TSMODE                               (0x20U)
#define CAN_TCTRL_TSNEXT_POS                           (6U)
#define CAN_TCTRL_TSNEXT                               (0x40U)
#define CAN_TCTRL_FD_ISO_POS                           (7U)
#define CAN_TCTRL_FD_ISO                               (0x80U)

/*  Bit definition for CAN_RCTRL register  */
#define CAN_RCTRL_RSTAT_POS                            (0U)
#define CAN_RCTRL_RSTAT                                (0x03U)
#define CAN_RCTRL_RSTAT_0                              (0x01U)
#define CAN_RCTRL_RSTAT_1                              (0x02U)
#define CAN_RCTRL_RBALL_POS                            (3U)
#define CAN_RCTRL_RBALL                                (0x08U)
#define CAN_RCTRL_RREL_POS                             (4U)
#define CAN_RCTRL_RREL                                 (0x10U)
#define CAN_RCTRL_ROV_POS                              (5U)
#define CAN_RCTRL_ROV                                  (0x20U)
#define CAN_RCTRL_ROM_POS                              (6U)
#define CAN_RCTRL_ROM                                  (0x40U)
#define CAN_RCTRL_SACK_POS                             (7U)
#define CAN_RCTRL_SACK                                 (0x80U)

/*  Bit definition for CAN_RTIE register  */
#define CAN_RTIE_TSFF_POS                              (0U)
#define CAN_RTIE_TSFF                                  (0x01U)
#define CAN_RTIE_EIE_POS                               (1U)
#define CAN_RTIE_EIE                                   (0x02U)
#define CAN_RTIE_TSIE_POS                              (2U)
#define CAN_RTIE_TSIE                                  (0x04U)
#define CAN_RTIE_TPIE_POS                              (3U)
#define CAN_RTIE_TPIE                                  (0x08U)
#define CAN_RTIE_RAFIE_POS                             (4U)
#define CAN_RTIE_RAFIE                                 (0x10U)
#define CAN_RTIE_RFIE_POS                              (5U)
#define CAN_RTIE_RFIE                                  (0x20U)
#define CAN_RTIE_ROIE_POS                              (6U)
#define CAN_RTIE_ROIE                                  (0x40U)
#define CAN_RTIE_RIE_POS                               (7U)
#define CAN_RTIE_RIE                                   (0x80U)

