levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for CAN_RTIF register  */
#define CAN_RTIF_AIF_POS                               (0U)
#define CAN_RTIF_AIF                                   (0x01U)
#define CAN_RTIF_EIF_POS                               (1U)
#define CAN_RTIF_EIF                                   (0x02U)
#define CAN_RTIF_TSIF_POS                              (2U)
#define CAN_RTIF_TSIF                                  (0x04U)
#define CAN_RTIF_TPIF_POS                              (3U)
#define CAN_RTIF_TPIF                                  (0x08U)
#define CAN_RTIF_RAFIF_POS                             (4U)
#define CAN_RTIF_RAFIF                                 (0x10U)
#define CAN_RTIF_RFIF_POS                              (5U)
#define CAN_RTIF_RFIF                                  (0x20U)
#define CAN_RTIF_ROIF_POS                              (6U)
#define CAN_RTIF_ROIF                                  (0x40U)
#define CAN_RTIF_RIF_POS                               (7U)
#define CAN_RTIF_RIF                                   (0x80U)

/*  Bit definition for CAN_ERRINT register  */
#define CAN_ERRINT_BEIF_POS                            (0U)
#define CAN_ERRINT_BEIF                                (0x01U)
#define CAN_ERRINT_BEIE_POS                            (1U)
#define CAN_ERRINT_BEIE                                (0x02U)
#define CAN_ERRINT_ALIF_POS                            (2U)
#define CAN_ERRINT_ALIF                                (0x04U)
#define CAN_ERRINT_ALIE_POS                            (3U)
#define CAN_ERRINT_ALIE                                (0x08U)
#define CAN_ERRINT_EPIF_POS                            (4U)
#define CAN_ERRINT_EPIF                                (0x10U)
#define CAN_ERRINT_EPIE_POS                            (5U)
#define CAN_ERRINT_EPIE                                (0x20U)
#define CAN_ERRINT_EPASS_POS                           (6U)
#define CAN_ERRINT_EPASS                               (0x40U)
#define CAN_ERRINT_EWARN_POS                           (7U)
#define CAN_ERRINT_EWARN                               (0x80U)

/*  Bit definition for CAN_LIMIT register  */
#define CAN_LIMIT_EWL_POS                              (0U)
#define CAN_LIMIT_EWL                                  (0x0FU)
#define CAN_LIMIT_EWL_0                                (0x01U)
#define CAN_LIMIT_EWL_1                                (0x02U)
#define CAN_LIMIT_EWL_2                                (0x04U)
#define CAN_LIMIT_EWL_3                                (0x08U)
#define CAN_LIMIT_AFWL_POS                             (4U)
#define CAN_LIMIT_AFWL                                 (0xF0U)
#define CAN_LIMIT_AFWL_0                               (0x10U)
#define CAN_LIMIT_AFWL_1                               (0x20U)
#define CAN_LIMIT_AFWL_2                               (0x40U)
#define CAN_LIMIT_AFWL_3                               (0x80U)

/*  Bit definition for CAN_SBT register  */
#define CAN_SBT_S_SEG_1_POS                            (0U)
#define CAN_SBT_S_SEG_1                                (0x000000FFUL)
#define CAN_SBT_S_SEG_1_0                              (0x00000001UL)
#define CAN_SBT_S_SEG_1_1                              (0x00000002UL)
#define CAN_SBT_S_SEG_1_2                              (0x00000004UL)
#define CAN_SBT_S_SEG_1_3                              (0x00000008UL)
#define CAN_SBT_S_SEG_1_4                              (0x00000010UL)
#define CAN_SBT_S_SEG_1_5                              (0x00000020UL)
#define CAN_SBT_S_SEG_1_6                              (0x00000040UL)
#define CAN_SBT_S_SEG_1_7                              (0x00000080UL)
#define CAN_SBT_S_SEG_2_POS                            (8U)
#define CAN_SBT_S_SEG_2                                (0x00007F00UL)
#define CAN_SBT_S_SEG_2_0                              (0x00000100UL)
#define CAN_SBT_S_SEG_2_1                              (0x00000200UL)
#define CAN_SBT_S_SEG_2_2                              (0x00000400UL)
#define CAN_SBT_S_SEG_2_3                              (0x00000800UL)
#define CAN_SBT_S_SEG_2_4                              (0x00001000UL)
#define CAN_SBT_S_SEG_2_5                              (0x00002000UL)
#define CAN_SBT_S_SEG_2_6                              (0x00004000UL)
#define CAN_SBT_S_SJW_POS                              (16U)
#define CAN_SBT_S_SJW                                  (0x007F0000UL)
#define CAN_SBT_S_SJW_0                                (0x00010000UL)
#define CAN_SBT_S_SJW_1                                (0x00020000UL)
#define CAN_SBT_S_SJW_2                                (0x00040000UL)
#define CAN_SBT_S_SJW_3                                (0x00080000UL)
#define CAN_SBT_S_SJW_4                                (0x00100000UL)
#define CAN_SBT_S_SJW_5                                (0x00200000UL)
#define CAN_SBT_S_SJW_6                                (0x00400000UL)
#define CAN_SBT_S_PRESC_POS                            (24U)
#define CAN_SBT_S_PRESC                                (0xFF000000UL)
#define CAN_SBT_S_PRESC_0                              (0x01000000UL)
#define CAN_SBT_S_PRESC_1                              (0x02000000UL)
#define CAN_SBT_S_PRESC_2                              (0x04000000UL)
#define CAN_SBT_S_PRESC_3                              (0x08000000UL)
#define CAN_SBT_S_PRESC_4                              (0x10000000UL)
#define CAN_SBT_S_PRESC_5                              (0x20000000UL)
#define CAN_SBT_S_PRESC_6                              (0x40000000UL)
#define CAN_SBT_S_PRESC_7                              (0x80000000UL)

/*  Bit definition for CAN_FBT register  */
#define CAN_FBT_F_SEG_1_POS                            (0U)
#define CAN_FBT_F_SEG_1                                (0x0000001FUL)
#define CAN_FBT_F_SEG_1_0                              (0x00000001UL)
#define CAN_FBT_F_SEG_1_1                              (0x00000002UL)
#define CAN_FBT_F_SEG_1_2                              (0x00000004UL)
#define CAN_FBT_F_SEG_1_3                              (0x00000008UL)
#define CAN_FBT_F_SEG_1_4                              (0x00000010UL)
#define CAN_FBT_F_SEG_2_POS                            (8U)
#define CAN_FBT_F_SEG_2                                (0x00000F00UL)
#define CAN_FBT_F_SEG_2_0                              (0x00000100UL)
#define CAN_FBT_F_SEG_2_1                              (0x00000200UL)
#define CAN_FBT_F_SEG_2_2                              (0x00000400UL)
#define CAN_FBT_F_SEG_2_3                              (0x00000800UL)
#define CAN_FBT_F_SJW_POS                              (16U)
#define CAN_FBT_F_SJW                                  (0x000F0000UL)
#define CAN_FBT_F_SJW_0                                (0x00010000UL)
#define CAN_FBT_F_SJW_1                                (0x00020000UL)
#define CAN_FBT_F_SJW_2                                (0x00040000UL)
#define CAN_FBT_F_SJW_3                                (0x00080000UL)
#define CAN_FBT_F_PRESC_POS                            (24U)
#define CAN_FBT_F_PRESC                                (0xFF000000UL)
#define CAN_FBT_F_PRESC_0                              (0x01000000UL)
#define CAN_FBT_F_PRESC_1                              (0x02000000UL)
#define CAN_FBT_F_PRESC_2                              (0x04000000UL)
#define CAN_FBT_F_PRESC_3                              (0x08000000UL)
#define CAN_FBT_F_PRESC_4                              (0x10000000UL)
#define CAN_FBT_F_PRESC_5                              (0x20000000UL)
#define CAN_FBT_F_PRESC_6                              (0x40000000UL)
#define CAN_FBT_F_PRESC_7                              (0x80000000UL)

/*  Bit definition for CAN_EALCAP register  */
#define CAN_EALCAP_ALC_POS                             (0U)
#define CAN_EALCAP_ALC                                 (0x1FU)
#define CAN_EALCAP_ALC_0                               (0x01U)
#define CAN_EALCAP_ALC_1                               (0x02U)
#define CAN_EALCAP_ALC_2                               (0x04U)
#define CAN_EALCAP_ALC_3                               (0x08U)
#define CAN_EALCAP_ALC_4                               (0x10U)
#define CAN_EALCAP_KOER_POS                            (5U)
#define CAN_EALCAP_KOER                                (0xE0U)
#define CAN_EALCAP_KOER_0                              (0x20U)
#define CAN_EALCAP_KOER_1                              (0x40U)
#define CAN_EALCAP_KOER_2                              (0x80U)

/*  Bit definition for CAN_TDC register  */
#define CAN_TDC_SSPOFF_POS                             (0U)
#define CAN_TDC_SSPOFF                                 (0x7FU)
#define CAN_TDC_SSPOFF_0                               (0x01U)
#define CAN_TDC_SSPOFF_1                               (0x02U)
#define CAN_TDC_SSPOFF_2                               (0x04U)
#define CAN_TDC_SSPOFF_3                               (0x08U)
#define CAN_TDC_SSPOFF_4                               (0x10U)
#define CAN_TDC_SSPOFF_5                               (0x20U)
#define CAN_TDC_SSPOFF_6                               (0x40U)
#define CAN_TDC_TDCEN_POS                              (7U)
#define CAN_TDC_TDCEN                                  (0x80U)

/*  Bit definition for CAN_RECNT register  */
#define CAN_RECNT                                      (0xFFU)

/*  Bit definition for CAN_TECNT register  */
#define CAN_TECNT                                      (0xFFU)

/*  Bit definition for CAN_ACFCTRL register  */
#define CAN_ACFCTRL_ACFADR_POS                         (0U)
#define CAN_ACFCTRL_ACFADR                             (0x0FU)
#define CAN_ACFCTRL_ACFADR_0                           (0x01U)
#define CAN_ACFCTRL_ACFADR_1                           (0x02U)
#define CAN_ACFCTRL_ACFADR_2                           (0x04U)
#define CAN_ACFCTRL_ACFADR_3                           (0x08U)
#define CAN_ACFCTRL_SELMASK_POS                        (5U)
#define CAN_ACFCTRL_SELMASK                            (0x20U)

/*  Bit definition for CAN_ACFEN register  */
#define CAN_ACFEN_AE_1_POS                             (0U)
#define CAN_ACFEN_AE_1                                 (0x0001U)
#define CAN_ACFEN_AE_2_POS                             (1U)
#define CAN_ACFEN_AE_2                                 (0x0002U)
#define CAN_ACFEN_AE_3_POS                             (2U)
#define CAN_ACFEN_AE_3                                 (0x0004U)
#define CAN_ACFEN_AE_4_POS                             (3U)
#define CAN_ACFEN_AE_4                                 (0x0008U)
#define CAN_ACFEN_AE_5_POS                             (4U)
#define CAN_ACFEN_AE_5                                 (0x0010U)
#define CAN_ACFEN_AE_6_POS                             (5U)
#define CAN_ACFEN_AE_6                                 (0x0020U)
#define CAN_ACFEN_AE_7_POS                             (6U)
#define CAN_ACFEN_AE_7                                 (0x0040U)
#define CAN_ACFEN_AE_8_POS                             (7U)
#define CAN_ACFEN_AE_8                                 (0x0080U)
#define CAN_ACFEN_AE_9_POS                             (8U)
#define CAN_ACFEN_AE_9                                 (0x0100U)
#define CAN_ACFEN_AE_10_POS                            (9U)
#define CAN_ACFEN_AE_10                                (0x0200U)
#define CAN_ACFEN_AE_11_POS                            (10U)
#define CAN_ACFEN_AE_11                                (0x0400U)
#define CAN_ACFEN_AE_12_POS                            (11U)
#define CAN_ACFEN_AE_12                                (0x0800U)
#define CAN_ACFEN_AE_13_POS                            (12U)
#define CAN_ACFEN_AE_13                                (0x1000U)
#define CAN_ACFEN_AE_14_POS                            (13U)
#define CAN_ACFEN_AE_14                                (0x2000U)
#define CAN_ACFEN_AE_15_POS                            (14U)
#define CAN_ACFEN_AE_15                                (0x4000U)
#define CAN_ACFEN_AE_16_POS                            (15U)
#define CAN_ACFEN_AE_16                                (0x8000U)

/*  Bit definition for CAN_ACF register  */
#define CAN_ACF_ACODEORAMASK_POS                       (0U)
#define CAN_ACF_ACODEORAMASK                           (0x1FFFFFFFUL)
#define CAN_ACF_ACODEORAMASK_0                         (0x00000001UL)
#define CAN_ACF_ACODEORAMASK_1                         (0x00000002UL)
#define CAN_ACF_ACODEORAMASK_2                         (0x00000004UL)
#define CAN_ACF_ACODEORAMASK_3                         (0x00000008UL)
#define CAN_ACF_ACODEORAMASK_4                         (0x00000010UL)
#define CAN_ACF_ACODEORAMASK_5                         (0x00000020UL)
#define CAN_ACF_ACODEORAMASK_6                         (0x00000040UL)
#define CAN_ACF_ACODEORAMASK_7                         (0x00000080UL)
#define CAN_ACF_ACODEORAMASK_8                         (0x00000100UL)
#define CAN_ACF_ACODEORAMASK_9                         (0x00000200UL)
#define CAN_ACF_ACODEORAMASK_10                        (0x00000400UL)
#define CAN_ACF_ACODEORAMASK_11                        (0x00000800UL)
#define CAN_ACF_ACODEORAMASK_12                        (0x00001000UL)
#define CAN_ACF_ACODEORAMASK_13                        (0x00002000UL)
#define CAN_ACF_ACODEORAMASK_14                        (0x00004000UL)
#define CAN_ACF_ACODEORAMASK_15                        (0x00008000UL)
#define CAN_ACF_ACODEORAMASK_16                        (0x00010000UL)
#define CAN_ACF_ACODEORAMASK_17                        (0x00020000UL)
#define CAN_ACF_ACODEORAMASK_18                        (0x00040000UL)
#define CAN_ACF_ACODEORAMASK_19                        (0x00080000UL)
#define CAN_ACF_ACODEORAMASK_20                        (0x00100000UL)
#define CAN_ACF_ACODEORAMASK_21                        (0x00200000UL)
#define CAN_ACF_ACODEORAMASK_22                        (0x00400000UL)
#define CAN_ACF_ACODEORAMASK_23                        (0x00800000UL)
#define CAN_ACF_ACODEORAMASK_24                        (0x01000000UL)
#define CAN_ACF_ACODEORAMASK_25                        (0x02000000UL)
#define CAN_ACF_ACODEORAMASK_26                        (0x04000000UL)
#define CAN_ACF_ACODEORAMASK_27                        (0x08000000UL)
#define CAN_ACF_ACODEORAMASK_28                        (0x10000000UL)
#define CAN_ACF_AIDE_POS                               (29U)
#define CAN_ACF_AIDE                                   (0x20000000UL)
#define CAN_ACF_AIDEE_POS                              (30U)
#define CAN_ACF_AIDEE                                  (0x40000000UL)

/*  Bit definition for CAN_TBSLOT register  */
#define CAN_TBSLOT_TBPTR_POS                           (0U)
#define CAN_TBSLOT_TBPTR                               (0x3FU)
#define CAN_TBSLOT_TBPTR_0                             (0x01U)
#define CAN_TBSLOT_TBPTR_1                             (0x02U)
#define CAN_TBSLOT_TBPTR_2                             (0x04U)
#define CAN_TBSLOT_TBPTR_3                             (0x08U)
#define CAN_TBSLOT_TBPTR_4                             (0x10U)
#define CAN_TBSLOT_TBPTR_5                             (0x20U)
#define CAN_TBSLOT_TBF_POS                             (6U)
#define CAN_TBSLOT_TBF                                 (0x40U)
#define CAN_TBSLOT_TBE_POS                             (7U)
#define CAN_TBSLOT_TBE                                 (0x80U)

