levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for CAN_TTCFG register  */
#define CAN_TTCFG_TTEN_POS                             (0U)
#define CAN_TTCFG_TTEN                                 (0x01U)
#define CAN_TTCFG_T_PRESC_POS                          (1U)
#define CAN_TTCFG_T_PRESC                              (0x06U)
#define CAN_TTCFG_T_PRESC_0                            (0x02U)
#define CAN_TTCFG_T_PRESC_1                            (0x04U)
#define CAN_TTCFG_TTIF_POS                             (3U)
#define CAN_TTCFG_TTIF                                 (0x08U)
#define CAN_TTCFG_TTIE_POS                             (4U)
#define CAN_TTCFG_TTIE                                 (0x10U)
#define CAN_TTCFG_TEIF_POS                             (5U)
#define CAN_TTCFG_TEIF                                 (0x20U)
#define CAN_TTCFG_WTIF_POS                             (6U)
#define CAN_TTCFG_WTIF                                 (0x40U)
#define CAN_TTCFG_WTIE_POS                             (7U)
#define CAN_TTCFG_WTIE                                 (0x80U)

/*  Bit definition for CAN_REF_MSG register  */
#define CAN_REF_MSG_REF_ID_POS                         (0U)
#define CAN_REF_MSG_REF_ID                             (0x1FFFFFFFUL)
#define CAN_REF_MSG_REF_ID_0                           (0x00000001UL)
#define CAN_REF_MSG_REF_ID_1                           (0x00000002UL)
#define CAN_REF_MSG_REF_ID_2                           (0x00000004UL)
#define CAN_REF_MSG_REF_ID_3                           (0x00000008UL)
#define CAN_REF_MSG_REF_ID_4                           (0x00000010UL)
#define CAN_REF_MSG_REF_ID_5                           (0x00000020UL)
#define CAN_REF_MSG_REF_ID_6                           (0x00000040UL)
#define CAN_REF_MSG_REF_ID_7                           (0x00000080UL)
#define CAN_REF_MSG_REF_ID_8                           (0x00000100UL)
#define CAN_REF_MSG_REF_ID_9                           (0x00000200UL)
#define CAN_REF_MSG_REF_ID_10                          (0x00000400UL)
#define CAN_REF_MSG_REF_ID_11                          (0x00000800UL)
#define CAN_REF_MSG_REF_ID_12                          (0x00001000UL)
#define CAN_REF_MSG_REF_ID_13                          (0x00002000UL)
#define CAN_REF_MSG_REF_ID_14                          (0x00004000UL)
#define CAN_REF_MSG_REF_ID_15                          (0x00008000UL)
#define CAN_REF_MSG_REF_ID_16                          (0x00010000UL)
#define CAN_REF_MSG_REF_ID_17                          (0x00020000UL)
#define CAN_REF_MSG_REF_ID_18                          (0x00040000UL)
#define CAN_REF_MSG_REF_ID_19                          (0x00080000UL)
#define CAN_REF_MSG_REF_ID_20                          (0x00100000UL)
#define CAN_REF_MSG_REF_ID_21                          (0x00200000UL)
#define CAN_REF_MSG_REF_ID_22                          (0x00400000UL)
#define CAN_REF_MSG_REF_ID_23                          (0x00800000UL)
#define CAN_REF_MSG_REF_ID_24                          (0x01000000UL)
#define CAN_REF_MSG_REF_ID_25                          (0x02000000UL)
#define CAN_REF_MSG_REF_ID_26                          (0x04000000UL)
#define CAN_REF_MSG_REF_ID_27                          (0x08000000UL)
#define CAN_REF_MSG_REF_ID_28                          (0x10000000UL)
#define CAN_REF_MSG_REF_IDE_POS                        (31U)
#define CAN_REF_MSG_REF_IDE                            (0x80000000UL)

/*  Bit definition for CAN_TRG_CFG register  */
#define CAN_TRG_CFG_TTPTR_POS                          (0U)
#define CAN_TRG_CFG_TTPTR                              (0x003FU)
#define CAN_TRG_CFG_TTPTR_0                            (0x0001U)
#define CAN_TRG_CFG_TTPTR_1                            (0x0002U)
#define CAN_TRG_CFG_TTPTR_2                            (0x0004U)
#define CAN_TRG_CFG_TTPTR_3                            (0x0008U)
#define CAN_TRG_CFG_TTPTR_4                            (0x0010U)
#define CAN_TRG_CFG_TTPTR_5                            (0x0020U)
#define CAN_TRG_CFG_TTYPE_POS                          (8U)
#define CAN_TRG_CFG_TTYPE                              (0x0700U)
#define CAN_TRG_CFG_TTYPE_0                            (0x0100U)
#define CAN_TRG_CFG_TTYPE_1                            (0x0200U)
#define CAN_TRG_CFG_TTYPE_2                            (0x0400U)
#define CAN_TRG_CFG_TEW_POS                            (12U)
#define CAN_TRG_CFG_TEW                                (0xF000U)
#define CAN_TRG_CFG_TEW_0                              (0x1000U)
#define CAN_TRG_CFG_TEW_1                              (0x2000U)
#define CAN_TRG_CFG_TEW_2                              (0x4000U)
#define CAN_TRG_CFG_TEW_3                              (0x8000U)

/*  Bit definition for CAN_TT_TRIG register  */
#define CAN_TT_TRIG                                    (0xFFFFU)

/*  Bit definition for CAN_TT_WTRIG register  */
#define CAN_TT_WTRIG                                   (0xFFFFU)

/*******************************************************************************
                Bit definition for Peripheral CMP
*******************************************************************************/
/*  Bit definition for CMP_MDR register  */
#define CMP_MDR_CENB_POS                               (0U)
#define CMP_MDR_CENB                                   (0x01U)
#define CMP_MDR_CWDE_POS                               (1U)
#define CMP_MDR_CWDE                                   (0x02U)
#define CMP_MDR_CMON_POS                               (7U)
#define CMP_MDR_CMON                                   (0x80U)

/*  Bit definition for CMP_FIR register  */
#define CMP_FIR_FCKS_POS                               (0U)
#define CMP_FIR_FCKS                                   (0x03U)
#define CMP_FIR_FCKS_0                                 (0x01U)
#define CMP_FIR_FCKS_1                                 (0x02U)
#define CMP_FIR_EDGS_POS                               (4U)
#define CMP_FIR_EDGS                                   (0x30U)
#define CMP_FIR_EDGS_0                                 (0x10U)
#define CMP_FIR_EDGS_1                                 (0x20U)
#define CMP_FIR_CIEN_POS                               (6U)
#define CMP_FIR_CIEN                                   (0x40U)

/*  Bit definition for CMP_OCR register  */
#define CMP_OCR_COEN_POS                               (0U)
#define CMP_OCR_COEN                                   (0x01U)
#define CMP_OCR_COPS_POS                               (1U)
#define CMP_OCR_COPS                                   (0x02U)
#define CMP_OCR_CPOE_POS                               (2U)
#define CMP_OCR_CPOE                                   (0x04U)
#define CMP_OCR_TWOE_POS                               (3U)
#define CMP_OCR_TWOE                                   (0x08U)
#define CMP_OCR_TWOL_POS                               (4U)
#define CMP_OCR_TWOL                                   (0x10U)

/*  Bit definition for CMP_PMSR register  */
#define CMP_PMSR_RVSL_POS                              (0U)
#define CMP_PMSR_RVSL                                  (0x0FU)
#define CMP_PMSR_RVSL_0                                (0x01U)
#define CMP_PMSR_RVSL_1                                (0x02U)
#define CMP_PMSR_RVSL_2                                (0x04U)
#define CMP_PMSR_RVSL_3                                (0x08U)
#define CMP_PMSR_CVSL_POS                              (4U)
#define CMP_PMSR_CVSL                                  (0xF0U)
#define CMP_PMSR_CVSL_0                                (0x10U)
#define CMP_PMSR_CVSL_1                                (0x20U)
#define CMP_PMSR_CVSL_2                                (0x40U)
#define CMP_PMSR_CVSL_3                                (0x80U)

/*  Bit definition for CMP_TWSR register  */
#define CMP_TWSR_CTWS0_POS                             (0U)
#define CMP_TWSR_CTWS0                                 (0x0001U)
#define CMP_TWSR_CTWS1_POS                             (1U)
#define CMP_TWSR_CTWS1                                 (0x0002U)
#define CMP_TWSR_CTWS2_POS                             (2U)
#define CMP_TWSR_CTWS2                                 (0x0004U)
#define CMP_TWSR_CTWS3_POS                             (3U)
#define CMP_TWSR_CTWS3                                 (0x0008U)
#define CMP_TWSR_CTWS4_POS                             (4U)
#define CMP_TWSR_CTWS4                                 (0x0010U)
#define CMP_TWSR_CTWS5_POS                             (5U)
#define CMP_TWSR_CTWS5                                 (0x0020U)
#define CMP_TWSR_CTWS6_POS                             (6U)
#define CMP_TWSR_CTWS6                                 (0x0040U)
#define CMP_TWSR_CTWS7_POS                             (7U)
#define CMP_TWSR_CTWS7                                 (0x0080U)
#define CMP_TWSR_CTWS8_POS                             (8U)
#define CMP_TWSR_CTWS8                                 (0x0100U)
#define CMP_TWSR_CTWS9_POS                             (9U)
#define CMP_TWSR_CTWS9                                 (0x0200U)
#define CMP_TWSR_CTWS10_POS                            (10U)
#define CMP_TWSR_CTWS10                                (0x0400U)
#define CMP_TWSR_CTWS11_POS                            (11U)
#define CMP_TWSR_CTWS11                                (0x0800U)
#define CMP_TWSR_CTWS12_POS                            (12U)
#define CMP_TWSR_CTWS12                                (0x1000U)
#define CMP_TWSR_CTWS13_POS                            (13U)
#define CMP_TWSR_CTWS13                                (0x2000U)
#define CMP_TWSR_CTWS14_POS                            (14U)
#define CMP_TWSR_CTWS14                                (0x4000U)
#define CMP_TWSR_CTWS15_POS                            (15U)
#define CMP_TWSR_CTWS15                                (0x8000U)

/*  Bit definition for CMP_TWPR register  */
#define CMP_TWPR_CTWP0_POS                             (0U)
#define CMP_TWPR_CTWP0                                 (0x0001U)
#define CMP_TWPR_CTWP1_POS                             (1U)
#define CMP_TWPR_CTWP1                                 (0x0002U)
#define CMP_TWPR_CTWP2_POS                             (2U)
#define CMP_TWPR_CTWP2                                 (0x0004U)
#define CMP_TWPR_CTWP3_POS                             (3U)
#define CMP_TWPR_CTWP3                                 (0x0008U)
#define CMP_TWPR_CTWP4_POS                             (4U)
#define CMP_TWPR_CTWP4                                 (0x0010U)
#define CMP_TWPR_CTWP5_POS                             (5U)
#define CMP_TWPR_CTWP5                                 (0x0020U)
#define CMP_TWPR_CTWP6_POS                             (6U)
#define CMP_TWPR_CTWP6                                 (0x0040U)
#define CMP_TWPR_CTWP7_POS                             (7U)
#define CMP_TWPR_CTWP7                                 (0x0080U)
#define CMP_TWPR_CTWP8_POS                             (8U)
#define CMP_TWPR_CTWP8                                 (0x0100U)
#define CMP_TWPR_CTWP9_POS                             (9U)
#define CMP_TWPR_CTWP9                                 (0x0200U)
#define CMP_TWPR_CTWP10_POS                            (10U)
#define CMP_TWPR_CTWP10                                (0x0400U)
#define CMP_TWPR_CTWP11_POS                            (11U)
#define CMP_TWPR_CTWP11                                (0x0800U)
#define CMP_TWPR_CTWP12_POS                            (12U)
#define CMP_TWPR_CTWP12                                (0x1000U)
#define CMP_TWPR_CTWP13_POS                            (13U)
#define CMP_TWPR_CTWP13                                (0x2000U)
#define CMP_TWPR_CTWP14_POS                            (14U)
#define CMP_TWPR_CTWP14                                (0x4000U)
#define CMP_TWPR_CTWP15_POS                            (15U)
#define CMP_TWPR_CTWP15                                (0x8000U)

/*  Bit definition for CMP_VISR register  */
#define CMP_VISR_P2SL_POS                              (0U)
#define CMP_VISR_P2SL                                  (0x0007U)
#define CMP_VISR_P2SL_0                                (0x0001U)
#define CMP_VISR_P2SL_1                                (0x0002U)
#define CMP_VISR_P2SL_2                                (0x0004U)
#define CMP_VISR_P3SL_POS                              (4U)
#define CMP_VISR_P3SL                                  (0x0030U)
#define CMP_VISR_P3SL_0                                (0x0010U)
#define CMP_VISR_P3SL_1                                (0x0020U)

