levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for CRC_DAT31 register  */
#define CRC_DAT31                                      (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral CTC
*******************************************************************************/
/*  Bit definition for CTC_CR1 register  */
#define CTC_CR1_REFPSC_POS                             (0U)
#define CTC_CR1_REFPSC                                 (0x00000007UL)
#define CTC_CR1_REFPSC_0                               (0x00000001UL)
#define CTC_CR1_REFPSC_1                               (0x00000002UL)
#define CTC_CR1_REFPSC_2                               (0x00000004UL)
#define CTC_CR1_REFCKS_POS                             (4U)
#define CTC_CR1_REFCKS                                 (0x00000030UL)
#define CTC_CR1_REFCKS_0                               (0x00000010UL)
#define CTC_CR1_REFCKS_1                               (0x00000020UL)
#define CTC_CR1_ERRIE_POS                              (6U)
#define CTC_CR1_ERRIE                                  (0x00000040UL)
#define CTC_CR1_CTCEN_POS                              (7U)
#define CTC_CR1_CTCEN                                  (0x00000080UL)
#define CTC_CR1_TRMVAL_POS                             (16U)
#define CTC_CR1_TRMVAL                                 (0x003F0000UL)

/*  Bit definition for CTC_CR2 register  */
#define CTC_CR2_OFSVAL_POS                             (0U)
#define CTC_CR2_OFSVAL                                 (0x000000FFUL)
#define CTC_CR2_OFSVAL_0                               (0x00000001UL)
#define CTC_CR2_OFSVAL_1                               (0x00000002UL)
#define CTC_CR2_OFSVAL_2                               (0x00000004UL)
#define CTC_CR2_OFSVAL_3                               (0x00000008UL)
#define CTC_CR2_OFSVAL_4                               (0x00000010UL)
#define CTC_CR2_OFSVAL_5                               (0x00000020UL)
#define CTC_CR2_OFSVAL_6                               (0x00000040UL)
#define CTC_CR2_OFSVAL_7                               (0x00000080UL)
#define CTC_CR2_RLDVAL_POS                             (16U)
#define CTC_CR2_RLDVAL                                 (0xFFFF0000UL)

/*  Bit definition for CTC_STR register  */
#define CTC_STR_TRIMOK_POS                             (0U)
#define CTC_STR_TRIMOK                                 (0x00000001UL)
#define CTC_STR_TRMOVF_POS                             (1U)
#define CTC_STR_TRMOVF                                 (0x00000002UL)
#define CTC_STR_TRMUDF_POS                             (2U)
#define CTC_STR_TRMUDF                                 (0x00000004UL)
#define CTC_STR_CTCBSY_POS                             (3U)
#define CTC_STR_CTCBSY                                 (0x00000008UL)

/*******************************************************************************
                Bit definition for Peripheral DAC
*******************************************************************************/
/*  Bit definition for DAC_DADR1 register  */
#define DAC_DADR1_DR0_POS                              (0U)
#define DAC_DADR1_DR0                                  (0x0001U)
#define DAC_DADR1_DR1_POS                              (1U)
#define DAC_DADR1_DR1                                  (0x0002U)
#define DAC_DADR1_DR2_POS                              (2U)
#define DAC_DADR1_DR2                                  (0x0004U)
#define DAC_DADR1_DR3_POS                              (3U)
#define DAC_DADR1_DR3                                  (0x0008U)
#define DAC_DADR1_DL0R4_POS                            (4U)
#define DAC_DADR1_DL0R4                                (0x0010U)
#define DAC_DADR1_DL1R5_POS                            (5U)
#define DAC_DADR1_DL1R5                                (0x0020U)
#define DAC_DADR1_DL2R6_POS                            (6U)
#define DAC_DADR1_DL2R6                                (0x0040U)
#define DAC_DADR1_DL3R7_POS                            (7U)
#define DAC_DADR1_DL3R7                                (0x0080U)
#define DAC_DADR1_DL4R8_POS                            (8U)
#define DAC_DADR1_DL4R8                                (0x0100U)
#define DAC_DADR1_DL5R9_POS                            (9U)
#define DAC_DADR1_DL5R9                                (0x0200U)
#define DAC_DADR1_DL6R10_POS                           (10U)
#define DAC_DADR1_DL6R10                               (0x0400U)
#define DAC_DADR1_DL7R11_POS                           (11U)
#define DAC_DADR1_DL7R11                               (0x0800U)
#define DAC_DADR1_DL8_POS                              (12U)
#define DAC_DADR1_DL8                                  (0x1000U)
#define DAC_DADR1_DL9_POS                              (13U)
#define DAC_DADR1_DL9                                  (0x2000U)
#define DAC_DADR1_DL10_POS                             (14U)
#define DAC_DADR1_DL10                                 (0x4000U)
#define DAC_DADR1_DL11_POS                             (15U)
#define DAC_DADR1_DL11                                 (0x8000U)

/*  Bit definition for DAC_DADR2 register  */
#define DAC_DADR2_DR0_POS                              (0U)
#define DAC_DADR2_DR0                                  (0x0001U)
#define DAC_DADR2_DR1_POS                              (1U)
#define DAC_DADR2_DR1                                  (0x0002U)
#define DAC_DADR2_DR2_POS                              (2U)
#define DAC_DADR2_DR2                                  (0x0004U)
#define DAC_DADR2_DR3_POS                              (3U)
#define DAC_DADR2_DR3                                  (0x0008U)
#define DAC_DADR2_DL0R4_POS                            (4U)
#define DAC_DADR2_DL0R4                                (0x0010U)
#define DAC_DADR2_DL1R5_POS                            (5U)
#define DAC_DADR2_DL1R5                                (0x0020U)
#define DAC_DADR2_DL2R6_POS                            (6U)
#define DAC_DADR2_DL2R6                                (0x0040U)
#define DAC_DADR2_DL3R7_POS                            (7U)
#define DAC_DADR2_DL3R7                                (0x0080U)
#define DAC_DADR2_DL4R8_POS                            (8U)
#define DAC_DADR2_DL4R8                                (0x0100U)
#define DAC_DADR2_DL5R9_POS                            (9U)
#define DAC_DADR2_DL5R9                                (0x0200U)
#define DAC_DADR2_DL6R10_POS                           (10U)
#define DAC_DADR2_DL6R10                               (0x0400U)
#define DAC_DADR2_DL7R11_POS                           (11U)
#define DAC_DADR2_DL7R11                               (0x0800U)
#define DAC_DADR2_DL8_POS                              (12U)
#define DAC_DADR2_DL8                                  (0x1000U)
#define DAC_DADR2_DL9_POS                              (13U)
#define DAC_DADR2_DL9                                  (0x2000U)
#define DAC_DADR2_DL10_POS                             (14U)
#define DAC_DADR2_DL10                                 (0x4000U)
#define DAC_DADR2_DL11_POS                             (15U)
#define DAC_DADR2_DL11                                 (0x8000U)

/*  Bit definition for DAC_DACR register  */
#define DAC_DACR_DAE_POS                               (0U)
#define DAC_DACR_DAE                                   (0x0001U)
#define DAC_DACR_DA1E_POS                              (1U)
#define DAC_DACR_DA1E                                  (0x0002U)
#define DAC_DACR_DA2E_POS                              (2U)
#define DAC_DACR_DA2E                                  (0x0004U)
#define DAC_DACR_DPSEL_POS                             (8U)
#define DAC_DACR_DPSEL                                 (0x0100U)
#define DAC_DACR_DAAMP1_POS                            (9U)
#define DAC_DACR_DAAMP1                                (0x0200U)
#define DAC_DACR_DAAMP2_POS                            (10U)
#define DAC_DACR_DAAMP2                                (0x0400U)
#define DAC_DACR_EXTDSL1_POS                           (11U)
#define DAC_DACR_EXTDSL1                               (0x0800U)
#define DAC_DACR_EXTDSL2_POS                           (12U)
#define DAC_DACR_EXTDSL2                               (0x1000U)

/*  Bit definition for DAC_DAADPCR register  */
#define DAC_DAADPCR_ADPSL1_POS                         (0U)
#define DAC_DAADPCR_ADPSL1                             (0x0001U)
#define DAC_DAADPCR_ADPSL2_POS                         (1U)
#define DAC_DAADPCR_ADPSL2                             (0x0002U)
#define DAC_DAADPCR_ADPSL3_POS                         (2U)
#define DAC_DAADPCR_ADPSL3                             (0x0004U)
#define DAC_DAADPCR_DA1SF_POS                          (8U)
#define DAC_DAADPCR_DA1SF                              (0x0100U)
#define DAC_DAADPCR_DA2SF_POS                          (9U)
#define DAC_DAADPCR_DA2SF                              (0x0200U)
#define DAC_DAADPCR_ADPEN_POS                          (15U)
#define DAC_DAADPCR_ADPEN                              (0x8000U)

/*  Bit definition for DAC_DAOCR register  */
#define DAC_DAOCR_DAODIS1_POS                          (14U)
#define DAC_DAOCR_DAODIS1                              (0x4000U)
#define DAC_DAOCR_DAODIS2_POS                          (15U)
#define DAC_DAOCR_DAODIS2                              (0x8000U)

