levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*******************************************************************************
                Bit definition for Peripheral DBGC
*******************************************************************************/
/*  Bit definition for DBGC_AUTHID0 register  */
#define DBGC_AUTHID0                                   (0xFFFFFFFFUL)

/*  Bit definition for DBGC_AUTHID1 register  */
#define DBGC_AUTHID1                                   (0xFFFFFFFFUL)

/*  Bit definition for DBGC_AUTHID2 register  */
#define DBGC_AUTHID2                                   (0xFFFFFFFFUL)

/*  Bit definition for DBGC_RESV0 register  */
#define DBGC_RESV0                                     (0xFFFFFFFFUL)

/*  Bit definition for DBGC_MCUSTAT register  */
#define DBGC_MCUSTAT_AUTH_POS                          (0U)
#define DBGC_MCUSTAT_AUTH                              (0x00000001UL)
#define DBGC_MCUSTAT_REMVLOCK_POS                      (1U)
#define DBGC_MCUSTAT_REMVLOCK                          (0x00000002UL)
#define DBGC_MCUSTAT_SAFTYLOCK1_POS                    (2U)
#define DBGC_MCUSTAT_SAFTYLOCK1                        (0x00000004UL)
#define DBGC_MCUSTAT_SAFTYLOCK2_POS                    (3U)
#define DBGC_MCUSTAT_SAFTYLOCK2                        (0x00000008UL)
#define DBGC_MCUSTAT_CPUSTOP_POS                       (8U)
#define DBGC_MCUSTAT_CPUSTOP                           (0x00000100UL)
#define DBGC_MCUSTAT_CPUSLEEP_POS                      (9U)
#define DBGC_MCUSTAT_CPUSLEEP                          (0x00000200UL)

/*  Bit definition for DBGC_MCUCTL register  */
#define DBGC_MCUCTL_EDBGRQ_POS                         (0U)
#define DBGC_MCUCTL_EDBGRQ                             (0x00000001UL)
#define DBGC_MCUCTL_RESTART_POS                        (1U)
#define DBGC_MCUCTL_RESTART                            (0x00000002UL)
#define DBGC_MCUCTL_DIRQ_POS                           (8U)
#define DBGC_MCUCTL_DIRQ                               (0x00000100UL)

/*  Bit definition for DBGC_FMCCTL register  */
#define DBGC_FMCCTL_ERASEREQ_POS                       (0U)
#define DBGC_FMCCTL_ERASEREQ                           (0x00000001UL)
#define DBGC_FMCCTL_ERASEACK_POS                       (1U)
#define DBGC_FMCCTL_ERASEACK                           (0x00000002UL)
#define DBGC_FMCCTL_ERASEERR_POS                       (2U)
#define DBGC_FMCCTL_ERASEERR                           (0x00000004UL)

/*  Bit definition for DBGC_MCUDBGCSTAT register  */
#define DBGC_MCUDBGCSTAT_CDBGPWRUPREQ_POS              (0U)
#define DBGC_MCUDBGCSTAT_CDBGPWRUPREQ                  (0x00000001UL)
#define DBGC_MCUDBGCSTAT_CDBGPWRUPACK_POS              (1U)
#define DBGC_MCUDBGCSTAT_CDBGPWRUPACK                  (0x00000002UL)

/*  Bit definition for DBGC_MCUSTPCTL register  */
#define DBGC_MCUSTPCTL_SWDTSTP_POS                     (0U)
#define DBGC_MCUSTPCTL_SWDTSTP                         (0x00000001UL)
#define DBGC_MCUSTPCTL_WDTSTP_POS                      (1U)
#define DBGC_MCUSTPCTL_WDTSTP                          (0x00000002UL)
#define DBGC_MCUSTPCTL_RTCSTP_POS                      (2U)
#define DBGC_MCUSTPCTL_RTCSTP                          (0x00000004UL)
#define DBGC_MCUSTPCTL_PVD0STP_POS                     (3U)
#define DBGC_MCUSTPCTL_PVD0STP                         (0x00000008UL)
#define DBGC_MCUSTPCTL_PVD1STP_POS                     (4U)
#define DBGC_MCUSTPCTL_PVD1STP                         (0x00000010UL)
#define DBGC_MCUSTPCTL_PVD2STP_POS                     (5U)
#define DBGC_MCUSTPCTL_PVD2STP                         (0x00000020UL)
#define DBGC_MCUSTPCTL_M06STP_POS                      (6U)
#define DBGC_MCUSTPCTL_M06STP                          (0x00000040UL)
#define DBGC_MCUSTPCTL_M07STP_POS                      (7U)
#define DBGC_MCUSTPCTL_M07STP                          (0x00000080UL)
#define DBGC_MCUSTPCTL_M08STP_POS                      (8U)
#define DBGC_MCUSTPCTL_M08STP                          (0x00000100UL)
#define DBGC_MCUSTPCTL_M09STP_POS                      (9U)
#define DBGC_MCUSTPCTL_M09STP                          (0x00000200UL)
#define DBGC_MCUSTPCTL_M10STP_POS                      (10U)
#define DBGC_MCUSTPCTL_M10STP                          (0x00000400UL)
#define DBGC_MCUSTPCTL_M11STP_POS                      (11U)
#define DBGC_MCUSTPCTL_M11STP                          (0x00000800UL)
#define DBGC_MCUSTPCTL_M12STP_POS                      (12U)
#define DBGC_MCUSTPCTL_M12STP                          (0x00001000UL)
#define DBGC_MCUSTPCTL_M13STP_POS                      (13U)
#define DBGC_MCUSTPCTL_M13STP                          (0x00002000UL)
#define DBGC_MCUSTPCTL_M14STP_POS                      (14U)
#define DBGC_MCUSTPCTL_M14STP                          (0x00004000UL)
#define DBGC_MCUSTPCTL_M15STP_POS                      (15U)
#define DBGC_MCUSTPCTL_M15STP                          (0x00008000UL)
#define DBGC_MCUSTPCTL_M16STP_POS                      (16U)
#define DBGC_MCUSTPCTL_M16STP                          (0x00010000UL)
#define DBGC_MCUSTPCTL_M17STP_POS                      (17U)
#define DBGC_MCUSTPCTL_M17STP                          (0x00020000UL)
#define DBGC_MCUSTPCTL_M18STP_POS                      (18U)
#define DBGC_MCUSTPCTL_M18STP                          (0x00040000UL)
#define DBGC_MCUSTPCTL_M19STP_POS                      (19U)
#define DBGC_MCUSTPCTL_M19STP                          (0x00080000UL)
#define DBGC_MCUSTPCTL_M20STP_POS                      (20U)
#define DBGC_MCUSTPCTL_M20STP                          (0x00100000UL)
#define DBGC_MCUSTPCTL_M21STP_POS                      (21U)
#define DBGC_MCUSTPCTL_M21STP                          (0x00200000UL)
#define DBGC_MCUSTPCTL_M22STP_POS                      (22U)
#define DBGC_MCUSTPCTL_M22STP                          (0x00400000UL)
#define DBGC_MCUSTPCTL_M23STP_POS                      (23U)
#define DBGC_MCUSTPCTL_M23STP                          (0x00800000UL)
#define DBGC_MCUSTPCTL_M24STP_POS                      (24U)
#define DBGC_MCUSTPCTL_M24STP                          (0x01000000UL)
#define DBGC_MCUSTPCTL_M25STP_POS                      (25U)
#define DBGC_MCUSTPCTL_M25STP                          (0x02000000UL)
#define DBGC_MCUSTPCTL_M26STP_POS                      (26U)
#define DBGC_MCUSTPCTL_M26STP                          (0x04000000UL)
#define DBGC_MCUSTPCTL_M27STP_POS                      (27U)
#define DBGC_MCUSTPCTL_M27STP                          (0x08000000UL)
#define DBGC_MCUSTPCTL_M28STP_POS                      (28U)
#define DBGC_MCUSTPCTL_M28STP                          (0x10000000UL)
#define DBGC_MCUSTPCTL_M29STP_POS                      (29U)
#define DBGC_MCUSTPCTL_M29STP                          (0x20000000UL)
#define DBGC_MCUSTPCTL_M30STP_POS                      (30U)
#define DBGC_MCUSTPCTL_M30STP                          (0x40000000UL)
#define DBGC_MCUSTPCTL_M31STP_POS                      (31U)
#define DBGC_MCUSTPCTL_M31STP                          (0x80000000UL)

/*  Bit definition for DBGC_MCUTRACECTL register  */
#define DBGC_MCUTRACECTL_TRACEMODE_POS                 (0U)
#define DBGC_MCUTRACECTL_TRACEMODE                     (0x00000003UL)
#define DBGC_MCUTRACECTL_TRACEIOEN_POS                 (2U)
#define DBGC_MCUTRACECTL_TRACEIOEN                     (0x00000004UL)

/*  Bit definition for DBGC_MCUSTPCTL2 register  */
#define DBGC_MCUSTPCTL2_M32STP_POS                     (0U)
#define DBGC_MCUSTPCTL2_M32STP                         (0x00000001UL)
#define DBGC_MCUSTPCTL2_M33STP_POS                     (1U)
#define DBGC_MCUSTPCTL2_M33STP                         (0x00000002UL)
#define DBGC_MCUSTPCTL2_M34STP_POS                     (2U)
#define DBGC_MCUSTPCTL2_M34STP                         (0x00000004UL)
#define DBGC_MCUSTPCTL2_M35STP_POS                     (3U)
#define DBGC_MCUSTPCTL2_M35STP                         (0x00000008UL)
#define DBGC_MCUSTPCTL2_M36STP_POS                     (4U)
#define DBGC_MCUSTPCTL2_M36STP                         (0x00000010UL)
#define DBGC_MCUSTPCTL2_M37STP_POS                     (5U)
#define DBGC_MCUSTPCTL2_M37STP                         (0x00000020UL)
#define DBGC_MCUSTPCTL2_M38STP_POS                     (6U)
#define DBGC_MCUSTPCTL2_M38STP                         (0x00000040UL)
#define DBGC_MCUSTPCTL2_M39STP_POS                     (7U)
#define DBGC_MCUSTPCTL2_M39STP                         (0x00000080UL)
#define DBGC_MCUSTPCTL2_M40STP_POS                     (8U)
#define DBGC_MCUSTPCTL2_M40STP                         (0x00000100UL)
#define DBGC_MCUSTPCTL2_M41STP_POS                     (9U)
#define DBGC_MCUSTPCTL2_M41STP                         (0x00000200UL)
#define DBGC_MCUSTPCTL2_M42STP_POS                     (10U)
#define DBGC_MCUSTPCTL2_M42STP                         (0x00000400UL)
#define DBGC_MCUSTPCTL2_M43STP_POS                     (11U)
#define DBGC_MCUSTPCTL2_M43STP                         (0x00000800UL)
#define DBGC_MCUSTPCTL2_M44STP_POS                     (12U)
#define DBGC_MCUSTPCTL2_M44STP                         (0x00001000UL)
#define DBGC_MCUSTPCTL2_M45STP_POS                     (13U)
#define DBGC_MCUSTPCTL2_M45STP                         (0x00002000UL)
#define DBGC_MCUSTPCTL2_M46STP_POS                     (14U)
#define DBGC_MCUSTPCTL2_M46STP                         (0x00004000UL)
#define DBGC_MCUSTPCTL2_M47STP_POS                     (15U)
#define DBGC_MCUSTPCTL2_M47STP                         (0x00008000UL)
#define DBGC_MCUSTPCTL2_M48STP_POS                     (16U)
#define DBGC_MCUSTPCTL2_M48STP                         (0x00010000UL)
#define DBGC_MCUSTPCTL2_M49STP_POS                     (17U)
#define DBGC_MCUSTPCTL2_M49STP                         (0x00020000UL)
#define DBGC_MCUSTPCTL2_M50STP_POS                     (18U)
#define DBGC_MCUSTPCTL2_M50STP                         (0x00040000UL)
#define DBGC_MCUSTPCTL2_M51STP_POS                     (19U)
#define DBGC_MCUSTPCTL2_M51STP                         (0x00080000UL)
#define DBGC_MCUSTPCTL2_M52STP_POS                     (20U)
#define DBGC_MCUSTPCTL2_M52STP                         (0x00100000UL)
#define DBGC_MCUSTPCTL2_M53STP_POS                     (21U)
#define DBGC_MCUSTPCTL2_M53STP                         (0x00200000UL)
#define DBGC_MCUSTPCTL2_M54STP_POS                     (22U)
#define DBGC_MCUSTPCTL2_M54STP                         (0x00400000UL)
#define DBGC_MCUSTPCTL2_M55STP_POS                     (23U)
#define DBGC_MCUSTPCTL2_M55STP                         (0x00800000UL)
#define DBGC_MCUSTPCTL2_M56STP_POS                     (24U)
#define DBGC_MCUSTPCTL2_M56STP                         (0x01000000UL)
#define DBGC_MCUSTPCTL2_M57STP_POS                     (25U)
#define DBGC_MCUSTPCTL2_M57STP                         (0x02000000UL)
#define DBGC_MCUSTPCTL2_M58STP_POS                     (26U)
#define DBGC_MCUSTPCTL2_M58STP                         (0x04000000UL)
#define DBGC_MCUSTPCTL2_M59STP_POS                     (27U)
#define DBGC_MCUSTPCTL2_M59STP                         (0x08000000UL)
#define DBGC_MCUSTPCTL2_M60STP_POS                     (28U)
#define DBGC_MCUSTPCTL2_M60STP                         (0x10000000UL)
#define DBGC_MCUSTPCTL2_M61STP_POS                     (29U)
#define DBGC_MCUSTPCTL2_M61STP                         (0x20000000UL)
#define DBGC_MCUSTPCTL2_M62STP_POS                     (30U)
#define DBGC_MCUSTPCTL2_M62STP                         (0x40000000UL)
#define DBGC_MCUSTPCTL2_M63STP_POS                     (31U)
#define DBGC_MCUSTPCTL2_M63STP                         (0x80000000UL)

