levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*******************************************************************************
                Bit definition for Peripheral DMC
*******************************************************************************/
/*  Bit definition for DMC_STSR register  */
#define DMC_STSR_STATUS_POS                            (0U)
#define DMC_STSR_STATUS                                (0x00000003UL)
#define DMC_STSR_STATUS_0                              (0x00000001UL)
#define DMC_STSR_STATUS_1                              (0x00000002UL)
#define DMC_STSR_MEMMW_POS                             (2U)
#define DMC_STSR_MEMMW                                 (0x0000000CUL)
#define DMC_STSR_MEMMW_0                               (0x00000004UL)
#define DMC_STSR_MEMMW_1                               (0x00000008UL)

/*  Bit definition for DMC_STCR register  */
#define DMC_STCR_STCTL                                 (0x00000007UL)

/*  Bit definition for DMC_CMDR register  */
#define DMC_CMDR_CMDADD_POS                            (0U)
#define DMC_CMDR_CMDADD                                (0x00003FFFUL)
#define DMC_CMDR_CMDBA_POS                             (16U)
#define DMC_CMDR_CMDBA                                 (0x00030000UL)
#define DMC_CMDR_CMDBA_0                               (0x00010000UL)
#define DMC_CMDR_CMDBA_1                               (0x00020000UL)
#define DMC_CMDR_CMD_POS                               (18U)
#define DMC_CMDR_CMD                                   (0x000C0000UL)
#define DMC_CMDR_CMD_0                                 (0x00040000UL)
#define DMC_CMDR_CMD_1                                 (0x00080000UL)
#define DMC_CMDR_CMDCHIP_POS                           (20U)
#define DMC_CMDR_CMDCHIP                               (0x00300000UL)
#define DMC_CMDR_CMDCHIP_0                             (0x00100000UL)
#define DMC_CMDR_CMDCHIP_1                             (0x00200000UL)
#define DMC_CMDR_RESV5_POS                             (24U)
#define DMC_CMDR_RESV5                                 (0x01000000UL)

/*  Bit definition for DMC_CPCR register  */
#define DMC_CPCR_COLBS_POS                             (0U)
#define DMC_CPCR_COLBS                                 (0x00000007UL)
#define DMC_CPCR_COLBS_0                               (0x00000001UL)
#define DMC_CPCR_COLBS_1                               (0x00000002UL)
#define DMC_CPCR_COLBS_2                               (0x00000004UL)
#define DMC_CPCR_ROWBS_POS                             (4U)
#define DMC_CPCR_ROWBS                                 (0x00000070UL)
#define DMC_CPCR_ROWBS_0                               (0x00000010UL)
#define DMC_CPCR_ROWBS_1                               (0x00000020UL)
#define DMC_CPCR_ROWBS_2                               (0x00000040UL)
#define DMC_CPCR_APBS_POS                              (7U)
#define DMC_CPCR_APBS                                  (0x00000080UL)
#define DMC_CPCR_CKEDIS_POS                            (8U)
#define DMC_CPCR_CKEDIS                                (0x00000100UL)
#define DMC_CPCR_CKSTOP_POS                            (9U)
#define DMC_CPCR_CKSTOP                                (0x00000200UL)
#define DMC_CPCR_CKEDISPRD_POS                         (10U)
#define DMC_CPCR_CKEDISPRD                             (0x0000FC00UL)
#define DMC_CPCR_BURST_POS                             (16U)
#define DMC_CPCR_BURST                                 (0x00070000UL)
#define DMC_CPCR_BURST_0                               (0x00010000UL)
#define DMC_CPCR_BURST_1                               (0x00020000UL)
#define DMC_CPCR_BURST_2                               (0x00040000UL)
#define DMC_CPCR_ACTCP_POS                             (24U)
#define DMC_CPCR_ACTCP                                 (0x03000000UL)
#define DMC_CPCR_ACTCP_0                               (0x01000000UL)
#define DMC_CPCR_ACTCP_1                               (0x02000000UL)

/*  Bit definition for DMC_RFTR register  */
#define DMC_RFTR_REFPRD                                (0x00007FFFUL)

/*  Bit definition for DMC_TMCR_T_CASL register  */
#define DMC_TMCR_T_CASL_T_CASL                         (0x00000007UL)

/*  Bit definition for DMC_TMCR_T_DQSS register  */
#define DMC_TMCR_T_DQSS_T_DQSS                         (0x00000003UL)

/*  Bit definition for DMC_TMCR_T_MRD register  */
#define DMC_TMCR_T_MRD_T_MRD                           (0x0000007FUL)

/*  Bit definition for DMC_TMCR_T_RAS register  */
#define DMC_TMCR_T_RAS_T_RAS                           (0x0000000FUL)

/*  Bit definition for DMC_TMCR_T_RC register  */
#define DMC_TMCR_T_RC_T_RC                             (0x0000000FUL)

/*  Bit definition for DMC_TMCR_T_RCD register  */
#define DMC_TMCR_T_RCD_T_RCD                           (0x00000007UL)

/*  Bit definition for DMC_TMCR_T_RFC register  */
#define DMC_TMCR_T_RFC_T_RFC                           (0x0000001FUL)

/*  Bit definition for DMC_TMCR_T_RP register  */
#define DMC_TMCR_T_RP_T_RP                             (0x00000007UL)

/*  Bit definition for DMC_TMCR_T_RRD register  */
#define DMC_TMCR_T_RRD_T_RRD                           (0x0000000FUL)

/*  Bit definition for DMC_TMCR_T_WR register  */
#define DMC_TMCR_T_WR_T_WR                             (0x00000007UL)

/*  Bit definition for DMC_TMCR_T_WTR register  */
#define DMC_TMCR_T_WTR_T_WTR                           (0x00000007UL)

/*  Bit definition for DMC_TMCR_T_XP register  */
#define DMC_TMCR_T_XP_T_XP                             (0x000000FFUL)

/*  Bit definition for DMC_TMCR_T_XSR register  */
#define DMC_TMCR_T_XSR_T_XSR                           (0x000000FFUL)

/*  Bit definition for DMC_TMCR_T_ESR register  */
#define DMC_TMCR_T_ESR_T_ESR                           (0x000000FFUL)

/*  Bit definition for DMC_CSCR register  */
#define DMC_CSCR_ADDMSK_POS                            (0U)
#define DMC_CSCR_ADDMSK                                (0x000000FFUL)
#define DMC_CSCR_ADDMAT_POS                            (8U)
#define DMC_CSCR_ADDMAT                                (0x0000FF00UL)
#define DMC_CSCR_BRC_POS                               (16U)
#define DMC_CSCR_BRC                                   (0x00010000UL)
#define DMC_CSCR_RESV8_POS                             (24U)
#define DMC_CSCR_RESV8                                 (0x01000000UL)

