levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for EFM_FHDFG register  */
#define EFM_FHDFG                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_UQID0 register  */
#define EFM_UQID0                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_UQID1 register  */
#define EFM_UQID1                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_UQID2 register  */
#define EFM_UQID2                                      (0xFFFFFFFFUL)

/*  Bit definition for MMF_REMPRT register  */
#define MMF_REMPRT_REMPRT                              (0x0000FFFFUL)

/*  Bit definition for MMF_REMCR0 register  */
#define MMF_REMCR0_RM0SIZE_POS                         (0U)
#define MMF_REMCR0_RM0SIZE                             (0x0000001FUL)
#define MMF_REMCR0_RM0SIZE_0                           (0x00000001UL)
#define MMF_REMCR0_RM0SIZE_1                           (0x00000002UL)
#define MMF_REMCR0_RM0SIZE_2                           (0x00000004UL)
#define MMF_REMCR0_RM0SIZE_3                           (0x00000008UL)
#define MMF_REMCR0_RM0SIZE_4                           (0x00000010UL)
#define MMF_REMCR0_RM0TADDR_POS                        (12U)
#define MMF_REMCR0_RM0TADDR                            (0x1FFFF000UL)
#define MMF_REMCR0_RM0TADDR_0                          (0x00001000UL)
#define MMF_REMCR0_RM0TADDR_1                          (0x00002000UL)
#define MMF_REMCR0_RM0TADDR_2                          (0x00004000UL)
#define MMF_REMCR0_RM0TADDR_3                          (0x00008000UL)
#define MMF_REMCR0_RM0TADDR_4                          (0x00010000UL)
#define MMF_REMCR0_RM0TADDR_5                          (0x00020000UL)
#define MMF_REMCR0_RM0TADDR_6                          (0x00040000UL)
#define MMF_REMCR0_RM0TADDR_7                          (0x00080000UL)
#define MMF_REMCR0_RM0TADDR_8                          (0x00100000UL)
#define MMF_REMCR0_RM0TADDR_9                          (0x00200000UL)
#define MMF_REMCR0_RM0TADDR_10                         (0x00400000UL)
#define MMF_REMCR0_RM0TADDR_11                         (0x00800000UL)
#define MMF_REMCR0_RM0TADDR_12                         (0x01000000UL)
#define MMF_REMCR0_RM0TADDR_13                         (0x02000000UL)
#define MMF_REMCR0_RM0TADDR_14                         (0x04000000UL)
#define MMF_REMCR0_RM0TADDR_15                         (0x08000000UL)
#define MMF_REMCR0_RM0TADDR_16                         (0x10000000UL)
#define MMF_REMCR0_EN0_POS                             (31U)
#define MMF_REMCR0_EN0                                 (0x80000000UL)

/*  Bit definition for MMF_REMCR1 register  */
#define MMF_REMCR1_RM1SIZE_POS                         (0U)
#define MMF_REMCR1_RM1SIZE                             (0x0000001FUL)
#define MMF_REMCR1_RM1SIZE_0                           (0x00000001UL)
#define MMF_REMCR1_RM1SIZE_1                           (0x00000002UL)
#define MMF_REMCR1_RM1SIZE_2                           (0x00000004UL)
#define MMF_REMCR1_RM1SIZE_3                           (0x00000008UL)
#define MMF_REMCR1_RM1SIZE_4                           (0x00000010UL)
#define MMF_REMCR1_RM1TADDR_POS                        (12U)
#define MMF_REMCR1_RM1TADDR                            (0x1FFFF000UL)
#define MMF_REMCR1_RM1TADDR_0                          (0x00001000UL)
#define MMF_REMCR1_RM1TADDR_1                          (0x00002000UL)
#define MMF_REMCR1_RM1TADDR_2                          (0x00004000UL)
#define MMF_REMCR1_RM1TADDR_3                          (0x00008000UL)
#define MMF_REMCR1_RM1TADDR_4                          (0x00010000UL)
#define MMF_REMCR1_RM1TADDR_5                          (0x00020000UL)
#define MMF_REMCR1_RM1TADDR_6                          (0x00040000UL)
#define MMF_REMCR1_RM1TADDR_7                          (0x00080000UL)
#define MMF_REMCR1_RM1TADDR_8                          (0x00100000UL)
#define MMF_REMCR1_RM1TADDR_9                          (0x00200000UL)
#define MMF_REMCR1_RM1TADDR_10                         (0x00400000UL)
#define MMF_REMCR1_RM1TADDR_11                         (0x00800000UL)
#define MMF_REMCR1_RM1TADDR_12                         (0x01000000UL)
#define MMF_REMCR1_RM1TADDR_13                         (0x02000000UL)
#define MMF_REMCR1_RM1TADDR_14                         (0x04000000UL)
#define MMF_REMCR1_RM1TADDR_15                         (0x08000000UL)
#define MMF_REMCR1_RM1TADDR_16                         (0x10000000UL)
#define MMF_REMCR1_EN1_POS                             (31U)
#define MMF_REMCR1_EN1                                 (0x80000000UL)

/*  Bit definition for EFM_WLOCK register  */
#define EFM_WLOCK_WLOCK0_POS                           (0U)
#define EFM_WLOCK_WLOCK0                               (0x00000001UL)
#define EFM_WLOCK_WLOCK1_POS                           (1U)
#define EFM_WLOCK_WLOCK1                               (0x00000002UL)
#define EFM_WLOCK_WLOCK2_POS                           (2U)
#define EFM_WLOCK_WLOCK2                               (0x00000004UL)
#define EFM_WLOCK_WLOCK3_POS                           (3U)
#define EFM_WLOCK_WLOCK3                               (0x00000008UL)
#define EFM_WLOCK_WLOCK4_POS                           (4U)
#define EFM_WLOCK_WLOCK4                               (0x00000010UL)
#define EFM_WLOCK_WLOCK5_POS                           (5U)
#define EFM_WLOCK_WLOCK5                               (0x00000020UL)
#define EFM_WLOCK_WLOCK6_POS                           (6U)
#define EFM_WLOCK_WLOCK6                               (0x00000040UL)
#define EFM_WLOCK_WLOCK7_POS                           (7U)
#define EFM_WLOCK_WLOCK7                               (0x00000080UL)

/*  Bit definition for EFM_F0NWPRT0 register  */
#define EFM_F0NWPRT0                                   (0xFFFFFFFFUL)

/*  Bit definition for EFM_F0NWPRT1 register  */
#define EFM_F0NWPRT1                                   (0xFFFFFFFFUL)

/*  Bit definition for EFM_F0NWPRT2 register  */
#define EFM_F0NWPRT2                                   (0xFFFFFFFFUL)

/*  Bit definition for EFM_F0NWPRT3 register  */
#define EFM_F0NWPRT3                                   (0xFFFFFFFFUL)

