levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*******************************************************************************
                Bit definition for Peripheral KEYSCAN
*******************************************************************************/
/*  Bit definition for KEYSCAN_SCR register  */
#define KEYSCAN_SCR_KEYINSEL_POS                       (0U)
#define KEYSCAN_SCR_KEYINSEL                           (0x0000FFFFUL)
#define KEYSCAN_SCR_KEYINSEL_0                         (0x00000001UL)
#define KEYSCAN_SCR_KEYINSEL_1                         (0x00000002UL)
#define KEYSCAN_SCR_KEYINSEL_2                         (0x00000004UL)
#define KEYSCAN_SCR_KEYINSEL_3                         (0x00000008UL)
#define KEYSCAN_SCR_KEYINSEL_4                         (0x00000010UL)
#define KEYSCAN_SCR_KEYINSEL_5                         (0x00000020UL)
#define KEYSCAN_SCR_KEYINSEL_6                         (0x00000040UL)
#define KEYSCAN_SCR_KEYINSEL_7                         (0x00000080UL)
#define KEYSCAN_SCR_KEYINSEL_8                         (0x00000100UL)
#define KEYSCAN_SCR_KEYINSEL_9                         (0x00000200UL)
#define KEYSCAN_SCR_KEYINSEL_10                        (0x00000400UL)
#define KEYSCAN_SCR_KEYINSEL_11                        (0x00000800UL)
#define KEYSCAN_SCR_KEYINSEL_12                        (0x00001000UL)
#define KEYSCAN_SCR_KEYINSEL_13                        (0x00002000UL)
#define KEYSCAN_SCR_KEYINSEL_14                        (0x00004000UL)
#define KEYSCAN_SCR_KEYINSEL_15                        (0x00008000UL)
#define KEYSCAN_SCR_KEYOUTSEL_POS                      (16U)
#define KEYSCAN_SCR_KEYOUTSEL                          (0x00070000UL)
#define KEYSCAN_SCR_CKSEL_POS                          (20U)
#define KEYSCAN_SCR_CKSEL                              (0x00300000UL)
#define KEYSCAN_SCR_CKSEL_0                            (0x00100000UL)
#define KEYSCAN_SCR_CKSEL_1                            (0x00200000UL)
#define KEYSCAN_SCR_T_LLEVEL_POS                       (24U)
#define KEYSCAN_SCR_T_LLEVEL                           (0x1F000000UL)
#define KEYSCAN_SCR_T_HIZ_POS                          (29U)
#define KEYSCAN_SCR_T_HIZ                              (0xE0000000UL)

/*  Bit definition for KEYSCAN_SER register  */
#define KEYSCAN_SER_SEN                                (0x00000001UL)

/*  Bit definition for KEYSCAN_SSR register  */
#define KEYSCAN_SSR_INDEX                              (0x00000007UL)

/*******************************************************************************
                Bit definition for Peripheral MAU
*******************************************************************************/
/*  Bit definition for MAU_CSR register  */
#define MAU_CSR_START_POS                              (0U)
#define MAU_CSR_START                                  (0x00000001UL)
#define MAU_CSR_INTEN_POS                              (1U)
#define MAU_CSR_INTEN                                  (0x00000002UL)
#define MAU_CSR_BUSY_POS                               (3U)
#define MAU_CSR_BUSY                                   (0x00000008UL)
#define MAU_CSR_SHIFT_POS                              (8U)
#define MAU_CSR_SHIFT                                  (0x00001F00UL)

/*  Bit definition for MAU_DTR0 register  */
#define MAU_DTR0                                       (0xFFFFFFFFUL)

/*  Bit definition for MAU_RTR0 register  */
#define MAU_RTR0_SQRT_DOUT                             (0x0001FFFFUL)

/*  Bit definition for MAU_DTR1 register  */
#define MAU_DTR1_SIN_DIN                               (0x00000FFFUL)

/*  Bit definition for MAU_RTR1 register  */
#define MAU_RTR1_SIN_DOUT                              (0x0000FFFFUL)

/*******************************************************************************
                Bit definition for Peripheral MPU
*******************************************************************************/
/*  Bit definition for MPU_RGD0 register  */
#define MPU_RGD0_MPURGSIZE_POS                         (0U)
#define MPU_RGD0_MPURGSIZE                             (0x0000001FUL)
#define MPU_RGD0_MPURGSIZE_0                           (0x00000001UL)
#define MPU_RGD0_MPURGSIZE_1                           (0x00000002UL)
#define MPU_RGD0_MPURGSIZE_2                           (0x00000004UL)
#define MPU_RGD0_MPURGSIZE_3                           (0x00000008UL)
#define MPU_RGD0_MPURGSIZE_4                           (0x00000010UL)
#define MPU_RGD0_MPURGADDR_POS                         (5U)
#define MPU_RGD0_MPURGADDR                             (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGD1 register  */
#define MPU_RGD1_MPURGSIZE_POS                         (0U)
#define MPU_RGD1_MPURGSIZE                             (0x0000001FUL)
#define MPU_RGD1_MPURGADDR_POS                         (5U)
#define MPU_RGD1_MPURGADDR                             (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGD2 register  */
#define MPU_RGD2_MPURGSIZE_POS                         (0U)
#define MPU_RGD2_MPURGSIZE                             (0x0000001FUL)
#define MPU_RGD2_MPURGADDR_POS                         (5U)
#define MPU_RGD2_MPURGADDR                             (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGD3 register  */
#define MPU_RGD3_MPURGSIZE_POS                         (0U)
#define MPU_RGD3_MPURGSIZE                             (0x0000001FUL)
#define MPU_RGD3_MPURGADDR_POS                         (5U)
#define MPU_RGD3_MPURGADDR                             (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGD4 register  */
#define MPU_RGD4_MPURGSIZE_POS                         (0U)
#define MPU_RGD4_MPURGSIZE                             (0x0000001FUL)
#define MPU_RGD4_MPURGADDR_POS                         (5U)
#define MPU_RGD4_MPURGADDR                             (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGD5 register  */
#define MPU_RGD5_MPURGSIZE_POS                         (0U)
#define MPU_RGD5_MPURGSIZE                             (0x0000001FUL)
#define MPU_RGD5_MPURGADDR_POS                         (5U)
#define MPU_RGD5_MPURGADDR                             (0xFFFFFFE0UL)

