levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for MPU_RGD6 register  */
#define MPU_RGD6_MPURGSIZE_POS                         (0U)
#define MPU_RGD6_MPURGSIZE                             (0x0000001FUL)
#define MPU_RGD6_MPURGADDR_POS                         (5U)
#define MPU_RGD6_MPURGADDR                             (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGD7 register  */
#define MPU_RGD7_MPURGSIZE_POS                         (0U)
#define MPU_RGD7_MPURGSIZE                             (0x0000001FUL)
#define MPU_RGD7_MPURGADDR_POS                         (5U)
#define MPU_RGD7_MPURGADDR                             (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGD8 register  */
#define MPU_RGD8_MPURGSIZE_POS                         (0U)
#define MPU_RGD8_MPURGSIZE                             (0x0000001FUL)
#define MPU_RGD8_MPURGADDR_POS                         (5U)
#define MPU_RGD8_MPURGADDR                             (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGD9 register  */
#define MPU_RGD9_MPURGSIZE_POS                         (0U)
#define MPU_RGD9_MPURGSIZE                             (0x0000001FUL)
#define MPU_RGD9_MPURGADDR_POS                         (5U)
#define MPU_RGD9_MPURGADDR                             (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGD10 register  */
#define MPU_RGD10_MPURGSIZE_POS                        (0U)
#define MPU_RGD10_MPURGSIZE                            (0x0000001FUL)
#define MPU_RGD10_MPURGADDR_POS                        (5U)
#define MPU_RGD10_MPURGADDR                            (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGD11 register  */
#define MPU_RGD11_MPURGSIZE_POS                        (0U)
#define MPU_RGD11_MPURGSIZE                            (0x0000001FUL)
#define MPU_RGD11_MPURGADDR_POS                        (5U)
#define MPU_RGD11_MPURGADDR                            (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGD12 register  */
#define MPU_RGD12_MPURGSIZE_POS                        (0U)
#define MPU_RGD12_MPURGSIZE                            (0x0000001FUL)
#define MPU_RGD12_MPURGADDR_POS                        (5U)
#define MPU_RGD12_MPURGADDR                            (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGD13 register  */
#define MPU_RGD13_MPURGSIZE_POS                        (0U)
#define MPU_RGD13_MPURGSIZE                            (0x0000001FUL)
#define MPU_RGD13_MPURGADDR_POS                        (5U)
#define MPU_RGD13_MPURGADDR                            (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGD14 register  */
#define MPU_RGD14_MPURGSIZE_POS                        (0U)
#define MPU_RGD14_MPURGSIZE                            (0x0000001FUL)
#define MPU_RGD14_MPURGADDR_POS                        (5U)
#define MPU_RGD14_MPURGADDR                            (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGD15 register  */
#define MPU_RGD15_MPURGSIZE_POS                        (0U)
#define MPU_RGD15_MPURGSIZE                            (0x0000001FUL)
#define MPU_RGD15_MPURGADDR_POS                        (5U)
#define MPU_RGD15_MPURGADDR                            (0xFFFFFFE0UL)

/*  Bit definition for MPU_SR register  */
#define MPU_SR_SMPU1EAF_POS                            (0U)
#define MPU_SR_SMPU1EAF                                (0x00000001UL)
#define MPU_SR_SMPU2EAF_POS                            (1U)
#define MPU_SR_SMPU2EAF                                (0x00000002UL)
#define MPU_SR_FMPUEAF_POS                             (2U)
#define MPU_SR_FMPUEAF                                 (0x00000004UL)
#define MPU_SR_HMPUEAF_POS                             (3U)
#define MPU_SR_HMPUEAF                                 (0x00000008UL)
#define MPU_SR_EMPUEAF_POS                             (4U)
#define MPU_SR_EMPUEAF                                 (0x00000010UL)

/*  Bit definition for MPU_ECLR register  */
#define MPU_ECLR_SMPU1ECLR_POS                         (0U)
#define MPU_ECLR_SMPU1ECLR                             (0x00000001UL)
#define MPU_ECLR_SMPU2ECLR_POS                         (1U)
#define MPU_ECLR_SMPU2ECLR                             (0x00000002UL)
#define MPU_ECLR_FMPUECLR_POS                          (2U)
#define MPU_ECLR_FMPUECLR                              (0x00000004UL)
#define MPU_ECLR_HMPUECLR_POS                          (3U)
#define MPU_ECLR_HMPUECLR                              (0x00000008UL)
#define MPU_ECLR_EMPUECLR_POS                          (4U)
#define MPU_ECLR_EMPUECLR                              (0x00000010UL)

/*  Bit definition for MPU_WP register  */
#define MPU_WP_MPUWE_POS                               (0U)
#define MPU_WP_MPUWE                                   (0x00000001UL)
#define MPU_WP_WKEY_POS                                (1U)
#define MPU_WP_WKEY                                    (0x0000FFFEUL)

/*  Bit definition for MPU_IPPR register  */
#define MPU_IPPR_AESRDP_POS                            (0U)
#define MPU_IPPR_AESRDP                                (0x00000001UL)
#define MPU_IPPR_AESWRP_POS                            (1U)
#define MPU_IPPR_AESWRP                                (0x00000002UL)
#define MPU_IPPR_HASHRDP_POS                           (2U)
#define MPU_IPPR_HASHRDP                               (0x00000004UL)
#define MPU_IPPR_HASHWRP_POS                           (3U)
#define MPU_IPPR_HASHWRP                               (0x00000008UL)
#define MPU_IPPR_TRNGRDP_POS                           (4U)
#define MPU_IPPR_TRNGRDP                               (0x00000010UL)
#define MPU_IPPR_TRNGWRP_POS                           (5U)
#define MPU_IPPR_TRNGWRP                               (0x00000020UL)
#define MPU_IPPR_CRCRDP_POS                            (6U)
#define MPU_IPPR_CRCRDP                                (0x00000040UL)
#define MPU_IPPR_CRCWRP_POS                            (7U)
#define MPU_IPPR_CRCWRP                                (0x00000080UL)
#define MPU_IPPR_FMCRDP_POS                            (8U)
#define MPU_IPPR_FMCRDP                                (0x00000100UL)
#define MPU_IPPR_FMCWRP_POS                            (9U)
#define MPU_IPPR_FMCWRP                                (0x00000200UL)
#define MPU_IPPR_WDTRDP_POS                            (12U)
#define MPU_IPPR_WDTRDP                                (0x00001000UL)
#define MPU_IPPR_WDTWRP_POS                            (13U)
#define MPU_IPPR_WDTWRP                                (0x00002000UL)
#define MPU_IPPR_SWDTRDP_POS                           (14U)
#define MPU_IPPR_SWDTRDP                               (0x00004000UL)
#define MPU_IPPR_SWDTWRP_POS                           (15U)
#define MPU_IPPR_SWDTWRP                               (0x00008000UL)
#define MPU_IPPR_BKSRAMRDP_POS                         (16U)
#define MPU_IPPR_BKSRAMRDP                             (0x00010000UL)
#define MPU_IPPR_BKSRAMWRP_POS                         (17U)
#define MPU_IPPR_BKSRAMWRP                             (0x00020000UL)
#define MPU_IPPR_RTCRDP_POS                            (18U)
#define MPU_IPPR_RTCRDP                                (0x00040000UL)
#define MPU_IPPR_RTCWRP_POS                            (19U)
#define MPU_IPPR_RTCWRP                                (0x00080000UL)
#define MPU_IPPR_DMPURDP_POS                           (20U)
#define MPU_IPPR_DMPURDP                               (0x00100000UL)
#define MPU_IPPR_DMPUWRP_POS                           (21U)
#define MPU_IPPR_DMPUWRP                               (0x00200000UL)
#define MPU_IPPR_SRAMCRDP_POS                          (22U)
#define MPU_IPPR_SRAMCRDP                              (0x00400000UL)
#define MPU_IPPR_SRAMCWRP_POS                          (23U)
#define MPU_IPPR_SRAMCWRP                              (0x00800000UL)
#define MPU_IPPR_INTCRDP_POS                           (24U)
#define MPU_IPPR_INTCRDP                               (0x01000000UL)
#define MPU_IPPR_INTCWRP_POS                           (25U)
#define MPU_IPPR_INTCWRP                               (0x02000000UL)
#define MPU_IPPR_SYSCRDP_POS                           (26U)
#define MPU_IPPR_SYSCRDP                               (0x04000000UL)
#define MPU_IPPR_SYSCWRP_POS                           (27U)
#define MPU_IPPR_SYSCWRP                               (0x08000000UL)
#define MPU_IPPR_MSTPRDP_POS                           (28U)
#define MPU_IPPR_MSTPRDP                               (0x10000000UL)
#define MPU_IPPR_MSPTWRP_POS                           (29U)
#define MPU_IPPR_MSPTWRP                               (0x20000000UL)
#define MPU_IPPR_BUSERRE_POS                           (31U)
#define MPU_IPPR_BUSERRE                               (0x80000000UL)

/*  Bit definition for MPU_S1RGE register  */
#define MPU_S1RGE_S1RG0E_POS                           (0U)
#define MPU_S1RGE_S1RG0E                               (0x00000001UL)
#define MPU_S1RGE_S1RG1E_POS                           (1U)
#define MPU_S1RGE_S1RG1E                               (0x00000002UL)
#define MPU_S1RGE_S1RG2E_POS                           (2U)
#define MPU_S1RGE_S1RG2E                               (0x00000004UL)
#define MPU_S1RGE_S1RG3E_POS                           (3U)
#define MPU_S1RGE_S1RG3E                               (0x00000008UL)
#define MPU_S1RGE_S1RG4E_POS                           (4U)
#define MPU_S1RGE_S1RG4E                               (0x00000010UL)
#define MPU_S1RGE_S1RG5E_POS                           (5U)
#define MPU_S1RGE_S1RG5E                               (0x00000020UL)
#define MPU_S1RGE_S1RG6E_POS                           (6U)
#define MPU_S1RGE_S1RG6E                               (0x00000040UL)
#define MPU_S1RGE_S1RG7E_POS                           (7U)
#define MPU_S1RGE_S1RG7E                               (0x00000080UL)
#define MPU_S1RGE_S1RG8E_POS                           (8U)
#define MPU_S1RGE_S1RG8E                               (0x00000100UL)
#define MPU_S1RGE_S1RG9E_POS                           (9U)
#define MPU_S1RGE_S1RG9E                               (0x00000200UL)
#define MPU_S1RGE_S1RG10E_POS                          (10U)
#define MPU_S1RGE_S1RG10E                              (0x00000400UL)
#define MPU_S1RGE_S1RG11E_POS                          (11U)
#define MPU_S1RGE_S1RG11E                              (0x00000800UL)
#define MPU_S1RGE_S1RG12E_POS                          (12U)
#define MPU_S1RGE_S1RG12E                              (0x00001000UL)
#define MPU_S1RGE_S1RG13E_POS                          (13U)
#define MPU_S1RGE_S1RG13E                              (0x00002000UL)
#define MPU_S1RGE_S1RG14E_POS                          (14U)
#define MPU_S1RGE_S1RG14E                              (0x00004000UL)
#define MPU_S1RGE_S1RG15E_POS                          (15U)
#define MPU_S1RGE_S1RG15E                              (0x00008000UL)

/*  Bit definition for MPU_S1RGWP register  */
#define MPU_S1RGWP_S1RG0WP_POS                         (0U)
#define MPU_S1RGWP_S1RG0WP                             (0x00000001UL)
#define MPU_S1RGWP_S1RG1WP_POS                         (1U)
#define MPU_S1RGWP_S1RG1WP                             (0x00000002UL)
#define MPU_S1RGWP_S1RG2WP_POS                         (2U)
#define MPU_S1RGWP_S1RG2WP                             (0x00000004UL)
#define MPU_S1RGWP_S1RG3WP_POS                         (3U)
#define MPU_S1RGWP_S1RG3WP                             (0x00000008UL)
#define MPU_S1RGWP_S1RG4WP_POS                         (4U)
#define MPU_S1RGWP_S1RG4WP                             (0x00000010UL)
#define MPU_S1RGWP_S1RG5WP_POS                         (5U)
#define MPU_S1RGWP_S1RG5WP                             (0x00000020UL)
#define MPU_S1RGWP_S1RG6WP_POS                         (6U)
#define MPU_S1RGWP_S1RG6WP                             (0x00000040UL)
#define MPU_S1RGWP_S1RG7WP_POS                         (7U)
#define MPU_S1RGWP_S1RG7WP                             (0x00000080UL)
#define MPU_S1RGWP_S1RG8WP_POS                         (8U)
#define MPU_S1RGWP_S1RG8WP                             (0x00000100UL)
#define MPU_S1RGWP_S1RG9WP_POS                         (9U)
#define MPU_S1RGWP_S1RG9WP                             (0x00000200UL)
#define MPU_S1RGWP_S1RG10WP_POS                        (10U)
#define MPU_S1RGWP_S1RG10WP                            (0x00000400UL)
#define MPU_S1RGWP_S1RG11WP_POS                        (11U)
#define MPU_S1RGWP_S1RG11WP                            (0x00000800UL)
#define MPU_S1RGWP_S1RG12WP_POS                        (12U)
#define MPU_S1RGWP_S1RG12WP                            (0x00001000UL)
#define MPU_S1RGWP_S1RG13WP_POS                        (13U)
#define MPU_S1RGWP_S1RG13WP                            (0x00002000UL)
#define MPU_S1RGWP_S1RG14WP_POS                        (14U)
#define MPU_S1RGWP_S1RG14WP                            (0x00004000UL)
#define MPU_S1RGWP_S1RG15WP_POS                        (15U)
#define MPU_S1RGWP_S1RG15WP                            (0x00008000UL)

