levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for MPU_S2CR register  */
#define MPU_S2CR_SMPU2BRP_POS                          (0U)
#define MPU_S2CR_SMPU2BRP                              (0x00000001UL)
#define MPU_S2CR_SMPU2BWP_POS                          (1U)
#define MPU_S2CR_SMPU2BWP                              (0x00000002UL)
#define MPU_S2CR_SMPU2ACT_POS                          (2U)
#define MPU_S2CR_SMPU2ACT                              (0x0000000CUL)
#define MPU_S2CR_SMPU2ACT_0                            (0x00000004UL)
#define MPU_S2CR_SMPU2ACT_1                            (0x00000008UL)
#define MPU_S2CR_SMPU2E_POS                            (7U)
#define MPU_S2CR_SMPU2E                                (0x00000080UL)

/*  Bit definition for MPU_FRGE register  */
#define MPU_FRGE_FMPU0E_POS                            (0U)
#define MPU_FRGE_FMPU0E                                (0x00000001UL)
#define MPU_FRGE_FMPU1E_POS                            (1U)
#define MPU_FRGE_FMPU1E                                (0x00000002UL)
#define MPU_FRGE_FMPU2E_POS                            (2U)
#define MPU_FRGE_FMPU2E                                (0x00000004UL)
#define MPU_FRGE_FMPU3E_POS                            (3U)
#define MPU_FRGE_FMPU3E                                (0x00000008UL)
#define MPU_FRGE_FMPU4E_POS                            (4U)
#define MPU_FRGE_FMPU4E                                (0x00000010UL)
#define MPU_FRGE_FMPU5E_POS                            (5U)
#define MPU_FRGE_FMPU5E                                (0x00000020UL)
#define MPU_FRGE_FMPU6E_POS                            (6U)
#define MPU_FRGE_FMPU6E                                (0x00000040UL)
#define MPU_FRGE_FMPU7E_POS                            (7U)
#define MPU_FRGE_FMPU7E                                (0x00000080UL)

/*  Bit definition for MPU_FRGWP register  */
#define MPU_FRGWP_FMPU0WP_POS                          (0U)
#define MPU_FRGWP_FMPU0WP                              (0x00000001UL)
#define MPU_FRGWP_FMPU1WP_POS                          (1U)
#define MPU_FRGWP_FMPU1WP                              (0x00000002UL)
#define MPU_FRGWP_FMPU2WP_POS                          (2U)
#define MPU_FRGWP_FMPU2WP                              (0x00000004UL)
#define MPU_FRGWP_FMPU3WP_POS                          (3U)
#define MPU_FRGWP_FMPU3WP                              (0x00000008UL)
#define MPU_FRGWP_FMPU4WP_POS                          (4U)
#define MPU_FRGWP_FMPU4WP                              (0x00000010UL)
#define MPU_FRGWP_FMPU5WP_POS                          (5U)
#define MPU_FRGWP_FMPU5WP                              (0x00000020UL)
#define MPU_FRGWP_FMPU6WP_POS                          (6U)
#define MPU_FRGWP_FMPU6WP                              (0x00000040UL)
#define MPU_FRGWP_FMPU7WP_POS                          (7U)
#define MPU_FRGWP_FMPU7WP                              (0x00000080UL)

/*  Bit definition for MPU_FRGRP register  */
#define MPU_FRGRP_FMPU0RP_POS                          (0U)
#define MPU_FRGRP_FMPU0RP                              (0x00000001UL)
#define MPU_FRGRP_FMPU1RP_POS                          (1U)
#define MPU_FRGRP_FMPU1RP                              (0x00000002UL)
#define MPU_FRGRP_FMPU2RP_POS                          (2U)
#define MPU_FRGRP_FMPU2RP                              (0x00000004UL)
#define MPU_FRGRP_FMPU3RP_POS                          (3U)
#define MPU_FRGRP_FMPU3RP                              (0x00000008UL)
#define MPU_FRGRP_FMPU4RP_POS                          (4U)
#define MPU_FRGRP_FMPU4RP                              (0x00000010UL)
#define MPU_FRGRP_FMPU5RP_POS                          (5U)
#define MPU_FRGRP_FMPU5RP                              (0x00000020UL)
#define MPU_FRGRP_FMPU6RP_POS                          (6U)
#define MPU_FRGRP_FMPU6RP                              (0x00000040UL)
#define MPU_FRGRP_FMPU7RP_POS                          (7U)
#define MPU_FRGRP_FMPU7RP                              (0x00000080UL)

/*  Bit definition for MPU_FCR register  */
#define MPU_FCR_FMPUBRP_POS                            (0U)
#define MPU_FCR_FMPUBRP                                (0x00000001UL)
#define MPU_FCR_FMPUBWP_POS                            (1U)
#define MPU_FCR_FMPUBWP                                (0x00000002UL)
#define MPU_FCR_FMPUACT_POS                            (2U)
#define MPU_FCR_FMPUACT                                (0x0000000CUL)
#define MPU_FCR_FMPUACT_0                              (0x00000004UL)
#define MPU_FCR_FMPUACT_1                              (0x00000008UL)
#define MPU_FCR_FMPUE_POS                              (7U)
#define MPU_FCR_FMPUE                                  (0x00000080UL)

/*  Bit definition for MPU_HRGE register  */
#define MPU_HRGE_HMPU0E_POS                            (0U)
#define MPU_HRGE_HMPU0E                                (0x00000001UL)
#define MPU_HRGE_HMPU1E_POS                            (1U)
#define MPU_HRGE_HMPU1E                                (0x00000002UL)
#define MPU_HRGE_HMPU2E_POS                            (2U)
#define MPU_HRGE_HMPU2E                                (0x00000004UL)
#define MPU_HRGE_HMPU3E_POS                            (3U)
#define MPU_HRGE_HMPU3E                                (0x00000008UL)
#define MPU_HRGE_HMPU4E_POS                            (4U)
#define MPU_HRGE_HMPU4E                                (0x00000010UL)
#define MPU_HRGE_HMPU5E_POS                            (5U)
#define MPU_HRGE_HMPU5E                                (0x00000020UL)
#define MPU_HRGE_HMPU6E_POS                            (6U)
#define MPU_HRGE_HMPU6E                                (0x00000040UL)
#define MPU_HRGE_HMPU7E_POS                            (7U)
#define MPU_HRGE_HMPU7E                                (0x00000080UL)

/*  Bit definition for MPU_HRGWP register  */
#define MPU_HRGWP_HMPU0WP_POS                          (0U)
#define MPU_HRGWP_HMPU0WP                              (0x00000001UL)
#define MPU_HRGWP_HMPU1WP_POS                          (1U)
#define MPU_HRGWP_HMPU1WP                              (0x00000002UL)
#define MPU_HRGWP_HMPU2WP_POS                          (2U)
#define MPU_HRGWP_HMPU2WP                              (0x00000004UL)
#define MPU_HRGWP_HMPU3WP_POS                          (3U)
#define MPU_HRGWP_HMPU3WP                              (0x00000008UL)
#define MPU_HRGWP_HMPU4WP_POS                          (4U)
#define MPU_HRGWP_HMPU4WP                              (0x00000010UL)
#define MPU_HRGWP_HMPU5WP_POS                          (5U)
#define MPU_HRGWP_HMPU5WP                              (0x00000020UL)
#define MPU_HRGWP_HMPU6WP_POS                          (6U)
#define MPU_HRGWP_HMPU6WP                              (0x00000040UL)
#define MPU_HRGWP_HMPU7WP_POS                          (7U)
#define MPU_HRGWP_HMPU7WP                              (0x00000080UL)

/*  Bit definition for MPU_HRGRP register  */
#define MPU_HRGRP_HMPU0RP_POS                          (0U)
#define MPU_HRGRP_HMPU0RP                              (0x00000001UL)
#define MPU_HRGRP_HMPU1RP_POS                          (1U)
#define MPU_HRGRP_HMPU1RP                              (0x00000002UL)
#define MPU_HRGRP_HMPU2RP_POS                          (2U)
#define MPU_HRGRP_HMPU2RP                              (0x00000004UL)
#define MPU_HRGRP_HMPU3RP_POS                          (3U)
#define MPU_HRGRP_HMPU3RP                              (0x00000008UL)
#define MPU_HRGRP_HMPU4RP_POS                          (4U)
#define MPU_HRGRP_HMPU4RP                              (0x00000010UL)
#define MPU_HRGRP_HMPU5RP_POS                          (5U)
#define MPU_HRGRP_HMPU5RP                              (0x00000020UL)
#define MPU_HRGRP_HMPU6RP_POS                          (6U)
#define MPU_HRGRP_HMPU6RP                              (0x00000040UL)
#define MPU_HRGRP_HMPU7RP_POS                          (7U)
#define MPU_HRGRP_HMPU7RP                              (0x00000080UL)

/*  Bit definition for MPU_HCR register  */
#define MPU_HCR_HMPUBRP_POS                            (0U)
#define MPU_HCR_HMPUBRP                                (0x00000001UL)
#define MPU_HCR_HMPUBWP_POS                            (1U)
#define MPU_HCR_HMPUBWP                                (0x00000002UL)
#define MPU_HCR_HMPUACT_POS                            (2U)
#define MPU_HCR_HMPUACT                                (0x0000000CUL)
#define MPU_HCR_HMPUACT_0                              (0x00000004UL)
#define MPU_HCR_HMPUACT_1                              (0x00000008UL)
#define MPU_HCR_HMPUE_POS                              (7U)
#define MPU_HCR_HMPUE                                  (0x00000080UL)

/*  Bit definition for MPU_ERGE register  */
#define MPU_ERGE_EMPU0E_POS                            (0U)
#define MPU_ERGE_EMPU0E                                (0x00000001UL)
#define MPU_ERGE_EMPU1E_POS                            (1U)
#define MPU_ERGE_EMPU1E                                (0x00000002UL)
#define MPU_ERGE_EMPU2E_POS                            (2U)
#define MPU_ERGE_EMPU2E                                (0x00000004UL)
#define MPU_ERGE_EMPU3E_POS                            (3U)
#define MPU_ERGE_EMPU3E                                (0x00000008UL)
#define MPU_ERGE_EMPU4E_POS                            (4U)
#define MPU_ERGE_EMPU4E                                (0x00000010UL)
#define MPU_ERGE_EMPU5E_POS                            (5U)
#define MPU_ERGE_EMPU5E                                (0x00000020UL)
#define MPU_ERGE_EMPU6E_POS                            (6U)
#define MPU_ERGE_EMPU6E                                (0x00000040UL)
#define MPU_ERGE_EMPU7E_POS                            (7U)
#define MPU_ERGE_EMPU7E                                (0x00000080UL)

/*  Bit definition for MPU_ERGWP register  */
#define MPU_ERGWP_EMPU0WP_POS                          (0U)
#define MPU_ERGWP_EMPU0WP                              (0x00000001UL)
#define MPU_ERGWP_EMPU1WP_POS                          (1U)
#define MPU_ERGWP_EMPU1WP                              (0x00000002UL)
#define MPU_ERGWP_EMPU2WP_POS                          (2U)
#define MPU_ERGWP_EMPU2WP                              (0x00000004UL)
#define MPU_ERGWP_EMPU3WP_POS                          (3U)
#define MPU_ERGWP_EMPU3WP                              (0x00000008UL)
#define MPU_ERGWP_EMPU4WP_POS                          (4U)
#define MPU_ERGWP_EMPU4WP                              (0x00000010UL)
#define MPU_ERGWP_EMPU5WP_POS                          (5U)
#define MPU_ERGWP_EMPU5WP                              (0x00000020UL)
#define MPU_ERGWP_EMPU6WP_POS                          (6U)
#define MPU_ERGWP_EMPU6WP                              (0x00000040UL)
#define MPU_ERGWP_EMPU7WP_POS                          (7U)
#define MPU_ERGWP_EMPU7WP                              (0x00000080UL)

/*  Bit definition for MPU_ERGRP register  */
#define MPU_ERGRP_EMPU0RP_POS                          (0U)
#define MPU_ERGRP_EMPU0RP                              (0x00000001UL)
#define MPU_ERGRP_EMPU1RP_POS                          (1U)
#define MPU_ERGRP_EMPU1RP                              (0x00000002UL)
#define MPU_ERGRP_EMPU2RP_POS                          (2U)
#define MPU_ERGRP_EMPU2RP                              (0x00000004UL)
#define MPU_ERGRP_EMPU3RP_POS                          (3U)
#define MPU_ERGRP_EMPU3RP                              (0x00000008UL)
#define MPU_ERGRP_EMPU4RP_POS                          (4U)
#define MPU_ERGRP_EMPU4RP                              (0x00000010UL)
#define MPU_ERGRP_EMPU5RP_POS                          (5U)
#define MPU_ERGRP_EMPU5RP                              (0x00000020UL)
#define MPU_ERGRP_EMPU6RP_POS                          (6U)
#define MPU_ERGRP_EMPU6RP                              (0x00000040UL)
#define MPU_ERGRP_EMPU7RP_POS                          (7U)
#define MPU_ERGRP_EMPU7RP                              (0x00000080UL)

/*  Bit definition for MPU_ECR register  */
#define MPU_ECR_EMPUBRP_POS                            (0U)
#define MPU_ECR_EMPUBRP                                (0x00000001UL)
#define MPU_ECR_EMPUBWP_POS                            (1U)
#define MPU_ECR_EMPUBWP                                (0x00000002UL)
#define MPU_ECR_EMPUACT_POS                            (2U)
#define MPU_ECR_EMPUACT                                (0x0000000CUL)
#define MPU_ECR_EMPUACT_0                              (0x00000004UL)
#define MPU_ECR_EMPUACT_1                              (0x00000008UL)
#define MPU_ECR_EMPUE_POS                              (7U)
#define MPU_ECR_EMPUE                                  (0x00000080UL)

