levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*******************************************************************************
                Bit definition for Peripheral NFC
*******************************************************************************/
/*  Bit definition for NFC_DATR_BASE register  */
#define NFC_DATR_BASE                                  (0xFFFFFFFFUL)

/*  Bit definition for NFC_CMDR register  */
#define NFC_CMDR_CMD_POS                               (0U)
#define NFC_CMDR_CMD                                   (0x000000FFUL)
#define NFC_CMDR_ARG_POS                               (8U)
#define NFC_CMDR_ARG                                   (0xFFFFFF00UL)

/*  Bit definition for NFC_IDXR0 register  */
#define NFC_IDXR0                                      (0xFFFFFFFFUL)

/*  Bit definition for NFC_IENR register  */
#define NFC_IENR_ECCEUEN_POS                           (0U)
#define NFC_IENR_ECCEUEN                               (0x00000001UL)
#define NFC_IENR_ECCECEN_POS                           (1U)
#define NFC_IENR_ECCECEN                               (0x00000002UL)
#define NFC_IENR_ECCCEN_POS                            (4U)
#define NFC_IENR_ECCCEN                                (0x00000010UL)
#define NFC_IENR_ECCEEN_POS                            (6U)
#define NFC_IENR_ECCEEN                                (0x00000040UL)
#define NFC_IENR_ECCDIS_POS                            (7U)
#define NFC_IENR_ECCDIS                                (0x00000080UL)
#define NFC_IENR_RBEN_POS                              (8U)
#define NFC_IENR_RBEN                                  (0x0000FF00UL)
#define NFC_IENR_RBEN_0                                (0x00000100UL)
#define NFC_IENR_RBEN_1                                (0x00000200UL)
#define NFC_IENR_RBEN_2                                (0x00000400UL)
#define NFC_IENR_RBEN_3                                (0x00000800UL)
#define NFC_IENR_RBEN_4                                (0x00001000UL)
#define NFC_IENR_RBEN_5                                (0x00002000UL)
#define NFC_IENR_RBEN_6                                (0x00004000UL)
#define NFC_IENR_RBEN_7                                (0x00008000UL)
#define NFC_IENR_RESV_POS                              (31U)
#define NFC_IENR_RESV                                  (0x80000000UL)

/*  Bit definition for NFC_ISTR register  */
#define NFC_ISTR_ECCEUST_POS                           (0U)
#define NFC_ISTR_ECCEUST                               (0x00000001UL)
#define NFC_ISTR_ECCECST_POS                           (1U)
#define NFC_ISTR_ECCECST                               (0x00000002UL)
#define NFC_ISTR_ECCCST_POS                            (4U)
#define NFC_ISTR_ECCCST                                (0x00000010UL)
#define NFC_ISTR_ECCEST_POS                            (6U)
#define NFC_ISTR_ECCEST                                (0x00000040UL)
#define NFC_ISTR_RBST_POS                              (8U)
#define NFC_ISTR_RBST                                  (0x0000FF00UL)
#define NFC_ISTR_RBST_0                                (0x00000100UL)
#define NFC_ISTR_RBST_1                                (0x00000200UL)
#define NFC_ISTR_RBST_2                                (0x00000400UL)
#define NFC_ISTR_RBST_3                                (0x00000800UL)
#define NFC_ISTR_RBST_4                                (0x00001000UL)
#define NFC_ISTR_RBST_5                                (0x00002000UL)
#define NFC_ISTR_RBST_6                                (0x00004000UL)
#define NFC_ISTR_RBST_7                                (0x00008000UL)
#define NFC_ISTR_RESV_POS                              (31U)
#define NFC_ISTR_RESV                                  (0x80000000UL)

/*  Bit definition for NFC_IRSR register  */
#define NFC_IRSR_ECCEURS_POS                           (0U)
#define NFC_IRSR_ECCEURS                               (0x00000001UL)
#define NFC_IRSR_ECCECRS_POS                           (1U)
#define NFC_IRSR_ECCECRS                               (0x00000002UL)
#define NFC_IRSR_ECCCRS_POS                            (4U)
#define NFC_IRSR_ECCCRS                                (0x00000010UL)
#define NFC_IRSR_ECCERS_POS                            (6U)
#define NFC_IRSR_ECCERS                                (0x00000040UL)
#define NFC_IRSR_RBRS_POS                              (8U)
#define NFC_IRSR_RBRS                                  (0x0000FF00UL)
#define NFC_IRSR_RBRS_0                                (0x00000100UL)
#define NFC_IRSR_RBRS_1                                (0x00000200UL)
#define NFC_IRSR_RBRS_2                                (0x00000400UL)
#define NFC_IRSR_RBRS_3                                (0x00000800UL)
#define NFC_IRSR_RBRS_4                                (0x00001000UL)
#define NFC_IRSR_RBRS_5                                (0x00002000UL)
#define NFC_IRSR_RBRS_6                                (0x00004000UL)
#define NFC_IRSR_RBRS_7                                (0x00008000UL)
#define NFC_IRSR_RESV_POS                              (31U)
#define NFC_IRSR_RESV                                  (0x80000000UL)

/*  Bit definition for NFC_IDXR1 register  */
#define NFC_IDXR1_IDX1_POS                             (0U)
#define NFC_IDXR1_IDX1                                 (0x000000FFUL)
#define NFC_IDXR1_RESV_POS                             (8U)
#define NFC_IDXR1_RESV                                 (0xFFFFFF00UL)

/*  Bit definition for NFC_TMCR0 register  */
#define NFC_TMCR0_TS_POS                               (0U)
#define NFC_TMCR0_TS                                   (0x000000FFUL)
#define NFC_TMCR0_TS_0                                 (0x00000001UL)
#define NFC_TMCR0_TS_1                                 (0x00000002UL)
#define NFC_TMCR0_TS_2                                 (0x00000004UL)
#define NFC_TMCR0_TS_3                                 (0x00000008UL)
#define NFC_TMCR0_TS_4                                 (0x00000010UL)
#define NFC_TMCR0_TS_5                                 (0x00000020UL)
#define NFC_TMCR0_TS_6                                 (0x00000040UL)
#define NFC_TMCR0_TS_7                                 (0x00000080UL)
#define NFC_TMCR0_TWP_POS                              (8U)
#define NFC_TMCR0_TWP                                  (0x0000FF00UL)
#define NFC_TMCR0_TWP_0                                (0x00000100UL)
#define NFC_TMCR0_TWP_1                                (0x00000200UL)
#define NFC_TMCR0_TWP_2                                (0x00000400UL)
#define NFC_TMCR0_TWP_3                                (0x00000800UL)
#define NFC_TMCR0_TWP_4                                (0x00001000UL)
#define NFC_TMCR0_TWP_5                                (0x00002000UL)
#define NFC_TMCR0_TWP_6                                (0x00004000UL)
#define NFC_TMCR0_TWP_7                                (0x00008000UL)
#define NFC_TMCR0_TRP_POS                              (16U)
#define NFC_TMCR0_TRP                                  (0x00FF0000UL)
#define NFC_TMCR0_TRP_0                                (0x00010000UL)
#define NFC_TMCR0_TRP_1                                (0x00020000UL)
#define NFC_TMCR0_TRP_2                                (0x00040000UL)
#define NFC_TMCR0_TRP_3                                (0x00080000UL)
#define NFC_TMCR0_TRP_4                                (0x00100000UL)
#define NFC_TMCR0_TRP_5                                (0x00200000UL)
#define NFC_TMCR0_TRP_6                                (0x00400000UL)
#define NFC_TMCR0_TRP_7                                (0x00800000UL)
#define NFC_TMCR0_TH_POS                               (24U)
#define NFC_TMCR0_TH                                   (0xFF000000UL)
#define NFC_TMCR0_TH_0                                 (0x01000000UL)
#define NFC_TMCR0_TH_1                                 (0x02000000UL)
#define NFC_TMCR0_TH_2                                 (0x04000000UL)
#define NFC_TMCR0_TH_3                                 (0x08000000UL)
#define NFC_TMCR0_TH_4                                 (0x10000000UL)
#define NFC_TMCR0_TH_5                                 (0x20000000UL)
#define NFC_TMCR0_TH_6                                 (0x40000000UL)
#define NFC_TMCR0_TH_7                                 (0x80000000UL)

/*  Bit definition for NFC_TMCR1 register  */
#define NFC_TMCR1_TWH_POS                              (0U)
#define NFC_TMCR1_TWH                                  (0x000000FFUL)
#define NFC_TMCR1_TRH_POS                              (8U)
#define NFC_TMCR1_TRH                                  (0x0000FF00UL)
#define NFC_TMCR1_TRR_POS                              (16U)
#define NFC_TMCR1_TRR                                  (0x00FF0000UL)
#define NFC_TMCR1_TWB_POS                              (24U)
#define NFC_TMCR1_TWB                                  (0xFF000000UL)

/*  Bit definition for NFC_BACR register  */
#define NFC_BACR_SIZE_POS                              (0U)
#define NFC_BACR_SIZE                                  (0x00000007UL)
#define NFC_BACR_SIZE_0                                (0x00000001UL)
#define NFC_BACR_SIZE_1                                (0x00000002UL)
#define NFC_BACR_SIZE_2                                (0x00000004UL)
#define NFC_BACR_B16BIT_POS                            (3U)
#define NFC_BACR_B16BIT                                (0x00000008UL)
#define NFC_BACR_BANK_POS                              (6U)
#define NFC_BACR_BANK                                  (0x000000C0UL)
#define NFC_BACR_BANK_0                                (0x00000040UL)
#define NFC_BACR_BANK_1                                (0x00000080UL)
#define NFC_BACR_PAGE_POS                              (8U)
#define NFC_BACR_PAGE                                  (0x00000300UL)
#define NFC_BACR_PAGE_0                                (0x00000100UL)
#define NFC_BACR_PAGE_1                                (0x00000200UL)
#define NFC_BACR_WP_POS                                (10U)
#define NFC_BACR_WP                                    (0x00000400UL)
#define NFC_BACR_ECCM_POS                              (11U)
#define NFC_BACR_ECCM                                  (0x00001800UL)
#define NFC_BACR_ECCM_0                                (0x00000800UL)
#define NFC_BACR_ECCM_1                                (0x00001000UL)
#define NFC_BACR_RAC_POS                               (13U)
#define NFC_BACR_RAC                                   (0x00002000UL)
#define NFC_BACR_SCS_POS                               (16U)
#define NFC_BACR_SCS                                   (0x00FF0000UL)
#define NFC_BACR_SCS_0                                 (0x00010000UL)
#define NFC_BACR_SCS_1                                 (0x00020000UL)
#define NFC_BACR_SCS_2                                 (0x00040000UL)
#define NFC_BACR_SCS_3                                 (0x00080000UL)
#define NFC_BACR_SCS_4                                 (0x00100000UL)
#define NFC_BACR_SCS_5                                 (0x00200000UL)
#define NFC_BACR_SCS_6                                 (0x00400000UL)
#define NFC_BACR_SCS_7                                 (0x00800000UL)

/*  Bit definition for NFC_TMCR2 register  */
#define NFC_TMCR2_TCCS_POS                             (0U)
#define NFC_TMCR2_TCCS                                 (0x000000FFUL)
#define NFC_TMCR2_TWTR_POS                             (8U)
#define NFC_TMCR2_TWTR                                 (0x0000FF00UL)
#define NFC_TMCR2_TRTW_POS                             (16U)
#define NFC_TMCR2_TRTW                                 (0x00FF0000UL)
#define NFC_TMCR2_TADL_POS                             (24U)
#define NFC_TMCR2_TADL                                 (0xFF000000UL)

/*  Bit definition for NFC_ECCR register  */
#define NFC_ECCR_ERRLOC_POS                            (0U)
#define NFC_ECCR_ERRLOC                                (0x00000FFFUL)
#define NFC_ECCR_SE_POS                                (12U)
#define NFC_ECCR_SE                                    (0x00001000UL)
#define NFC_ECCR_ME_POS                                (13U)
#define NFC_ECCR_ME                                    (0x00002000UL)

/*  Bit definition for NFC_ECC_STAT register  */
#define NFC_ECC_STAT_ERRSEC_POS                        (0U)
#define NFC_ECC_STAT_ERRSEC                            (0x0000FFFFUL)
#define NFC_ECC_STAT_ERRSEC_0                          (0x00000001UL)
#define NFC_ECC_STAT_ERRSEC_1                          (0x00000002UL)
#define NFC_ECC_STAT_ERRSEC_2                          (0x00000004UL)
#define NFC_ECC_STAT_ERRSEC_3                          (0x00000008UL)
#define NFC_ECC_STAT_ERRSEC_4                          (0x00000010UL)
#define NFC_ECC_STAT_ERRSEC_5                          (0x00000020UL)
#define NFC_ECC_STAT_ERRSEC_6                          (0x00000040UL)
#define NFC_ECC_STAT_ERRSEC_7                          (0x00000080UL)
#define NFC_ECC_STAT_ERRSEC_8                          (0x00000100UL)
#define NFC_ECC_STAT_ERRSEC_9                          (0x00000200UL)
#define NFC_ECC_STAT_ERRSEC_10                         (0x00000400UL)
#define NFC_ECC_STAT_ERRSEC_11                         (0x00000800UL)
#define NFC_ECC_STAT_ERRSEC_12                         (0x00001000UL)
#define NFC_ECC_STAT_ERRSEC_13                         (0x00002000UL)
#define NFC_ECC_STAT_ERRSEC_14                         (0x00004000UL)
#define NFC_ECC_STAT_ERRSEC_15                         (0x00008000UL)
#define NFC_ECC_STAT_RESV_POS                          (16U)
#define NFC_ECC_STAT_RESV                              (0xFFFF0000UL)

/*  Bit definition for NFC_ECC_SYND0_0 register  */
#define NFC_ECC_SYND0_0_S1_POS                         (0U)
#define NFC_ECC_SYND0_0_S1                             (0x00001FFFUL)
#define NFC_ECC_SYND0_0_S2_POS                         (16U)
#define NFC_ECC_SYND0_0_S2                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND0_1 register  */
#define NFC_ECC_SYND0_1_S3_POS                         (0U)
#define NFC_ECC_SYND0_1_S3                             (0x00001FFFUL)
#define NFC_ECC_SYND0_1_S4_POS                         (16U)
#define NFC_ECC_SYND0_1_S4                             (0x1FFF0000UL)

