levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for NFC_ECC_SYND15_2 register  */
#define NFC_ECC_SYND15_2_S5_POS                        (0U)
#define NFC_ECC_SYND15_2_S5                            (0x00001FFFUL)
#define NFC_ECC_SYND15_2_S6_POS                        (16U)
#define NFC_ECC_SYND15_2_S6                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND15_3 register  */
#define NFC_ECC_SYND15_3_S7_POS                        (0U)
#define NFC_ECC_SYND15_3_S7                            (0x00001FFFUL)
#define NFC_ECC_SYND15_3_S8_POS                        (16U)
#define NFC_ECC_SYND15_3_S8                            (0x1FFF0000UL)

/*******************************************************************************
                Bit definition for Peripheral OTS
*******************************************************************************/
/*  Bit definition for OTS_CTL register  */
#define OTS_CTL_OTSST_POS                              (0U)
#define OTS_CTL_OTSST                                  (0x0001U)
#define OTS_CTL_OTSCK_POS                              (1U)
#define OTS_CTL_OTSCK                                  (0x0002U)
#define OTS_CTL_OTSIE_POS                              (2U)
#define OTS_CTL_OTSIE                                  (0x0004U)
#define OTS_CTL_TSSTP_POS                              (3U)
#define OTS_CTL_TSSTP                                  (0x0008U)

/*  Bit definition for OTS_DR1 register  */
#define OTS_DR1                                        (0xFFFFU)

/*  Bit definition for OTS_DR2 register  */
#define OTS_DR2                                        (0xFFFFU)

/*  Bit definition for OTS_ECR register  */
#define OTS_ECR                                        (0xFFFFU)

/*  Bit definition for OTS_LPR register  */
#define OTS_LPR_TSOFS_POS                              (0U)
#define OTS_LPR_TSOFS                                  (0x000000FFUL)
#define OTS_LPR_TSOFS_0                                (0x00000001UL)
#define OTS_LPR_TSOFS_1                                (0x00000002UL)
#define OTS_LPR_TSOFS_2                                (0x00000004UL)
#define OTS_LPR_TSOFS_3                                (0x00000008UL)
#define OTS_LPR_TSOFS_4                                (0x00000010UL)
#define OTS_LPR_TSOFS_5                                (0x00000020UL)
#define OTS_LPR_TSOFS_6                                (0x00000040UL)
#define OTS_LPR_TSOFS_7                                (0x00000080UL)
#define OTS_LPR_TSSLP_POS                              (8U)
#define OTS_LPR_TSSLP                                  (0xFFFFFF00UL)
#define OTS_LPR_TSSLP_0                                (0x00000100UL)
#define OTS_LPR_TSSLP_1                                (0x00000200UL)
#define OTS_LPR_TSSLP_2                                (0x00000400UL)
#define OTS_LPR_TSSLP_3                                (0x00000800UL)
#define OTS_LPR_TSSLP_4                                (0x00001000UL)
#define OTS_LPR_TSSLP_5                                (0x00002000UL)
#define OTS_LPR_TSSLP_6                                (0x00004000UL)
#define OTS_LPR_TSSLP_7                                (0x00008000UL)
#define OTS_LPR_TSSLP_8                                (0x00010000UL)
#define OTS_LPR_TSSLP_9                                (0x00020000UL)
#define OTS_LPR_TSSLP_10                               (0x00040000UL)
#define OTS_LPR_TSSLP_11                               (0x00080000UL)
#define OTS_LPR_TSSLP_12                               (0x00100000UL)
#define OTS_LPR_TSSLP_13                               (0x00200000UL)
#define OTS_LPR_TSSLP_14                               (0x00400000UL)
#define OTS_LPR_TSSLP_15                               (0x00800000UL)
#define OTS_LPR_TSSLP_16                               (0x01000000UL)
#define OTS_LPR_TSSLP_17                               (0x02000000UL)
#define OTS_LPR_TSSLP_18                               (0x04000000UL)
#define OTS_LPR_TSSLP_19                               (0x08000000UL)
#define OTS_LPR_TSSLP_20                               (0x10000000UL)
#define OTS_LPR_TSSLP_21                               (0x20000000UL)
#define OTS_LPR_TSSLP_22                               (0x40000000UL)
#define OTS_LPR_TSSLP_23                               (0x80000000UL)

/*******************************************************************************
                Bit definition for Peripheral PERIC
*******************************************************************************/
/*  Bit definition for PERIC_USB_SYCTLREG register  */
#define PERIC_USB_SYCTLREG_USBFS_DFB_POS               (0U)
#define PERIC_USB_SYCTLREG_USBFS_DFB                   (0x00000001UL)
#define PERIC_USB_SYCTLREG_USBFS_SOFEN_POS             (1U)
#define PERIC_USB_SYCTLREG_USBFS_SOFEN                 (0x00000002UL)
#define PERIC_USB_SYCTLREG_USBHS_DFB_POS               (8U)
#define PERIC_USB_SYCTLREG_USBHS_DFB                   (0x00000100UL)
#define PERIC_USB_SYCTLREG_USBHS_SOFEN_POS             (9U)
#define PERIC_USB_SYCTLREG_USBHS_SOFEN                 (0x00000200UL)
#define PERIC_USB_SYCTLREG_USBHS_FSPHYE_POS            (10U)
#define PERIC_USB_SYCTLREG_USBHS_FSPHYE                (0x00000400UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_POS               (16U)
#define PERIC_USB_SYCTLREG_USBFS_NFS                   (0x00030000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_0                 (0x00010000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_1                 (0x00020000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFE_POS               (18U)
#define PERIC_USB_SYCTLREG_USBFS_NFE                   (0x00040000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFS_POS               (24U)
#define PERIC_USB_SYCTLREG_USBHS_NFS                   (0x03000000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFS_0                 (0x01000000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFS_1                 (0x02000000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFE_POS               (26U)
#define PERIC_USB_SYCTLREG_USBHS_NFE                   (0x04000000UL)

/*  Bit definition for PERIC_SDIOC_SYCTLREG register  */
#define PERIC_SDIOC_SYCTLREG_SELMMC1_POS               (1U)
#define PERIC_SDIOC_SYCTLREG_SELMMC1                   (0x00000002UL)
#define PERIC_SDIOC_SYCTLREG_SELMMC2_POS               (3U)
#define PERIC_SDIOC_SYCTLREG_SELMMC2                   (0x00000008UL)

/*  Bit definition for PERIC_NFC_SYCTLREG register  */
#define PERIC_NFC_SYCTLREG_OPO                         (0x00000001UL)

