levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for PWC_PWRC2 register  */
#define PWC_PWRC2_DDAS_POS                             (0U)
#define PWC_PWRC2_DDAS                                 (0x0FU)
#define PWC_PWRC2_DVS_POS                              (4U)
#define PWC_PWRC2_DVS                                  (0x30U)
#define PWC_PWRC2_DVS_0                                (0x10U)
#define PWC_PWRC2_DVS_1                                (0x20U)

/*  Bit definition for PWC_PWRC3 register  */
#define PWC_PWRC3_DDAS                                 (0xFFU)

/*  Bit definition for PWC_PWRC4 register  */
#define PWC_PWRC4_VBATREFSEL_POS                       (0U)
#define PWC_PWRC4_VBATREFSEL                           (0x01U)
#define PWC_PWRC4_VBATME_POS                           (1U)
#define PWC_PWRC4_VBATME                               (0x02U)
#define PWC_PWRC4_VBATMON_POS                          (4U)
#define PWC_PWRC4_VBATMON                              (0x10U)
#define PWC_PWRC4_ADBUFS_POS                           (6U)
#define PWC_PWRC4_ADBUFS                               (0x40U)
#define PWC_PWRC4_ADBUFE_POS                           (7U)
#define PWC_PWRC4_ADBUFE                               (0x80U)

/*  Bit definition for PWC_PVDCR0 register  */
#define PWC_PVDCR0_EXVCCINEN_POS                       (0U)
#define PWC_PVDCR0_EXVCCINEN                           (0x01U)
#define PWC_PVDCR0_PVD1EN_POS                          (5U)
#define PWC_PVDCR0_PVD1EN                              (0x20U)
#define PWC_PVDCR0_PVD2EN_POS                          (6U)
#define PWC_PVDCR0_PVD2EN                              (0x40U)

/*  Bit definition for PWC_PVDCR1 register  */
#define PWC_PVDCR1_PVD1IRE_POS                         (0U)
#define PWC_PVDCR1_PVD1IRE                             (0x01U)
#define PWC_PVDCR1_PVD1IRS_POS                         (1U)
#define PWC_PVDCR1_PVD1IRS                             (0x02U)
#define PWC_PVDCR1_PVD1CMPOE_POS                       (2U)
#define PWC_PVDCR1_PVD1CMPOE                           (0x04U)
#define PWC_PVDCR1_PVD2IRE_POS                         (4U)
#define PWC_PVDCR1_PVD2IRE                             (0x10U)
#define PWC_PVDCR1_PVD2IRS_POS                         (5U)
#define PWC_PVDCR1_PVD2IRS                             (0x20U)
#define PWC_PVDCR1_PVD2CMPOE_POS                       (6U)
#define PWC_PVDCR1_PVD2CMPOE                           (0x40U)

/*  Bit definition for PWC_PVDFCR register  */
#define PWC_PVDFCR_PVD1NFDIS_POS                       (0U)
#define PWC_PVDFCR_PVD1NFDIS                           (0x01U)
#define PWC_PVDFCR_PVD1NFCKS_POS                       (1U)
#define PWC_PVDFCR_PVD1NFCKS                           (0x06U)
#define PWC_PVDFCR_PVD1NFCKS_0                         (0x02U)
#define PWC_PVDFCR_PVD1NFCKS_1                         (0x04U)
#define PWC_PVDFCR_PVD2NFDIS_POS                       (4U)
#define PWC_PVDFCR_PVD2NFDIS                           (0x10U)
#define PWC_PVDFCR_PVD2NFCKS_POS                       (5U)
#define PWC_PVDFCR_PVD2NFCKS                           (0x60U)
#define PWC_PVDFCR_PVD2NFCKS_0                         (0x20U)
#define PWC_PVDFCR_PVD2NFCKS_1                         (0x40U)

/*  Bit definition for PWC_PVDLCR register  */
#define PWC_PVDLCR_PVD1LVL_POS                         (0U)
#define PWC_PVDLCR_PVD1LVL                             (0x07U)
#define PWC_PVDLCR_PVD1LVL_0                           (0x01U)
#define PWC_PVDLCR_PVD1LVL_1                           (0x02U)
#define PWC_PVDLCR_PVD1LVL_2                           (0x04U)
#define PWC_PVDLCR_PVD2LVL_POS                         (4U)
#define PWC_PVDLCR_PVD2LVL                             (0x70U)
#define PWC_PVDLCR_PVD2LVL_0                           (0x10U)
#define PWC_PVDLCR_PVD2LVL_1                           (0x20U)
#define PWC_PVDLCR_PVD2LVL_2                           (0x40U)

/*  Bit definition for PWC_PDWKE0 register  */
#define PWC_PDWKE0_WKE0_0_POS                          (0U)
#define PWC_PDWKE0_WKE0_0                              (0x01U)
#define PWC_PDWKE0_WKE0_1_POS                          (1U)
#define PWC_PDWKE0_WKE0_1                              (0x02U)
#define PWC_PDWKE0_WKE0_2_POS                          (2U)
#define PWC_PDWKE0_WKE0_2                              (0x04U)
#define PWC_PDWKE0_WKE0_3_POS                          (3U)
#define PWC_PDWKE0_WKE0_3                              (0x08U)
#define PWC_PDWKE0_WKE1_0_POS                          (4U)
#define PWC_PDWKE0_WKE1_0                              (0x10U)
#define PWC_PDWKE0_WKE1_1_POS                          (5U)
#define PWC_PDWKE0_WKE1_1                              (0x20U)
#define PWC_PDWKE0_WKE1_2_POS                          (6U)
#define PWC_PDWKE0_WKE1_2                              (0x40U)
#define PWC_PDWKE0_WKE1_3_POS                          (7U)
#define PWC_PDWKE0_WKE1_3                              (0x80U)

/*  Bit definition for PWC_PDWKE1 register  */
#define PWC_PDWKE1_WKE2_0_POS                          (0U)
#define PWC_PDWKE1_WKE2_0                              (0x01U)
#define PWC_PDWKE1_WKE2_1_POS                          (1U)
#define PWC_PDWKE1_WKE2_1                              (0x02U)
#define PWC_PDWKE1_WKE2_2_POS                          (2U)
#define PWC_PDWKE1_WKE2_2                              (0x04U)
#define PWC_PDWKE1_WKE2_3_POS                          (3U)
#define PWC_PDWKE1_WKE2_3                              (0x08U)
#define PWC_PDWKE1_WKE3_0_POS                          (4U)
#define PWC_PDWKE1_WKE3_0                              (0x10U)
#define PWC_PDWKE1_WKE3_1_POS                          (5U)
#define PWC_PDWKE1_WKE3_1                              (0x20U)
#define PWC_PDWKE1_WKE3_2_POS                          (6U)
#define PWC_PDWKE1_WKE3_2                              (0x40U)
#define PWC_PDWKE1_WKE3_3_POS                          (7U)
#define PWC_PDWKE1_WKE3_3                              (0x80U)

/*  Bit definition for PWC_PDWKE2 register  */
#define PWC_PDWKE2_VD1WKE_POS                          (0U)
#define PWC_PDWKE2_VD1WKE                              (0x01U)
#define PWC_PDWKE2_VD2WKE_POS                          (1U)
#define PWC_PDWKE2_VD2WKE                              (0x02U)
#define PWC_PDWKE2_RTCPRDWKE_POS                       (4U)
#define PWC_PDWKE2_RTCPRDWKE                           (0x10U)
#define PWC_PDWKE2_RTCALMWKE_POS                       (5U)
#define PWC_PDWKE2_RTCALMWKE                           (0x20U)
#define PWC_PDWKE2_XTAL32ERWKE_POS                     (6U)
#define PWC_PDWKE2_XTAL32ERWKE                         (0x40U)
#define PWC_PDWKE2_WKTMWKE_POS                         (7U)
#define PWC_PDWKE2_WKTMWKE                             (0x80U)

/*  Bit definition for PWC_PDWKES register  */
#define PWC_PDWKES_WK0EGS_POS                          (0U)
#define PWC_PDWKES_WK0EGS                              (0x01U)
#define PWC_PDWKES_WK1EGS_POS                          (1U)
#define PWC_PDWKES_WK1EGS                              (0x02U)
#define PWC_PDWKES_WK2EGS_POS                          (2U)
#define PWC_PDWKES_WK2EGS                              (0x04U)
#define PWC_PDWKES_WK3EGS_POS                          (3U)
#define PWC_PDWKES_WK3EGS                              (0x08U)
#define PWC_PDWKES_VD1EGS_POS                          (4U)
#define PWC_PDWKES_VD1EGS                              (0x10U)
#define PWC_PDWKES_VD2EGS_POS                          (5U)
#define PWC_PDWKES_VD2EGS                              (0x20U)

