levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for RTC_DAY register  */
#define RTC_DAY_DAYU_POS                               (0U)
#define RTC_DAY_DAYU                                   (0x0FU)
#define RTC_DAY_DAYD_POS                               (4U)
#define RTC_DAY_DAYD                                   (0x30U)

/*  Bit definition for RTC_MON register  */
#define RTC_MON_MON                                    (0x1FU)

/*  Bit definition for RTC_YEAR register  */
#define RTC_YEAR_YEARU_POS                             (0U)
#define RTC_YEAR_YEARU                                 (0x0FU)
#define RTC_YEAR_YEARD_POS                             (4U)
#define RTC_YEAR_YEARD                                 (0xF0U)

/*  Bit definition for RTC_ALMMIN register  */
#define RTC_ALMMIN_ALMMINU_POS                         (0U)
#define RTC_ALMMIN_ALMMINU                             (0x0FU)
#define RTC_ALMMIN_ALMMIND_POS                         (4U)
#define RTC_ALMMIN_ALMMIND                             (0x70U)

/*  Bit definition for RTC_ALMHOUR register  */
#define RTC_ALMHOUR_ALMHOURU_POS                       (0U)
#define RTC_ALMHOUR_ALMHOURU                           (0x0FU)
#define RTC_ALMHOUR_ALMHOURU_0                         (0x01U)
#define RTC_ALMHOUR_ALMHOURU_1                         (0x02U)
#define RTC_ALMHOUR_ALMHOURU_2                         (0x04U)
#define RTC_ALMHOUR_ALMHOURU_3                         (0x08U)
#define RTC_ALMHOUR_ALMHOURD_POS                       (4U)
#define RTC_ALMHOUR_ALMHOURD                           (0x30U)
#define RTC_ALMHOUR_ALMHOURD_0                         (0x10U)
#define RTC_ALMHOUR_ALMHOURD_1                         (0x20U)

/*  Bit definition for RTC_ALMWEEK register  */
#define RTC_ALMWEEK_ALMWEEK                            (0x7FU)

/*  Bit definition for RTC_ERRCRH register  */
#define RTC_ERRCRH_COMP8_POS                           (0U)
#define RTC_ERRCRH_COMP8                               (0x01U)
#define RTC_ERRCRH_COMPEN_POS                          (7U)
#define RTC_ERRCRH_COMPEN                              (0x80U)

/*  Bit definition for RTC_ERRCRL register  */
#define RTC_ERRCRL_COMP                                (0xFFU)

/*  Bit definition for RTC_TPCR0 register  */
#define RTC_TPCR0_TPCT0_POS                            (0U)
#define RTC_TPCR0_TPCT0                                (0x03U)
#define RTC_TPCR0_TPCT0_0                              (0x01U)
#define RTC_TPCR0_TPCT0_1                              (0x02U)
#define RTC_TPCR0_TPNF0_POS                            (2U)
#define RTC_TPCR0_TPNF0                                (0x0CU)
#define RTC_TPCR0_TPNF0_0                              (0x04U)
#define RTC_TPCR0_TPNF0_1                              (0x08U)
#define RTC_TPCR0_TPRSTE0_POS                          (4U)
#define RTC_TPCR0_TPRSTE0                              (0x10U)
#define RTC_TPCR0_TPIE0_POS                            (5U)
#define RTC_TPCR0_TPIE0                                (0x20U)
#define RTC_TPCR0_TSTPE0_POS                           (6U)
#define RTC_TPCR0_TSTPE0                               (0x40U)
#define RTC_TPCR0_TPEN0_POS                            (7U)
#define RTC_TPCR0_TPEN0                                (0x80U)

/*  Bit definition for RTC_TPCR1 register  */
#define RTC_TPCR1_TPCT1_POS                            (0U)
#define RTC_TPCR1_TPCT1                                (0x03U)
#define RTC_TPCR1_TPCT1_0                              (0x01U)
#define RTC_TPCR1_TPCT1_1                              (0x02U)
#define RTC_TPCR1_TPNF1_POS                            (2U)
#define RTC_TPCR1_TPNF1                                (0x0CU)
#define RTC_TPCR1_TPNF1_0                              (0x04U)
#define RTC_TPCR1_TPNF1_1                              (0x08U)
#define RTC_TPCR1_TPRSTE1_POS                          (4U)
#define RTC_TPCR1_TPRSTE1                              (0x10U)
#define RTC_TPCR1_TPIE1_POS                            (5U)
#define RTC_TPCR1_TPIE1                                (0x20U)
#define RTC_TPCR1_TSTPE1_POS                           (6U)
#define RTC_TPCR1_TSTPE1                               (0x40U)
#define RTC_TPCR1_TPEN1_POS                            (7U)
#define RTC_TPCR1_TPEN1                                (0x80U)

/*  Bit definition for RTC_TPSR register  */
#define RTC_TPSR_TPF0_POS                              (0U)
#define RTC_TPSR_TPF0                                  (0x01U)
#define RTC_TPSR_TPF1_POS                              (1U)
#define RTC_TPSR_TPF1                                  (0x02U)
#define RTC_TPSR_TPOVF_POS                             (2U)
#define RTC_TPSR_TPOVF                                 (0x04U)

/*  Bit definition for RTC_SECTP register  */
#define RTC_SECTP_SECTPU_POS                           (0U)
#define RTC_SECTP_SECTPU                               (0x0FU)
#define RTC_SECTP_SECTPD_POS                           (4U)
#define RTC_SECTP_SECTPD                               (0x70U)

/*  Bit definition for RTC_MINTP register  */
#define RTC_MINTP_MINTPU_POS                           (0U)
#define RTC_MINTP_MINTPU                               (0x0FU)
#define RTC_MINTP_MINTPD_POS                           (4U)
#define RTC_MINTP_MINTPD                               (0x70U)

/*  Bit definition for RTC_HOURTP register  */
#define RTC_HOURTP_HOURTPU_POS                         (0U)
#define RTC_HOURTP_HOURTPU                             (0x0FU)
#define RTC_HOURTP_HOURTPU_0                           (0x01U)
#define RTC_HOURTP_HOURTPU_1                           (0x02U)
#define RTC_HOURTP_HOURTPU_2                           (0x04U)
#define RTC_HOURTP_HOURTPU_3                           (0x08U)
#define RTC_HOURTP_HOURTPD_POS                         (4U)
#define RTC_HOURTP_HOURTPD                             (0x30U)
#define RTC_HOURTP_HOURTPD_0                           (0x10U)
#define RTC_HOURTP_HOURTPD_1                           (0x20U)

/*  Bit definition for RTC_DAYTP register  */
#define RTC_DAYTP_DAYTPU_POS                           (0U)
#define RTC_DAYTP_DAYTPU                               (0x0FU)
#define RTC_DAYTP_DAYTPD_POS                           (4U)
#define RTC_DAYTP_DAYTPD                               (0x30U)

