levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for SPI_CFG2 register  */
#define SPI_CFG2_CPHA_POS                              (0U)
#define SPI_CFG2_CPHA                                  (0x00000001UL)
#define SPI_CFG2_CPOL_POS                              (1U)
#define SPI_CFG2_CPOL                                  (0x00000002UL)
#define SPI_CFG2_MBR_POS                               (2U)
#define SPI_CFG2_MBR                                   (0x0000001CUL)
#define SPI_CFG2_MBR_0                                 (0x00000004UL)
#define SPI_CFG2_MBR_1                                 (0x00000008UL)
#define SPI_CFG2_MBR_2                                 (0x00000010UL)
#define SPI_CFG2_SSA_POS                               (5U)
#define SPI_CFG2_SSA                                   (0x000000E0UL)
#define SPI_CFG2_SSA_0                                 (0x00000020UL)
#define SPI_CFG2_SSA_1                                 (0x00000040UL)
#define SPI_CFG2_SSA_2                                 (0x00000080UL)
#define SPI_CFG2_DSIZE_POS                             (8U)
#define SPI_CFG2_DSIZE                                 (0x00000F00UL)
#define SPI_CFG2_DSIZE_0                               (0x00000100UL)
#define SPI_CFG2_DSIZE_1                               (0x00000200UL)
#define SPI_CFG2_DSIZE_2                               (0x00000400UL)
#define SPI_CFG2_DSIZE_3                               (0x00000800UL)
#define SPI_CFG2_LSBF_POS                              (12U)
#define SPI_CFG2_LSBF                                  (0x00001000UL)
#define SPI_CFG2_MIDIE_POS                             (13U)
#define SPI_CFG2_MIDIE                                 (0x00002000UL)
#define SPI_CFG2_MSSDLE_POS                            (14U)
#define SPI_CFG2_MSSDLE                                (0x00004000UL)
#define SPI_CFG2_MSSIE_POS                             (15U)
#define SPI_CFG2_MSSIE                                 (0x00008000UL)

/*******************************************************************************
                Bit definition for Peripheral SRAMC
*******************************************************************************/
/*  Bit definition for SRAMC_WTCR register  */
#define SRAMC_WTCR_SRAM123RWT_POS                      (0U)
#define SRAMC_WTCR_SRAM123RWT                          (0x00000007UL)
#define SRAMC_WTCR_SRAM123RWT_0                        (0x00000001UL)
#define SRAMC_WTCR_SRAM123RWT_1                        (0x00000002UL)
#define SRAMC_WTCR_SRAM123RWT_2                        (0x00000004UL)
#define SRAMC_WTCR_SRAM123WWT_POS                      (4U)
#define SRAMC_WTCR_SRAM123WWT                          (0x00000070UL)
#define SRAMC_WTCR_SRAM123WWT_0                        (0x00000010UL)
#define SRAMC_WTCR_SRAM123WWT_1                        (0x00000020UL)
#define SRAMC_WTCR_SRAM123WWT_2                        (0x00000040UL)
#define SRAMC_WTCR_SRAM4RWT_POS                        (8U)
#define SRAMC_WTCR_SRAM4RWT                            (0x00000700UL)
#define SRAMC_WTCR_SRAM4RWT_0                          (0x00000100UL)
#define SRAMC_WTCR_SRAM4RWT_1                          (0x00000200UL)
#define SRAMC_WTCR_SRAM4RWT_2                          (0x00000400UL)
#define SRAMC_WTCR_SRAM4WWT_POS                        (12U)
#define SRAMC_WTCR_SRAM4WWT                            (0x00007000UL)
#define SRAMC_WTCR_SRAM4WWT_0                          (0x00001000UL)
#define SRAMC_WTCR_SRAM4WWT_1                          (0x00002000UL)
#define SRAMC_WTCR_SRAM4WWT_2                          (0x00004000UL)
#define SRAMC_WTCR_SRAMHRWT_POS                        (16U)
#define SRAMC_WTCR_SRAMHRWT                            (0x00070000UL)
#define SRAMC_WTCR_SRAMHRWT_0                          (0x00010000UL)
#define SRAMC_WTCR_SRAMHRWT_1                          (0x00020000UL)
#define SRAMC_WTCR_SRAMHRWT_2                          (0x00040000UL)
#define SRAMC_WTCR_SRAMHWWT_POS                        (20U)
#define SRAMC_WTCR_SRAMHWWT                            (0x00700000UL)
#define SRAMC_WTCR_SRAMHWWT_0                          (0x00100000UL)
#define SRAMC_WTCR_SRAMHWWT_1                          (0x00200000UL)
#define SRAMC_WTCR_SRAMHWWT_2                          (0x00400000UL)
#define SRAMC_WTCR_SRAMBRWT_POS                        (24U)
#define SRAMC_WTCR_SRAMBRWT                            (0x07000000UL)
#define SRAMC_WTCR_SRAMBRWT_0                          (0x01000000UL)
#define SRAMC_WTCR_SRAMBRWT_1                          (0x02000000UL)
#define SRAMC_WTCR_SRAMBRWT_2                          (0x04000000UL)
#define SRAMC_WTCR_SRAMBWWT_POS                        (28U)
#define SRAMC_WTCR_SRAMBWWT                            (0x70000000UL)
#define SRAMC_WTCR_SRAMBWWT_0                          (0x10000000UL)
#define SRAMC_WTCR_SRAMBWWT_1                          (0x20000000UL)
#define SRAMC_WTCR_SRAMBWWT_2                          (0x40000000UL)

/*  Bit definition for SRAMC_WTPR register  */
#define SRAMC_WTPR_WTPRC_POS                           (0U)
#define SRAMC_WTPR_WTPRC                               (0x00000001UL)
#define SRAMC_WTPR_WTPRKW_POS                          (1U)
#define SRAMC_WTPR_WTPRKW                              (0x000000FEUL)
#define SRAMC_WTPR_WTPRKW_0                            (0x00000002UL)
#define SRAMC_WTPR_WTPRKW_1                            (0x00000004UL)
#define SRAMC_WTPR_WTPRKW_2                            (0x00000008UL)
#define SRAMC_WTPR_WTPRKW_3                            (0x00000010UL)
#define SRAMC_WTPR_WTPRKW_4                            (0x00000020UL)
#define SRAMC_WTPR_WTPRKW_5                            (0x00000040UL)
#define SRAMC_WTPR_WTPRKW_6                            (0x00000080UL)

/*  Bit definition for SRAMC_CKCR register  */
#define SRAMC_CKCR_PYOAD_POS                           (0U)
#define SRAMC_CKCR_PYOAD                               (0x00000001UL)
#define SRAMC_CKCR_ECCOAD_POS                          (16U)
#define SRAMC_CKCR_ECCOAD                              (0x00010000UL)
#define SRAMC_CKCR_BECCOAD_POS                         (17U)
#define SRAMC_CKCR_BECCOAD                             (0x00020000UL)
#define SRAMC_CKCR_ECCMOD_POS                          (24U)
#define SRAMC_CKCR_ECCMOD                              (0x03000000UL)
#define SRAMC_CKCR_ECCMOD_0                            (0x01000000UL)
#define SRAMC_CKCR_ECCMOD_1                            (0x02000000UL)
#define SRAMC_CKCR_BECCMOD_POS                         (26U)
#define SRAMC_CKCR_BECCMOD                             (0x0C000000UL)
#define SRAMC_CKCR_BECCMOD_0                           (0x04000000UL)
#define SRAMC_CKCR_BECCMOD_1                           (0x08000000UL)

/*  Bit definition for SRAMC_CKPR register  */
#define SRAMC_CKPR_CKPRC_POS                           (0U)
#define SRAMC_CKPR_CKPRC                               (0x00000001UL)
#define SRAMC_CKPR_CKPRKW_POS                          (1U)
#define SRAMC_CKPR_CKPRKW                              (0x000000FEUL)
#define SRAMC_CKPR_CKPRKW_0                            (0x00000002UL)
#define SRAMC_CKPR_CKPRKW_1                            (0x00000004UL)
#define SRAMC_CKPR_CKPRKW_2                            (0x00000008UL)
#define SRAMC_CKPR_CKPRKW_3                            (0x00000010UL)
#define SRAMC_CKPR_CKPRKW_4                            (0x00000020UL)
#define SRAMC_CKPR_CKPRKW_5                            (0x00000040UL)
#define SRAMC_CKPR_CKPRKW_6                            (0x00000080UL)

/*  Bit definition for SRAMC_CKSR register  */
#define SRAMC_CKSR_SRAM1_PYERR_POS                     (0U)
#define SRAMC_CKSR_SRAM1_PYERR                         (0x00000001UL)
#define SRAMC_CKSR_SRAM2_PYERR_POS                     (1U)
#define SRAMC_CKSR_SRAM2_PYERR                         (0x00000002UL)
#define SRAMC_CKSR_SRAM3_PYERR_POS                     (2U)
#define SRAMC_CKSR_SRAM3_PYERR                         (0x00000004UL)
#define SRAMC_CKSR_SRAMH_PYERR_POS                     (3U)
#define SRAMC_CKSR_SRAMH_PYERR                         (0x00000008UL)
#define SRAMC_CKSR_SRAM4_1ERR_POS                      (4U)
#define SRAMC_CKSR_SRAM4_1ERR                          (0x00000010UL)
#define SRAMC_CKSR_SRAM4_2ERR_POS                      (5U)
#define SRAMC_CKSR_SRAM4_2ERR                          (0x00000020UL)
#define SRAMC_CKSR_SRAMB_1ERR_POS                      (6U)
#define SRAMC_CKSR_SRAMB_1ERR                          (0x00000040UL)
#define SRAMC_CKSR_SRAMB_2ERR_POS                      (7U)
#define SRAMC_CKSR_SRAMB_2ERR                          (0x00000080UL)
#define SRAMC_CKSR_CACHE_PYERR_POS                     (8U)
#define SRAMC_CKSR_CACHE_PYERR                         (0x00000100UL)

