levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USART_CR2 register  */
#define USART_CR2_MPE_POS                              (0U)
#define USART_CR2_MPE                                  (0x00000001UL)
#define USART_CR2_WKUPIE_POS                           (1U)
#define USART_CR2_WKUPIE                               (0x00000002UL)
#define USART_CR2_BEIE_POS                             (2U)
#define USART_CR2_BEIE                                 (0x00000004UL)
#define USART_CR2_BEE_POS                              (3U)
#define USART_CR2_BEE                                  (0x00000008UL)
#define USART_CR2_LBDIE_POS                            (4U)
#define USART_CR2_LBDIE                                (0x00000010UL)
#define USART_CR2_LBDL_POS                             (5U)
#define USART_CR2_LBDL                                 (0x00000020UL)
#define USART_CR2_SBKL_POS                             (6U)
#define USART_CR2_SBKL                                 (0x000000C0UL)
#define USART_CR2_SBKL_0                               (0x00000040UL)
#define USART_CR2_SBKL_1                               (0x00000080UL)
#define USART_CR2_WKUPE_POS                            (8U)
#define USART_CR2_WKUPE                                (0x00000100UL)
#define USART_CR2_CLKC_POS                             (11U)
#define USART_CR2_CLKC                                 (0x00001800UL)
#define USART_CR2_CLKC_0                               (0x00000800UL)
#define USART_CR2_CLKC_1                               (0x00001000UL)
#define USART_CR2_STOP_POS                             (13U)
#define USART_CR2_STOP                                 (0x00002000UL)
#define USART_CR2_LINEN_POS                            (14U)
#define USART_CR2_LINEN                                (0x00004000UL)
#define USART_CR2_SBK_POS                              (16U)
#define USART_CR2_SBK                                  (0x00010000UL)
#define USART_CR2_SBKM_POS                             (17U)
#define USART_CR2_SBKM                                 (0x00020000UL)

/*  Bit definition for USART_CR3 register  */
#define USART_CR3_HDSEL_POS                            (3U)
#define USART_CR3_HDSEL                                (0x00000008UL)
#define USART_CR3_LOOP_POS                             (4U)
#define USART_CR3_LOOP                                 (0x00000010UL)
#define USART_CR3_SCEN_POS                             (5U)
#define USART_CR3_SCEN                                 (0x00000020UL)
#define USART_CR3_RTSE_POS                             (8U)
#define USART_CR3_RTSE                                 (0x00000100UL)
#define USART_CR3_CTSE_POS                             (9U)
#define USART_CR3_CTSE                                 (0x00000200UL)
#define USART_CR3_BCN_POS                              (21U)
#define USART_CR3_BCN                                  (0x00E00000UL)
#define USART_CR3_BCN_0                                (0x00200000UL)
#define USART_CR3_BCN_1                                (0x00400000UL)
#define USART_CR3_BCN_2                                (0x00800000UL)

/*  Bit definition for USART_PR register  */
#define USART_PR_PSC_POS                               (0U)
#define USART_PR_PSC                                   (0x00000003UL)
#define USART_PR_PSC_0                                 (0x00000001UL)
#define USART_PR_PSC_1                                 (0x00000002UL)
#define USART_PR_LBMPSC_POS                            (2U)
#define USART_PR_LBMPSC                                (0x0000000CUL)
#define USART_PR_LBMPSC_0                              (0x00000004UL)
#define USART_PR_LBMPSC_1                              (0x00000008UL)

/*  Bit definition for USART_LBMC register  */
#define USART_LBMC_LBMC                                (0x0000FFFFUL)

/*******************************************************************************
                Bit definition for Peripheral USBFS
*******************************************************************************/
/*  Bit definition for USBFS_GOTGCTL register  */
#define USBFS_GOTGCTL_SESREQSCS_POS                    (0U)
#define USBFS_GOTGCTL_SESREQSCS                        (0x00000001UL)
#define USBFS_GOTGCTL_SESREQ_POS                       (1U)
#define USBFS_GOTGCTL_SESREQ                           (0x00000002UL)
#define USBFS_GOTGCTL_VBVALIDOVEN_POS                  (2U)
#define USBFS_GOTGCTL_VBVALIDOVEN                      (0x00000004UL)
#define USBFS_GOTGCTL_VBVALIDOVVAL_POS                 (3U)
#define USBFS_GOTGCTL_VBVALIDOVVAL                     (0x00000008UL)
#define USBFS_GOTGCTL_AVALIDOVEN_POS                   (4U)
#define USBFS_GOTGCTL_AVALIDOVEN                       (0x00000010UL)
#define USBFS_GOTGCTL_AVALIDOVVAL_POS                  (5U)
#define USBFS_GOTGCTL_AVALIDOVVAL                      (0x00000020UL)
#define USBFS_GOTGCTL_BVALIDOVEN_POS                   (6U)
#define USBFS_GOTGCTL_BVALIDOVEN                       (0x00000040UL)
#define USBFS_GOTGCTL_BVALIDOVVAL_POS                  (7U)
#define USBFS_GOTGCTL_BVALIDOVVAL                      (0x00000080UL)
#define USBFS_GOTGCTL_HSTNEGSCS_POS                    (8U)
#define USBFS_GOTGCTL_HSTNEGSCS                        (0x00000100UL)
#define USBFS_GOTGCTL_HNPREQ_POS                       (9U)
#define USBFS_GOTGCTL_HNPREQ                           (0x00000200UL)
#define USBFS_GOTGCTL_HSTSETHNPEN_POS                  (10U)
#define USBFS_GOTGCTL_HSTSETHNPEN                      (0x00000400UL)
#define USBFS_GOTGCTL_DEVHNPEN_POS                     (11U)
#define USBFS_GOTGCTL_DEVHNPEN                         (0x00000800UL)
#define USBFS_GOTGCTL_EHEN_POS                         (12U)
#define USBFS_GOTGCTL_EHEN                             (0x00001000UL)
#define USBFS_GOTGCTL_DBNCEFLTRBYPASS_POS              (15U)
#define USBFS_GOTGCTL_DBNCEFLTRBYPASS                  (0x00008000UL)
#define USBFS_GOTGCTL_CONIDSTS_POS                     (16U)
#define USBFS_GOTGCTL_CONIDSTS                         (0x00010000UL)
#define USBFS_GOTGCTL_DBNCTIME_POS                     (17U)
#define USBFS_GOTGCTL_DBNCTIME                         (0x00020000UL)
#define USBFS_GOTGCTL_ASESVLD_POS                      (18U)
#define USBFS_GOTGCTL_ASESVLD                          (0x00040000UL)
#define USBFS_GOTGCTL_BSESVLD_POS                      (19U)
#define USBFS_GOTGCTL_BSESVLD                          (0x00080000UL)
#define USBFS_GOTGCTL_OTGVER_POS                       (20U)
#define USBFS_GOTGCTL_OTGVER                           (0x00100000UL)
#define USBFS_GOTGCTL_CURMOD_POS                       (21U)
#define USBFS_GOTGCTL_CURMOD                           (0x00200000UL)

