levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_GOTGINT register  */
#define USBFS_GOTGINT_SESENDDET_POS                    (2U)
#define USBFS_GOTGINT_SESENDDET                        (0x00000004UL)
#define USBFS_GOTGINT_SESREQSUCSTSCHNG_POS             (8U)
#define USBFS_GOTGINT_SESREQSUCSTSCHNG                 (0x00000100UL)
#define USBFS_GOTGINT_HSTNEGSUCSTSCHNG_POS             (9U)
#define USBFS_GOTGINT_HSTNEGSUCSTSCHNG                 (0x00000200UL)
#define USBFS_GOTGINT_HSTNEGDET_POS                    (17U)
#define USBFS_GOTGINT_HSTNEGDET                        (0x00020000UL)
#define USBFS_GOTGINT_ADEVTOUTCHG_POS                  (18U)
#define USBFS_GOTGINT_ADEVTOUTCHG                      (0x00040000UL)
#define USBFS_GOTGINT_DBNCEDONE_POS                    (19U)
#define USBFS_GOTGINT_DBNCEDONE                        (0x00080000UL)

/*  Bit definition for USBFS_GAHBCFG register  */
#define USBFS_GAHBCFG_GLBLINTRMSK_POS                  (0U)
#define USBFS_GAHBCFG_GLBLINTRMSK                      (0x00000001UL)
#define USBFS_GAHBCFG_HBSTLEN_POS                      (1U)
#define USBFS_GAHBCFG_HBSTLEN                          (0x0000001EUL)
#define USBFS_GAHBCFG_HBSTLEN_0                        (0x00000002UL)
#define USBFS_GAHBCFG_HBSTLEN_1                        (0x00000004UL)
#define USBFS_GAHBCFG_HBSTLEN_2                        (0x00000008UL)
#define USBFS_GAHBCFG_HBSTLEN_3                        (0x00000010UL)
#define USBFS_GAHBCFG_DMAEN_POS                        (5U)
#define USBFS_GAHBCFG_DMAEN                            (0x00000020UL)
#define USBFS_GAHBCFG_NPTXFEMPLVL_POS                  (7U)
#define USBFS_GAHBCFG_NPTXFEMPLVL                      (0x00000080UL)
#define USBFS_GAHBCFG_PTXFEMPLVL_POS                   (8U)
#define USBFS_GAHBCFG_PTXFEMPLVL                       (0x00000100UL)
#define USBFS_GAHBCFG_REMMEMSUPP_POS                   (21U)
#define USBFS_GAHBCFG_REMMEMSUPP                       (0x00200000UL)
#define USBFS_GAHBCFG_NOTIALLDMAWRIT_POS               (22U)
#define USBFS_GAHBCFG_NOTIALLDMAWRIT                   (0x00400000UL)
#define USBFS_GAHBCFG_AHBSINGLE_POS                    (23U)
#define USBFS_GAHBCFG_AHBSINGLE                        (0x00800000UL)

/*  Bit definition for USBFS_GUSBCFG register  */
#define USBFS_GUSBCFG_TOUTCAL_POS                      (0U)
#define USBFS_GUSBCFG_TOUTCAL                          (0x00000007UL)
#define USBFS_GUSBCFG_TOUTCAL_0                        (0x00000001UL)
#define USBFS_GUSBCFG_TOUTCAL_1                        (0x00000002UL)
#define USBFS_GUSBCFG_TOUTCAL_2                        (0x00000004UL)
#define USBFS_GUSBCFG_PHYIF_POS                        (3U)
#define USBFS_GUSBCFG_PHYIF                            (0x00000008UL)
#define USBFS_GUSBCFG_FSINTF_POS                       (5U)
#define USBFS_GUSBCFG_FSINTF                           (0x00000020UL)
#define USBFS_GUSBCFG_PHYSEL_POS                       (6U)
#define USBFS_GUSBCFG_PHYSEL                           (0x00000040UL)
#define USBFS_GUSBCFG_SRPCAP_POS                       (8U)
#define USBFS_GUSBCFG_SRPCAP                           (0x00000100UL)
#define USBFS_GUSBCFG_HNPCAP_POS                       (9U)
#define USBFS_GUSBCFG_HNPCAP                           (0x00000200UL)
#define USBFS_GUSBCFG_USBTRDTIM_POS                    (10U)
#define USBFS_GUSBCFG_USBTRDTIM                        (0x00003C00UL)
#define USBFS_GUSBCFG_USBTRDTIM_0                      (0x00000400UL)
#define USBFS_GUSBCFG_USBTRDTIM_1                      (0x00000800UL)
#define USBFS_GUSBCFG_USBTRDTIM_2                      (0x00001000UL)
#define USBFS_GUSBCFG_USBTRDTIM_3                      (0x00002000UL)
#define USBFS_GUSBCFG_TERMSELDLPULSE_POS               (22U)
#define USBFS_GUSBCFG_TERMSELDLPULSE                   (0x00400000UL)
#define USBFS_GUSBCFG_IC_USBCAP_POS                    (26U)
#define USBFS_GUSBCFG_IC_USBCAP                        (0x04000000UL)
#define USBFS_GUSBCFG_TXENDDELAY_POS                   (28U)
#define USBFS_GUSBCFG_TXENDDELAY                       (0x10000000UL)
#define USBFS_GUSBCFG_FORCEHSTMODE_POS                 (29U)
#define USBFS_GUSBCFG_FORCEHSTMODE                     (0x20000000UL)
#define USBFS_GUSBCFG_FORCEDEVMODE_POS                 (30U)
#define USBFS_GUSBCFG_FORCEDEVMODE                     (0x40000000UL)
#define USBFS_GUSBCFG_CORRUPTTXPKT_POS                 (31U)
#define USBFS_GUSBCFG_CORRUPTTXPKT                     (0x80000000UL)

/*  Bit definition for USBFS_GRSTCTL register  */
#define USBFS_GRSTCTL_CSFTRST_POS                      (0U)
#define USBFS_GRSTCTL_CSFTRST                          (0x00000001UL)
#define USBFS_GRSTCTL_PIUFSSFTRST_POS                  (1U)
#define USBFS_GRSTCTL_PIUFSSFTRST                      (0x00000002UL)
#define USBFS_GRSTCTL_FRMCNTRRST_POS                   (2U)
#define USBFS_GRSTCTL_FRMCNTRRST                       (0x00000004UL)
#define USBFS_GRSTCTL_RXFFLSH_POS                      (4U)
#define USBFS_GRSTCTL_RXFFLSH                          (0x00000010UL)
#define USBFS_GRSTCTL_TXFFLSH_POS                      (5U)
#define USBFS_GRSTCTL_TXFFLSH                          (0x00000020UL)
#define USBFS_GRSTCTL_TXFNUM_POS                       (6U)
#define USBFS_GRSTCTL_TXFNUM                           (0x000007C0UL)
#define USBFS_GRSTCTL_DMAREQ_POS                       (30U)
#define USBFS_GRSTCTL_DMAREQ                           (0x40000000UL)
#define USBFS_GRSTCTL_AHBIDLE_POS                      (31U)
#define USBFS_GRSTCTL_AHBIDLE                          (0x80000000UL)

/*  Bit definition for USBFS_GINTSTS register  */
#define USBFS_GINTSTS_CURMOD_POS                       (0U)
#define USBFS_GINTSTS_CURMOD                           (0x00000001UL)
#define USBFS_GINTSTS_MODEMIS_POS                      (1U)
#define USBFS_GINTSTS_MODEMIS                          (0x00000002UL)
#define USBFS_GINTSTS_OTGINT_POS                       (2U)
#define USBFS_GINTSTS_OTGINT                           (0x00000004UL)
#define USBFS_GINTSTS_SOF_POS                          (3U)
#define USBFS_GINTSTS_SOF                              (0x00000008UL)
#define USBFS_GINTSTS_RXFLVL_POS                       (4U)
#define USBFS_GINTSTS_RXFLVL                           (0x00000010UL)
#define USBFS_GINTSTS_NPTXFEMP_POS                     (5U)
#define USBFS_GINTSTS_NPTXFEMP                         (0x00000020UL)
#define USBFS_GINTSTS_GINNAKEFF_POS                    (6U)
#define USBFS_GINTSTS_GINNAKEFF                        (0x00000040UL)
#define USBFS_GINTSTS_GOUTNAKEFF_POS                   (7U)
#define USBFS_GINTSTS_GOUTNAKEFF                       (0x00000080UL)
#define USBFS_GINTSTS_ERLYSUSP_POS                     (10U)
#define USBFS_GINTSTS_ERLYSUSP                         (0x00000400UL)
#define USBFS_GINTSTS_USBSUSP_POS                      (11U)
#define USBFS_GINTSTS_USBSUSP                          (0x00000800UL)
#define USBFS_GINTSTS_USBRST_POS                       (12U)
#define USBFS_GINTSTS_USBRST                           (0x00001000UL)
#define USBFS_GINTSTS_ENUMDONE_POS                     (13U)
#define USBFS_GINTSTS_ENUMDONE                         (0x00002000UL)
#define USBFS_GINTSTS_ISOOUTDROP_POS                   (14U)
#define USBFS_GINTSTS_ISOOUTDROP                       (0x00004000UL)
#define USBFS_GINTSTS_EOPF_POS                         (15U)
#define USBFS_GINTSTS_EOPF                             (0x00008000UL)
#define USBFS_GINTSTS_EPMIS_POS                        (17U)
#define USBFS_GINTSTS_EPMIS                            (0x00020000UL)
#define USBFS_GINTSTS_IEPINT_POS                       (18U)
#define USBFS_GINTSTS_IEPINT                           (0x00040000UL)
#define USBFS_GINTSTS_OEPINT_POS                       (19U)
#define USBFS_GINTSTS_OEPINT                           (0x00080000UL)
#define USBFS_GINTSTS_INCOMPISOIN_POS                  (20U)
#define USBFS_GINTSTS_INCOMPISOIN                      (0x00100000UL)
#define USBFS_GINTSTS_INCOMPLP_POS                     (21U)
#define USBFS_GINTSTS_INCOMPLP                         (0x00200000UL)
#define USBFS_GINTSTS_FETSUSP_POS                      (22U)
#define USBFS_GINTSTS_FETSUSP                          (0x00400000UL)
#define USBFS_GINTSTS_RESETDET_POS                     (23U)
#define USBFS_GINTSTS_RESETDET                         (0x00800000UL)
#define USBFS_GINTSTS_PRTINT_POS                       (24U)
#define USBFS_GINTSTS_PRTINT                           (0x01000000UL)
#define USBFS_GINTSTS_HCHINT_POS                       (25U)
#define USBFS_GINTSTS_HCHINT                           (0x02000000UL)
#define USBFS_GINTSTS_PTXFEMP_POS                      (26U)
#define USBFS_GINTSTS_PTXFEMP                          (0x04000000UL)
#define USBFS_GINTSTS_LPM_INT_POS                      (27U)
#define USBFS_GINTSTS_LPM_INT                          (0x08000000UL)
#define USBFS_GINTSTS_CONIDSTSCHNG_POS                 (28U)
#define USBFS_GINTSTS_CONIDSTSCHNG                     (0x10000000UL)
#define USBFS_GINTSTS_DISCONNINT_POS                   (29U)
#define USBFS_GINTSTS_DISCONNINT                       (0x20000000UL)
#define USBFS_GINTSTS_SESSREQINT_POS                   (30U)
#define USBFS_GINTSTS_SESSREQINT                       (0x40000000UL)
#define USBFS_GINTSTS_WKUPINT_POS                      (31U)
#define USBFS_GINTSTS_WKUPINT                          (0x80000000UL)

/*  Bit definition for USBFS_GINTMSK register  */
#define USBFS_GINTMSK_MODEMISMSK_POS                   (1U)
#define USBFS_GINTMSK_MODEMISMSK                       (0x00000002UL)
#define USBFS_GINTMSK_OTGINTMSK_POS                    (2U)
#define USBFS_GINTMSK_OTGINTMSK                        (0x00000004UL)
#define USBFS_GINTMSK_SOFMSK_POS                       (3U)
#define USBFS_GINTMSK_SOFMSK                           (0x00000008UL)
#define USBFS_GINTMSK_RXFLVLMSK_POS                    (4U)
#define USBFS_GINTMSK_RXFLVLMSK                        (0x00000010UL)
#define USBFS_GINTMSK_NPTXFEMPMSK_POS                  (5U)
#define USBFS_GINTMSK_NPTXFEMPMSK                      (0x00000020UL)
#define USBFS_GINTMSK_GINNAKEFFMSK_POS                 (6U)
#define USBFS_GINTMSK_GINNAKEFFMSK                     (0x00000040UL)
#define USBFS_GINTMSK_GOUTNAKEFFMSK_POS                (7U)
#define USBFS_GINTMSK_GOUTNAKEFFMSK                    (0x00000080UL)
#define USBFS_GINTMSK_ERLYSUSPMSK_POS                  (10U)
#define USBFS_GINTMSK_ERLYSUSPMSK                      (0x00000400UL)
#define USBFS_GINTMSK_USBSUSPMSK_POS                   (11U)
#define USBFS_GINTMSK_USBSUSPMSK                       (0x00000800UL)
#define USBFS_GINTMSK_USBRSTMSK_POS                    (12U)
#define USBFS_GINTMSK_USBRSTMSK                        (0x00001000UL)
#define USBFS_GINTMSK_ENUMDONEMSK_POS                  (13U)
#define USBFS_GINTMSK_ENUMDONEMSK                      (0x00002000UL)
#define USBFS_GINTMSK_ISOOUTDROPMSK_POS                (14U)
#define USBFS_GINTMSK_ISOOUTDROPMSK                    (0x00004000UL)
#define USBFS_GINTMSK_EOPFMSK_POS                      (15U)
#define USBFS_GINTMSK_EOPFMSK                          (0x00008000UL)
#define USBFS_GINTMSK_EPMISMSK_POS                     (17U)
#define USBFS_GINTMSK_EPMISMSK                         (0x00020000UL)
#define USBFS_GINTMSK_IEPINTMSK_POS                    (18U)
#define USBFS_GINTMSK_IEPINTMSK                        (0x00040000UL)
#define USBFS_GINTMSK_OEPINTMSK_POS                    (19U)
#define USBFS_GINTMSK_OEPINTMSK                        (0x00080000UL)
#define USBFS_GINTMSK_INCOMPLPMSK_POS                  (21U)
#define USBFS_GINTMSK_INCOMPLPMSK                      (0x00200000UL)
#define USBFS_GINTMSK_FETSUSPMSK_POS                   (22U)
#define USBFS_GINTMSK_FETSUSPMSK                       (0x00400000UL)
#define USBFS_GINTMSK_RESETDETMSK_POS                  (23U)
#define USBFS_GINTMSK_RESETDETMSK                      (0x00800000UL)
#define USBFS_GINTMSK_PRTINTMSK_POS                    (24U)
#define USBFS_GINTMSK_PRTINTMSK                        (0x01000000UL)
#define USBFS_GINTMSK_HCHINTMSK_POS                    (25U)
#define USBFS_GINTMSK_HCHINTMSK                        (0x02000000UL)
#define USBFS_GINTMSK_PTXFEMPMSK_POS                   (26U)
#define USBFS_GINTMSK_PTXFEMPMSK                       (0x04000000UL)
#define USBFS_GINTMSK_LPM_INTMSK_POS                   (27U)
#define USBFS_GINTMSK_LPM_INTMSK                       (0x08000000UL)
#define USBFS_GINTMSK_CONIDSTSCHNGMSK_POS              (28U)
#define USBFS_GINTMSK_CONIDSTSCHNGMSK                  (0x10000000UL)
#define USBFS_GINTMSK_DISCONNINTMSK_POS                (29U)
#define USBFS_GINTMSK_DISCONNINTMSK                    (0x20000000UL)
#define USBFS_GINTMSK_SESSREQINTMSK_POS                (30U)
#define USBFS_GINTMSK_SESSREQINTMSK                    (0x40000000UL)
#define USBFS_GINTMSK_WKUPINTMSK_POS                   (31U)
#define USBFS_GINTMSK_WKUPINTMSK                       (0x80000000UL)

/*  Bit definition for USBFS_GRXSTSR register  */
#define USBFS_GRXSTSR_CHNUM_POS                        (0U)
#define USBFS_GRXSTSR_CHNUM                            (0x0000000FUL)
#define USBFS_GRXSTSR_BCNT_POS                         (4U)
#define USBFS_GRXSTSR_BCNT                             (0x00007FF0UL)
#define USBFS_GRXSTSR_DPID_POS                         (15U)
#define USBFS_GRXSTSR_DPID                             (0x00018000UL)
#define USBFS_GRXSTSR_DPID_0                           (0x00008000UL)
#define USBFS_GRXSTSR_DPID_1                           (0x00010000UL)
#define USBFS_GRXSTSR_PKTSTS_POS                       (17U)
#define USBFS_GRXSTSR_PKTSTS                           (0x001E0000UL)
#define USBFS_GRXSTSR_PKTSTS_0                         (0x00020000UL)
#define USBFS_GRXSTSR_PKTSTS_1                         (0x00040000UL)
#define USBFS_GRXSTSR_PKTSTS_2                         (0x00080000UL)
#define USBFS_GRXSTSR_PKTSTS_3                         (0x00100000UL)
#define USBFS_GRXSTSR_FN_POS                           (21U)
#define USBFS_GRXSTSR_FN                               (0x01E00000UL)

/*  Bit definition for USBFS_GRXSTSP register  */
#define USBFS_GRXSTSP_CHNUM_POS                        (0U)
#define USBFS_GRXSTSP_CHNUM                            (0x0000000FUL)
#define USBFS_GRXSTSP_BCNT_POS                         (4U)
#define USBFS_GRXSTSP_BCNT                             (0x00007FF0UL)
#define USBFS_GRXSTSP_DPID_POS                         (15U)
#define USBFS_GRXSTSP_DPID                             (0x00018000UL)
#define USBFS_GRXSTSP_DPID_0                           (0x00008000UL)
#define USBFS_GRXSTSP_DPID_1                           (0x00010000UL)
#define USBFS_GRXSTSP_PKTSTS_POS                       (17U)
#define USBFS_GRXSTSP_PKTSTS                           (0x001E0000UL)
#define USBFS_GRXSTSP_PKTSTS_0                         (0x00020000UL)
#define USBFS_GRXSTSP_PKTSTS_1                         (0x00040000UL)
#define USBFS_GRXSTSP_PKTSTS_2                         (0x00080000UL)
#define USBFS_GRXSTSP_PKTSTS_3                         (0x00100000UL)
#define USBFS_GRXSTSP_FN_POS                           (21U)
#define USBFS_GRXSTSP_FN                               (0x01E00000UL)

