levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_GRXFSIZ register  */
#define USBFS_GRXFSIZ_RXFDEP                           (0x000003FFUL)

/*  Bit definition for USBFS_GNPTXFSIZ register  */
#define USBFS_GNPTXFSIZ_NPTXFSTADDR_POS                (0U)
#define USBFS_GNPTXFSIZ_NPTXFSTADDR                    (0x000003FFUL)
#define USBFS_GNPTXFSIZ_NPTXFDEP_POS                   (16U)
#define USBFS_GNPTXFSIZ_NPTXFDEP                       (0x03FF0000UL)

/*  Bit definition for USBFS_GNPTXSTS register  */
#define USBFS_GNPTXSTS_NPTXFSPCAVAIL_POS               (0U)
#define USBFS_GNPTXSTS_NPTXFSPCAVAIL                   (0x0000FFFFUL)
#define USBFS_GNPTXSTS_NPTXQSPCAVAIL_POS               (16U)
#define USBFS_GNPTXSTS_NPTXQSPCAVAIL                   (0x00FF0000UL)
#define USBFS_GNPTXSTS_NPTXQTOP_POS                    (24U)
#define USBFS_GNPTXSTS_NPTXQTOP                        (0x7F000000UL)
#define USBFS_GNPTXSTS_NPTXQTOP_0                      (0x01000000UL)
#define USBFS_GNPTXSTS_NPTXQTOP_1                      (0x02000000UL)
#define USBFS_GNPTXSTS_NPTXQTOP_2                      (0x04000000UL)
#define USBFS_GNPTXSTS_NPTXQTOP_3                      (0x08000000UL)
#define USBFS_GNPTXSTS_NPTXQTOP_4                      (0x10000000UL)
#define USBFS_GNPTXSTS_NPTXQTOP_5                      (0x20000000UL)
#define USBFS_GNPTXSTS_NPTXQTOP_6                      (0x40000000UL)

/*  Bit definition for USBFS_GUID register  */
#define USBFS_GUID                                     (0xFFFFFFFFUL)

/*  Bit definition for USBFS_GLPMCFG register  */
#define USBFS_GLPMCFG_LPMCAP_POS                       (0U)
#define USBFS_GLPMCFG_LPMCAP                           (0x00000001UL)
#define USBFS_GLPMCFG_APPL1RES_POS                     (1U)
#define USBFS_GLPMCFG_APPL1RES                         (0x00000002UL)
#define USBFS_GLPMCFG_HIRD_POS                         (2U)
#define USBFS_GLPMCFG_HIRD                             (0x0000003CUL)
#define USBFS_GLPMCFG_HIRD_0                           (0x00000004UL)
#define USBFS_GLPMCFG_HIRD_1                           (0x00000008UL)
#define USBFS_GLPMCFG_HIRD_2                           (0x00000010UL)
#define USBFS_GLPMCFG_HIRD_3                           (0x00000020UL)
#define USBFS_GLPMCFG_BREMOTEWAKE_POS                  (6U)
#define USBFS_GLPMCFG_BREMOTEWAKE                      (0x00000040UL)
#define USBFS_GLPMCFG_ENBLSLPM_POS                     (7U)
#define USBFS_GLPMCFG_ENBLSLPM                         (0x00000080UL)
#define USBFS_GLPMCFG_HIRD_THRES_POS                   (8U)
#define USBFS_GLPMCFG_HIRD_THRES                       (0x00001F00UL)
#define USBFS_GLPMCFG_HIRD_THRES_0                     (0x00000100UL)
#define USBFS_GLPMCFG_HIRD_THRES_1                     (0x00000200UL)
#define USBFS_GLPMCFG_HIRD_THRES_2                     (0x00000400UL)
#define USBFS_GLPMCFG_HIRD_THRES_3                     (0x00000800UL)
#define USBFS_GLPMCFG_HIRD_THRES_4                     (0x00001000UL)
#define USBFS_GLPMCFG_COREL1RES_POS                    (13U)
#define USBFS_GLPMCFG_COREL1RES                        (0x00006000UL)
#define USBFS_GLPMCFG_COREL1RES_0                      (0x00002000UL)
#define USBFS_GLPMCFG_COREL1RES_1                      (0x00004000UL)
#define USBFS_GLPMCFG_SLPSTS_POS                       (15U)
#define USBFS_GLPMCFG_SLPSTS                           (0x00008000UL)
#define USBFS_GLPMCFG_L1RESUMEOK_POS                   (16U)
#define USBFS_GLPMCFG_L1RESUMEOK                       (0x00010000UL)
#define USBFS_GLPMCFG_LPM_CHNL_INDX_POS                (17U)
#define USBFS_GLPMCFG_LPM_CHNL_INDX                    (0x001E0000UL)
#define USBFS_GLPMCFG_LPM_RETRY_CNT_POS                (21U)
#define USBFS_GLPMCFG_LPM_RETRY_CNT                    (0x00E00000UL)
#define USBFS_GLPMCFG_SNDLPM_POS                       (24U)
#define USBFS_GLPMCFG_SNDLPM                           (0x01000000UL)
#define USBFS_GLPMCFG_LPM_RETRYCNT_STS_POS             (25U)
#define USBFS_GLPMCFG_LPM_RETRYCNT_STS                 (0x0E000000UL)
#define USBFS_GLPMCFG_LPM_ENBESL_POS                   (28U)
#define USBFS_GLPMCFG_LPM_ENBESL                       (0x10000000UL)
#define USBFS_GLPMCFG_LPM_RESTORESLPSTS_POS            (29U)
#define USBFS_GLPMCFG_LPM_RESTORESLPSTS                (0x20000000UL)

/*  Bit definition for USBFS_GDFIFOCFG register  */
#define USBFS_GDFIFOCFG_GDFIFOCFG_POS                  (0U)
#define USBFS_GDFIFOCFG_GDFIFOCFG                      (0x0000FFFFUL)
#define USBFS_GDFIFOCFG_EPINFOBASEADDR_POS             (16U)
#define USBFS_GDFIFOCFG_EPINFOBASEADDR                 (0xFFFF0000UL)

/*  Bit definition for USBFS_HPTXFSIZ register  */
#define USBFS_HPTXFSIZ_PTXFSTADDR_POS                  (0U)
#define USBFS_HPTXFSIZ_PTXFSTADDR                      (0x000007FFUL)
#define USBFS_HPTXFSIZ_PTXFSIZE_POS                    (16U)
#define USBFS_HPTXFSIZ_PTXFSIZE                        (0x03FF0000UL)

/*  Bit definition for USBFS_DIEPTXF1 register  */
#define USBFS_DIEPTXF1_INEPNTXFSTADDR_POS              (0U)
#define USBFS_DIEPTXF1_INEPNTXFSTADDR                  (0x000007FFUL)
#define USBFS_DIEPTXF1_INEPNTXFDEP_POS                 (16U)
#define USBFS_DIEPTXF1_INEPNTXFDEP                     (0x03FF0000UL)

/*  Bit definition for USBFS_DIEPTXF2 register  */
#define USBFS_DIEPTXF2_INEPNTXFSTADDR_POS              (0U)
#define USBFS_DIEPTXF2_INEPNTXFSTADDR                  (0x000007FFUL)
#define USBFS_DIEPTXF2_INEPNTXFDEP_POS                 (16U)
#define USBFS_DIEPTXF2_INEPNTXFDEP                     (0x03FF0000UL)

/*  Bit definition for USBFS_DIEPTXF3 register  */
#define USBFS_DIEPTXF3_INEPNTXFSTADDR_POS              (0U)
#define USBFS_DIEPTXF3_INEPNTXFSTADDR                  (0x00000FFFUL)
#define USBFS_DIEPTXF3_INEPNTXFDEP_POS                 (16U)
#define USBFS_DIEPTXF3_INEPNTXFDEP                     (0x03FF0000UL)

/*  Bit definition for USBFS_DIEPTXF4 register  */
#define USBFS_DIEPTXF4_INEPNTXFSTADDR_POS              (0U)
#define USBFS_DIEPTXF4_INEPNTXFSTADDR                  (0x00000FFFUL)
#define USBFS_DIEPTXF4_INEPNTXFDEP_POS                 (16U)
#define USBFS_DIEPTXF4_INEPNTXFDEP                     (0x03FF0000UL)

/*  Bit definition for USBFS_DIEPTXF5 register  */
#define USBFS_DIEPTXF5_INEPNTXFSTADDR_POS              (0U)
#define USBFS_DIEPTXF5_INEPNTXFSTADDR                  (0x00000FFFUL)
#define USBFS_DIEPTXF5_INEPNTXFDEP_POS                 (16U)
#define USBFS_DIEPTXF5_INEPNTXFDEP                     (0x03FF0000UL)

/*  Bit definition for USBFS_DIEPTXF6 register  */
#define USBFS_DIEPTXF6_INEPNTXFSTADDR_POS              (0U)
#define USBFS_DIEPTXF6_INEPNTXFSTADDR                  (0x00001FFFUL)
#define USBFS_DIEPTXF6_INEPNTXFDEP_POS                 (16U)
#define USBFS_DIEPTXF6_INEPNTXFDEP                     (0x03FF0000UL)

