levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DIEPTXF7 register  */
#define USBFS_DIEPTXF7_INEPNTXFSTADDR_POS              (0U)
#define USBFS_DIEPTXF7_INEPNTXFSTADDR                  (0x00001FFFUL)
#define USBFS_DIEPTXF7_INEPNTXFDEP_POS                 (16U)
#define USBFS_DIEPTXF7_INEPNTXFDEP                     (0x03FF0000UL)

/*  Bit definition for USBFS_DIEPTXF8 register  */
#define USBFS_DIEPTXF8_INEPNTXFSTADDR_POS              (0U)
#define USBFS_DIEPTXF8_INEPNTXFSTADDR                  (0x00001FFFUL)
#define USBFS_DIEPTXF8_INEPNTXFDEP_POS                 (16U)
#define USBFS_DIEPTXF8_INEPNTXFDEP                     (0x03FF0000UL)

/*  Bit definition for USBFS_DIEPTXF9 register  */
#define USBFS_DIEPTXF9_INEPNTXFSTADDR_POS              (0U)
#define USBFS_DIEPTXF9_INEPNTXFSTADDR                  (0x00001FFFUL)
#define USBFS_DIEPTXF9_INEPNTXFDEP_POS                 (16U)
#define USBFS_DIEPTXF9_INEPNTXFDEP                     (0x03FF0000UL)

/*  Bit definition for USBFS_DIEPTXF10 register  */
#define USBFS_DIEPTXF10_INEPNTXFSTADDR_POS             (0U)
#define USBFS_DIEPTXF10_INEPNTXFSTADDR                 (0x00001FFFUL)
#define USBFS_DIEPTXF10_INEPNTXFDEP_POS                (16U)
#define USBFS_DIEPTXF10_INEPNTXFDEP                    (0x03FF0000UL)

/*  Bit definition for USBFS_DIEPTXF11 register  */
#define USBFS_DIEPTXF11_INEPNTXFSTADDR_POS             (0U)
#define USBFS_DIEPTXF11_INEPNTXFSTADDR                 (0x00001FFFUL)
#define USBFS_DIEPTXF11_INEPNTXFDEP_POS                (16U)
#define USBFS_DIEPTXF11_INEPNTXFDEP                    (0x03FF0000UL)

/*  Bit definition for USBFS_DIEPTXF12 register  */
#define USBFS_DIEPTXF12_INEPNTXFSTADDR_POS             (0U)
#define USBFS_DIEPTXF12_INEPNTXFSTADDR                 (0x00003FFFUL)
#define USBFS_DIEPTXF12_INEPNTXFDEP_POS                (16U)
#define USBFS_DIEPTXF12_INEPNTXFDEP                    (0x03FF0000UL)

/*  Bit definition for USBFS_DIEPTXF13 register  */
#define USBFS_DIEPTXF13_INEPNTXFSTADDR_POS             (0U)
#define USBFS_DIEPTXF13_INEPNTXFSTADDR                 (0x00003FFFUL)
#define USBFS_DIEPTXF13_INEPNTXFDEP_POS                (16U)
#define USBFS_DIEPTXF13_INEPNTXFDEP                    (0x03FF0000UL)

/*  Bit definition for USBFS_DIEPTXF14 register  */
#define USBFS_DIEPTXF14_INEPNTXFSTADDR_POS             (0U)
#define USBFS_DIEPTXF14_INEPNTXFSTADDR                 (0x00003FFFUL)
#define USBFS_DIEPTXF14_INEPNTXFDEP_POS                (16U)
#define USBFS_DIEPTXF14_INEPNTXFDEP                    (0x03FF0000UL)

/*  Bit definition for USBFS_DIEPTXF15 register  */
#define USBFS_DIEPTXF15_INEPNTXFSTADDR_POS             (0U)
#define USBFS_DIEPTXF15_INEPNTXFSTADDR                 (0x00003FFFUL)
#define USBFS_DIEPTXF15_INEPNTXFDEP_POS                (16U)
#define USBFS_DIEPTXF15_INEPNTXFDEP                    (0x03FF0000UL)

/*  Bit definition for USBFS_HCFG register  */
#define USBFS_HCFG_FSLSPCLKSEL_POS                     (0U)
#define USBFS_HCFG_FSLSPCLKSEL                         (0x00000003UL)
#define USBFS_HCFG_FSLSPCLKSEL_0                       (0x00000001UL)
#define USBFS_HCFG_FSLSPCLKSEL_1                       (0x00000002UL)
#define USBFS_HCFG_FSLSSUPP_POS                        (2U)
#define USBFS_HCFG_FSLSSUPP                            (0x00000004UL)
#define USBFS_HCFG_ENA32KHZS_POS                       (7U)
#define USBFS_HCFG_ENA32KHZS                           (0x00000080UL)
#define USBFS_HCFG_RESVALID_POS                        (8U)
#define USBFS_HCFG_RESVALID                            (0x0000FF00UL)
#define USBFS_HCFG_MODECHTIMEN_POS                     (31U)
#define USBFS_HCFG_MODECHTIMEN                         (0x80000000UL)

/*  Bit definition for USBFS_HFIR register  */
#define USBFS_HFIR_FRINT_POS                           (0U)
#define USBFS_HFIR_FRINT                               (0x0000FFFFUL)
#define USBFS_HFIR_HFIRRLDCTRL_POS                     (16U)
#define USBFS_HFIR_HFIRRLDCTRL                         (0x00010000UL)

/*  Bit definition for USBFS_HFNUM register  */
#define USBFS_HFNUM_FRNUM_POS                          (0U)
#define USBFS_HFNUM_FRNUM                              (0x0000FFFFUL)
#define USBFS_HFNUM_FRREM_POS                          (16U)
#define USBFS_HFNUM_FRREM                              (0xFFFF0000UL)

/*  Bit definition for USBFS_HPTXSTS register  */
#define USBFS_HPTXSTS_PTXFSPCAVAIL_POS                 (0U)
#define USBFS_HPTXSTS_PTXFSPCAVAIL                     (0x0000FFFFUL)
#define USBFS_HPTXSTS_PTXQSPCAVAIL_POS                 (16U)
#define USBFS_HPTXSTS_PTXQSPCAVAIL                     (0x00FF0000UL)
#define USBFS_HPTXSTS_PTXQTOP_POS                      (24U)
#define USBFS_HPTXSTS_PTXQTOP                          (0xFF000000UL)
#define USBFS_HPTXSTS_PTXQTOP_0                        (0x01000000UL)
#define USBFS_HPTXSTS_PTXQTOP_1                        (0x02000000UL)
#define USBFS_HPTXSTS_PTXQTOP_2                        (0x04000000UL)
#define USBFS_HPTXSTS_PTXQTOP_3                        (0x08000000UL)
#define USBFS_HPTXSTS_PTXQTOP_4                        (0x10000000UL)
#define USBFS_HPTXSTS_PTXQTOP_5                        (0x20000000UL)
#define USBFS_HPTXSTS_PTXQTOP_6                        (0x40000000UL)
#define USBFS_HPTXSTS_PTXQTOP_7                        (0x80000000UL)

/*  Bit definition for USBFS_HAINT register  */
#define USBFS_HAINT_HAINT                              (0x0000FFFFUL)

/*  Bit definition for USBFS_HAINTMSK register  */
#define USBFS_HAINTMSK_HAINTMSK                        (0x0000FFFFUL)

/*  Bit definition for USBFS_HPRT register  */
#define USBFS_HPRT_PRTCONNSTS_POS                      (0U)
#define USBFS_HPRT_PRTCONNSTS                          (0x00000001UL)
#define USBFS_HPRT_PRTCONNDET_POS                      (1U)
#define USBFS_HPRT_PRTCONNDET                          (0x00000002UL)
#define USBFS_HPRT_PRTENA_POS                          (2U)
#define USBFS_HPRT_PRTENA                              (0x00000004UL)
#define USBFS_HPRT_PRTENCHNG_POS                       (3U)
#define USBFS_HPRT_PRTENCHNG                           (0x00000008UL)
#define USBFS_HPRT_PRTOVRCURRACT_POS                   (4U)
#define USBFS_HPRT_PRTOVRCURRACT                       (0x00000010UL)
#define USBFS_HPRT_PRTOVRCURRCHNG_POS                  (5U)
#define USBFS_HPRT_PRTOVRCURRCHNG                      (0x00000020UL)
#define USBFS_HPRT_PRTRES_POS                          (6U)
#define USBFS_HPRT_PRTRES                              (0x00000040UL)
#define USBFS_HPRT_PRTSUSP_POS                         (7U)
#define USBFS_HPRT_PRTSUSP                             (0x00000080UL)
#define USBFS_HPRT_PRTRST_POS                          (8U)
#define USBFS_HPRT_PRTRST                              (0x00000100UL)
#define USBFS_HPRT_PRTLNSTS_POS                        (10U)
#define USBFS_HPRT_PRTLNSTS                            (0x00000C00UL)
#define USBFS_HPRT_PRTLNSTS_0                          (0x00000400UL)
#define USBFS_HPRT_PRTLNSTS_1                          (0x00000800UL)
#define USBFS_HPRT_PRTPWR_POS                          (12U)
#define USBFS_HPRT_PRTPWR                              (0x00001000UL)
#define USBFS_HPRT_PRTTSTCTL_POS                       (13U)
#define USBFS_HPRT_PRTTSTCTL                           (0x0001E000UL)
#define USBFS_HPRT_PRTTSTCTL_0                         (0x00002000UL)
#define USBFS_HPRT_PRTTSTCTL_1                         (0x00004000UL)
#define USBFS_HPRT_PRTTSTCTL_2                         (0x00008000UL)
#define USBFS_HPRT_PRTTSTCTL_3                         (0x00010000UL)
#define USBFS_HPRT_PRTSPD_POS                          (17U)
#define USBFS_HPRT_PRTSPD                              (0x00060000UL)
#define USBFS_HPRT_PRTSPD_0                            (0x00020000UL)
#define USBFS_HPRT_PRTSPD_1                            (0x00040000UL)

/*  Bit definition for USBFS_HCCHAR0 register  */
#define USBFS_HCCHAR0_MPS_POS                          (0U)
#define USBFS_HCCHAR0_MPS                              (0x000007FFUL)
#define USBFS_HCCHAR0_EPNUM_POS                        (11U)
#define USBFS_HCCHAR0_EPNUM                            (0x00007800UL)
#define USBFS_HCCHAR0_EPDIR_POS                        (15U)
#define USBFS_HCCHAR0_EPDIR                            (0x00008000UL)
#define USBFS_HCCHAR0_LSPDDEV_POS                      (17U)
#define USBFS_HCCHAR0_LSPDDEV                          (0x00020000UL)
#define USBFS_HCCHAR0_EPTYPE_POS                       (18U)
#define USBFS_HCCHAR0_EPTYPE                           (0x000C0000UL)
#define USBFS_HCCHAR0_EPTYPE_0                         (0x00040000UL)
#define USBFS_HCCHAR0_EPTYPE_1                         (0x00080000UL)
#define USBFS_HCCHAR0_EC_POS                           (20U)
#define USBFS_HCCHAR0_EC                               (0x00300000UL)
#define USBFS_HCCHAR0_EC_0                             (0x00100000UL)
#define USBFS_HCCHAR0_EC_1                             (0x00200000UL)
#define USBFS_HCCHAR0_DEVADDR_POS                      (22U)
#define USBFS_HCCHAR0_DEVADDR                          (0x1FC00000UL)
#define USBFS_HCCHAR0_ODDFRM_POS                       (29U)
#define USBFS_HCCHAR0_ODDFRM                           (0x20000000UL)
#define USBFS_HCCHAR0_CHDIS_POS                        (30U)
#define USBFS_HCCHAR0_CHDIS                            (0x40000000UL)
#define USBFS_HCCHAR0_CHENA_POS                        (31U)
#define USBFS_HCCHAR0_CHENA                            (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT0 register  */
#define USBFS_HCSPLT0_PRTADDR_POS                      (0U)
#define USBFS_HCSPLT0_PRTADDR                          (0x0000007FUL)
#define USBFS_HCSPLT0_HUBADDR_POS                      (7U)
#define USBFS_HCSPLT0_HUBADDR                          (0x00003F80UL)
#define USBFS_HCSPLT0_XACTPOS_POS                      (14U)
#define USBFS_HCSPLT0_XACTPOS                          (0x0000C000UL)
#define USBFS_HCSPLT0_XACTPOS_0                        (0x00004000UL)
#define USBFS_HCSPLT0_XACTPOS_1                        (0x00008000UL)
#define USBFS_HCSPLT0_COMPSPLT_POS                     (16U)
#define USBFS_HCSPLT0_COMPSPLT                         (0x00010000UL)
#define USBFS_HCSPLT0_SPLTENA_POS                      (31U)
#define USBFS_HCSPLT0_SPLTENA                          (0x80000000UL)

/*  Bit definition for USBFS_HCINT0 register  */
#define USBFS_HCINT0_XFERCOMPL_POS                     (0U)
#define USBFS_HCINT0_XFERCOMPL                         (0x00000001UL)
#define USBFS_HCINT0_CHHLTD_POS                        (1U)
#define USBFS_HCINT0_CHHLTD                            (0x00000002UL)
#define USBFS_HCINT0_AHBERR_POS                        (2U)
#define USBFS_HCINT0_AHBERR                            (0x00000004UL)
#define USBFS_HCINT0_STALL_POS                         (3U)
#define USBFS_HCINT0_STALL                             (0x00000008UL)
#define USBFS_HCINT0_NAK_POS                           (4U)
#define USBFS_HCINT0_NAK                               (0x00000010UL)
#define USBFS_HCINT0_ACK_POS                           (5U)
#define USBFS_HCINT0_ACK                               (0x00000020UL)
#define USBFS_HCINT0_NYET_POS                          (6U)
#define USBFS_HCINT0_NYET                              (0x00000040UL)
#define USBFS_HCINT0_XACTERR_POS                       (7U)
#define USBFS_HCINT0_XACTERR                           (0x00000080UL)
#define USBFS_HCINT0_BBLERR_POS                        (8U)
#define USBFS_HCINT0_BBLERR                            (0x00000100UL)
#define USBFS_HCINT0_FRMOVRUN_POS                      (9U)
#define USBFS_HCINT0_FRMOVRUN                          (0x00000200UL)
#define USBFS_HCINT0_DATATGLERR_POS                    (10U)
#define USBFS_HCINT0_DATATGLERR                        (0x00000400UL)

/*  Bit definition for USBFS_HCINTMSK0 register  */
#define USBFS_HCINTMSK0_XFERCOMPLMSK_POS               (0U)
#define USBFS_HCINTMSK0_XFERCOMPLMSK                   (0x00000001UL)
#define USBFS_HCINTMSK0_CHHLTDMSK_POS                  (1U)
#define USBFS_HCINTMSK0_CHHLTDMSK                      (0x00000002UL)
#define USBFS_HCINTMSK0_AHBERRMSK_POS                  (2U)
#define USBFS_HCINTMSK0_AHBERRMSK                      (0x00000004UL)
#define USBFS_HCINTMSK0_STALLMSK_POS                   (3U)
#define USBFS_HCINTMSK0_STALLMSK                       (0x00000008UL)
#define USBFS_HCINTMSK0_NAKMSK_POS                     (4U)
#define USBFS_HCINTMSK0_NAKMSK                         (0x00000010UL)
#define USBFS_HCINTMSK0_ACKMSK_POS                     (5U)
#define USBFS_HCINTMSK0_ACKMSK                         (0x00000020UL)
#define USBFS_HCINTMSK0_NYETMSK_POS                    (6U)
#define USBFS_HCINTMSK0_NYETMSK                        (0x00000040UL)
#define USBFS_HCINTMSK0_XACTERRMSK_POS                 (7U)
#define USBFS_HCINTMSK0_XACTERRMSK                     (0x00000080UL)
#define USBFS_HCINTMSK0_BBLERRMSK_POS                  (8U)
#define USBFS_HCINTMSK0_BBLERRMSK                      (0x00000100UL)
#define USBFS_HCINTMSK0_FRMOVRUNMSK_POS                (9U)
#define USBFS_HCINTMSK0_FRMOVRUNMSK                    (0x00000200UL)
#define USBFS_HCINTMSK0_DATATGLERRMSK_POS              (10U)
#define USBFS_HCINTMSK0_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ0 register  */
#define USBFS_HCTSIZ0_XFERSIZE_POS                     (0U)
#define USBFS_HCTSIZ0_XFERSIZE                         (0x0007FFFFUL)
#define USBFS_HCTSIZ0_PKTCNT_POS                       (19U)
#define USBFS_HCTSIZ0_PKTCNT                           (0x1FF80000UL)
#define USBFS_HCTSIZ0_PID_POS                          (29U)
#define USBFS_HCTSIZ0_PID                              (0x60000000UL)
#define USBFS_HCTSIZ0_PID_0                            (0x20000000UL)
#define USBFS_HCTSIZ0_PID_1                            (0x40000000UL)
#define USBFS_HCTSIZ0_DOPNG_POS                        (31U)
#define USBFS_HCTSIZ0_DOPNG                            (0x80000000UL)

/*  Bit definition for USBFS_HCDMA0 register  */
#define USBFS_HCDMA0                                   (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR1 register  */
#define USBFS_HCCHAR1_MPS_POS                          (0U)
#define USBFS_HCCHAR1_MPS                              (0x000007FFUL)
#define USBFS_HCCHAR1_EPNUM_POS                        (11U)
#define USBFS_HCCHAR1_EPNUM                            (0x00007800UL)
#define USBFS_HCCHAR1_EPDIR_POS                        (15U)
#define USBFS_HCCHAR1_EPDIR                            (0x00008000UL)
#define USBFS_HCCHAR1_LSPDDEV_POS                      (17U)
#define USBFS_HCCHAR1_LSPDDEV                          (0x00020000UL)
#define USBFS_HCCHAR1_EPTYPE_POS                       (18U)
#define USBFS_HCCHAR1_EPTYPE                           (0x000C0000UL)
#define USBFS_HCCHAR1_EPTYPE_0                         (0x00040000UL)
#define USBFS_HCCHAR1_EPTYPE_1                         (0x00080000UL)
#define USBFS_HCCHAR1_EC_POS                           (20U)
#define USBFS_HCCHAR1_EC                               (0x00300000UL)
#define USBFS_HCCHAR1_DEVADDR_POS                      (22U)
#define USBFS_HCCHAR1_DEVADDR                          (0x1FC00000UL)
#define USBFS_HCCHAR1_ODDFRM_POS                       (29U)
#define USBFS_HCCHAR1_ODDFRM                           (0x20000000UL)
#define USBFS_HCCHAR1_CHDIS_POS                        (30U)
#define USBFS_HCCHAR1_CHDIS                            (0x40000000UL)
#define USBFS_HCCHAR1_CHENA_POS                        (31U)
#define USBFS_HCCHAR1_CHENA                            (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT1 register  */
#define USBFS_HCSPLT1_PRTADDR_POS                      (0U)
#define USBFS_HCSPLT1_PRTADDR                          (0x0000007FUL)
#define USBFS_HCSPLT1_HUBADDR_POS                      (7U)
#define USBFS_HCSPLT1_HUBADDR                          (0x00003F80UL)
#define USBFS_HCSPLT1_XACTPOS_POS                      (14U)
#define USBFS_HCSPLT1_XACTPOS                          (0x0000C000UL)
#define USBFS_HCSPLT1_XACTPOS_0                        (0x00004000UL)
#define USBFS_HCSPLT1_XACTPOS_1                        (0x00008000UL)
#define USBFS_HCSPLT1_COMPSPLT_POS                     (16U)
#define USBFS_HCSPLT1_COMPSPLT                         (0x00010000UL)
#define USBFS_HCSPLT1_SPLTENA_POS                      (31U)
#define USBFS_HCSPLT1_SPLTENA                          (0x80000000UL)

