levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_HCINT1 register  */
#define USBFS_HCINT1_XFERCOMPL_POS                     (0U)
#define USBFS_HCINT1_XFERCOMPL                         (0x00000001UL)
#define USBFS_HCINT1_CHHLTD_POS                        (1U)
#define USBFS_HCINT1_CHHLTD                            (0x00000002UL)
#define USBFS_HCINT1_AHBERR_POS                        (2U)
#define USBFS_HCINT1_AHBERR                            (0x00000004UL)
#define USBFS_HCINT1_STALL_POS                         (3U)
#define USBFS_HCINT1_STALL                             (0x00000008UL)
#define USBFS_HCINT1_NAK_POS                           (4U)
#define USBFS_HCINT1_NAK                               (0x00000010UL)
#define USBFS_HCINT1_ACK_POS                           (5U)
#define USBFS_HCINT1_ACK                               (0x00000020UL)
#define USBFS_HCINT1_NYET_POS                          (6U)
#define USBFS_HCINT1_NYET                              (0x00000040UL)
#define USBFS_HCINT1_XACTERR_POS                       (7U)
#define USBFS_HCINT1_XACTERR                           (0x00000080UL)
#define USBFS_HCINT1_BBLERR_POS                        (8U)
#define USBFS_HCINT1_BBLERR                            (0x00000100UL)
#define USBFS_HCINT1_FRMOVRUN_POS                      (9U)
#define USBFS_HCINT1_FRMOVRUN                          (0x00000200UL)
#define USBFS_HCINT1_DATATGLERR_POS                    (10U)
#define USBFS_HCINT1_DATATGLERR                        (0x00000400UL)

/*  Bit definition for USBFS_HCINTMSK1 register  */
#define USBFS_HCINTMSK1_XFERCOMPLMSK_POS               (0U)
#define USBFS_HCINTMSK1_XFERCOMPLMSK                   (0x00000001UL)
#define USBFS_HCINTMSK1_CHHLTDMSK_POS                  (1U)
#define USBFS_HCINTMSK1_CHHLTDMSK                      (0x00000002UL)
#define USBFS_HCINTMSK1_AHBERRMSK_POS                  (2U)
#define USBFS_HCINTMSK1_AHBERRMSK                      (0x00000004UL)
#define USBFS_HCINTMSK1_STALLMSK_POS                   (3U)
#define USBFS_HCINTMSK1_STALLMSK                       (0x00000008UL)
#define USBFS_HCINTMSK1_NAKMSK_POS                     (4U)
#define USBFS_HCINTMSK1_NAKMSK                         (0x00000010UL)
#define USBFS_HCINTMSK1_ACKMSK_POS                     (5U)
#define USBFS_HCINTMSK1_ACKMSK                         (0x00000020UL)
#define USBFS_HCINTMSK1_NYETMSK_POS                    (6U)
#define USBFS_HCINTMSK1_NYETMSK                        (0x00000040UL)
#define USBFS_HCINTMSK1_XACTERRMSK_POS                 (7U)
#define USBFS_HCINTMSK1_XACTERRMSK                     (0x00000080UL)
#define USBFS_HCINTMSK1_BBLERRMSK_POS                  (8U)
#define USBFS_HCINTMSK1_BBLERRMSK                      (0x00000100UL)
#define USBFS_HCINTMSK1_FRMOVRUNMSK_POS                (9U)
#define USBFS_HCINTMSK1_FRMOVRUNMSK                    (0x00000200UL)
#define USBFS_HCINTMSK1_DATATGLERRMSK_POS              (10U)
#define USBFS_HCINTMSK1_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ1 register  */
#define USBFS_HCTSIZ1_XFERSIZE_POS                     (0U)
#define USBFS_HCTSIZ1_XFERSIZE                         (0x0007FFFFUL)
#define USBFS_HCTSIZ1_PKTCNT_POS                       (19U)
#define USBFS_HCTSIZ1_PKTCNT                           (0x1FF80000UL)
#define USBFS_HCTSIZ1_PID_POS                          (29U)
#define USBFS_HCTSIZ1_PID                              (0x60000000UL)
#define USBFS_HCTSIZ1_PID_0                            (0x20000000UL)
#define USBFS_HCTSIZ1_PID_1                            (0x40000000UL)
#define USBFS_HCTSIZ1_DOPNG_POS                        (31U)
#define USBFS_HCTSIZ1_DOPNG                            (0x80000000UL)

/*  Bit definition for USBFS_HCDMA1 register  */
#define USBFS_HCDMA1                                   (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR2 register  */
#define USBFS_HCCHAR2_MPS_POS                          (0U)
#define USBFS_HCCHAR2_MPS                              (0x000007FFUL)
#define USBFS_HCCHAR2_EPNUM_POS                        (11U)
#define USBFS_HCCHAR2_EPNUM                            (0x00007800UL)
#define USBFS_HCCHAR2_EPDIR_POS                        (15U)
#define USBFS_HCCHAR2_EPDIR                            (0x00008000UL)
#define USBFS_HCCHAR2_LSPDDEV_POS                      (17U)
#define USBFS_HCCHAR2_LSPDDEV                          (0x00020000UL)
#define USBFS_HCCHAR2_EPTYPE_POS                       (18U)
#define USBFS_HCCHAR2_EPTYPE                           (0x000C0000UL)
#define USBFS_HCCHAR2_EPTYPE_0                         (0x00040000UL)
#define USBFS_HCCHAR2_EPTYPE_1                         (0x00080000UL)
#define USBFS_HCCHAR2_EC_POS                           (20U)
#define USBFS_HCCHAR2_EC                               (0x00300000UL)
#define USBFS_HCCHAR2_DEVADDR_POS                      (22U)
#define USBFS_HCCHAR2_DEVADDR                          (0x1FC00000UL)
#define USBFS_HCCHAR2_ODDFRM_POS                       (29U)
#define USBFS_HCCHAR2_ODDFRM                           (0x20000000UL)
#define USBFS_HCCHAR2_CHDIS_POS                        (30U)
#define USBFS_HCCHAR2_CHDIS                            (0x40000000UL)
#define USBFS_HCCHAR2_CHENA_POS                        (31U)
#define USBFS_HCCHAR2_CHENA                            (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT2 register  */
#define USBFS_HCSPLT2_PRTADDR_POS                      (0U)
#define USBFS_HCSPLT2_PRTADDR                          (0x0000007FUL)
#define USBFS_HCSPLT2_HUBADDR_POS                      (7U)
#define USBFS_HCSPLT2_HUBADDR                          (0x00003F80UL)
#define USBFS_HCSPLT2_XACTPOS_POS                      (14U)
#define USBFS_HCSPLT2_XACTPOS                          (0x0000C000UL)
#define USBFS_HCSPLT2_XACTPOS_0                        (0x00004000UL)
#define USBFS_HCSPLT2_XACTPOS_1                        (0x00008000UL)
#define USBFS_HCSPLT2_COMPSPLT_POS                     (16U)
#define USBFS_HCSPLT2_COMPSPLT                         (0x00010000UL)
#define USBFS_HCSPLT2_SPLTENA_POS                      (31U)
#define USBFS_HCSPLT2_SPLTENA                          (0x80000000UL)

/*  Bit definition for USBFS_HCINT2 register  */
#define USBFS_HCINT2_XFERCOMPL_POS                     (0U)
#define USBFS_HCINT2_XFERCOMPL                         (0x00000001UL)
#define USBFS_HCINT2_CHHLTD_POS                        (1U)
#define USBFS_HCINT2_CHHLTD                            (0x00000002UL)
#define USBFS_HCINT2_AHBERR_POS                        (2U)
#define USBFS_HCINT2_AHBERR                            (0x00000004UL)
#define USBFS_HCINT2_STALL_POS                         (3U)
#define USBFS_HCINT2_STALL                             (0x00000008UL)
#define USBFS_HCINT2_NAK_POS                           (4U)
#define USBFS_HCINT2_NAK                               (0x00000010UL)
#define USBFS_HCINT2_ACK_POS                           (5U)
#define USBFS_HCINT2_ACK                               (0x00000020UL)
#define USBFS_HCINT2_NYET_POS                          (6U)
#define USBFS_HCINT2_NYET                              (0x00000040UL)
#define USBFS_HCINT2_XACTERR_POS                       (7U)
#define USBFS_HCINT2_XACTERR                           (0x00000080UL)
#define USBFS_HCINT2_BBLERR_POS                        (8U)
#define USBFS_HCINT2_BBLERR                            (0x00000100UL)
#define USBFS_HCINT2_FRMOVRUN_POS                      (9U)
#define USBFS_HCINT2_FRMOVRUN                          (0x00000200UL)
#define USBFS_HCINT2_DATATGLERR_POS                    (10U)
#define USBFS_HCINT2_DATATGLERR                        (0x00000400UL)

/*  Bit definition for USBFS_HCINTMSK2 register  */
#define USBFS_HCINTMSK2_XFERCOMPLMSK_POS               (0U)
#define USBFS_HCINTMSK2_XFERCOMPLMSK                   (0x00000001UL)
#define USBFS_HCINTMSK2_CHHLTDMSK_POS                  (1U)
#define USBFS_HCINTMSK2_CHHLTDMSK                      (0x00000002UL)
#define USBFS_HCINTMSK2_AHBERRMSK_POS                  (2U)
#define USBFS_HCINTMSK2_AHBERRMSK                      (0x00000004UL)
#define USBFS_HCINTMSK2_STALLMSK_POS                   (3U)
#define USBFS_HCINTMSK2_STALLMSK                       (0x00000008UL)
#define USBFS_HCINTMSK2_NAKMSK_POS                     (4U)
#define USBFS_HCINTMSK2_NAKMSK                         (0x00000010UL)
#define USBFS_HCINTMSK2_ACKMSK_POS                     (5U)
#define USBFS_HCINTMSK2_ACKMSK                         (0x00000020UL)
#define USBFS_HCINTMSK2_NYETMSK_POS                    (6U)
#define USBFS_HCINTMSK2_NYETMSK                        (0x00000040UL)
#define USBFS_HCINTMSK2_XACTERRMSK_POS                 (7U)
#define USBFS_HCINTMSK2_XACTERRMSK                     (0x00000080UL)
#define USBFS_HCINTMSK2_BBLERRMSK_POS                  (8U)
#define USBFS_HCINTMSK2_BBLERRMSK                      (0x00000100UL)
#define USBFS_HCINTMSK2_FRMOVRUNMSK_POS                (9U)
#define USBFS_HCINTMSK2_FRMOVRUNMSK                    (0x00000200UL)
#define USBFS_HCINTMSK2_DATATGLERRMSK_POS              (10U)
#define USBFS_HCINTMSK2_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ2 register  */
#define USBFS_HCTSIZ2_XFERSIZE_POS                     (0U)
#define USBFS_HCTSIZ2_XFERSIZE                         (0x0007FFFFUL)
#define USBFS_HCTSIZ2_PKTCNT_POS                       (19U)
#define USBFS_HCTSIZ2_PKTCNT                           (0x1FF80000UL)
#define USBFS_HCTSIZ2_PID_POS                          (29U)
#define USBFS_HCTSIZ2_PID                              (0x60000000UL)
#define USBFS_HCTSIZ2_PID_0                            (0x20000000UL)
#define USBFS_HCTSIZ2_PID_1                            (0x40000000UL)
#define USBFS_HCTSIZ2_DOPNG_POS                        (31U)
#define USBFS_HCTSIZ2_DOPNG                            (0x80000000UL)

/*  Bit definition for USBFS_HCDMA2 register  */
#define USBFS_HCDMA2                                   (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR3 register  */
#define USBFS_HCCHAR3_MPS_POS                          (0U)
#define USBFS_HCCHAR3_MPS                              (0x000007FFUL)
#define USBFS_HCCHAR3_EPNUM_POS                        (11U)
#define USBFS_HCCHAR3_EPNUM                            (0x00007800UL)
#define USBFS_HCCHAR3_EPDIR_POS                        (15U)
#define USBFS_HCCHAR3_EPDIR                            (0x00008000UL)
#define USBFS_HCCHAR3_LSPDDEV_POS                      (17U)
#define USBFS_HCCHAR3_LSPDDEV                          (0x00020000UL)
#define USBFS_HCCHAR3_EPTYPE_POS                       (18U)
#define USBFS_HCCHAR3_EPTYPE                           (0x000C0000UL)
#define USBFS_HCCHAR3_EPTYPE_0                         (0x00040000UL)
#define USBFS_HCCHAR3_EPTYPE_1                         (0x00080000UL)
#define USBFS_HCCHAR3_EC_POS                           (20U)
#define USBFS_HCCHAR3_EC                               (0x00300000UL)
#define USBFS_HCCHAR3_DEVADDR_POS                      (22U)
#define USBFS_HCCHAR3_DEVADDR                          (0x1FC00000UL)
#define USBFS_HCCHAR3_ODDFRM_POS                       (29U)
#define USBFS_HCCHAR3_ODDFRM                           (0x20000000UL)
#define USBFS_HCCHAR3_CHDIS_POS                        (30U)
#define USBFS_HCCHAR3_CHDIS                            (0x40000000UL)
#define USBFS_HCCHAR3_CHENA_POS                        (31U)
#define USBFS_HCCHAR3_CHENA                            (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT3 register  */
#define USBFS_HCSPLT3_PRTADDR_POS                      (0U)
#define USBFS_HCSPLT3_PRTADDR                          (0x0000007FUL)
#define USBFS_HCSPLT3_HUBADDR_POS                      (7U)
#define USBFS_HCSPLT3_HUBADDR                          (0x00003F80UL)
#define USBFS_HCSPLT3_XACTPOS_POS                      (14U)
#define USBFS_HCSPLT3_XACTPOS                          (0x0000C000UL)
#define USBFS_HCSPLT3_XACTPOS_0                        (0x00004000UL)
#define USBFS_HCSPLT3_XACTPOS_1                        (0x00008000UL)
#define USBFS_HCSPLT3_COMPSPLT_POS                     (16U)
#define USBFS_HCSPLT3_COMPSPLT                         (0x00010000UL)
#define USBFS_HCSPLT3_SPLTENA_POS                      (31U)
#define USBFS_HCSPLT3_SPLTENA                          (0x80000000UL)

/*  Bit definition for USBFS_HCINT3 register  */
#define USBFS_HCINT3_XFERCOMPL_POS                     (0U)
#define USBFS_HCINT3_XFERCOMPL                         (0x00000001UL)
#define USBFS_HCINT3_CHHLTD_POS                        (1U)
#define USBFS_HCINT3_CHHLTD                            (0x00000002UL)
#define USBFS_HCINT3_AHBERR_POS                        (2U)
#define USBFS_HCINT3_AHBERR                            (0x00000004UL)
#define USBFS_HCINT3_STALL_POS                         (3U)
#define USBFS_HCINT3_STALL                             (0x00000008UL)
#define USBFS_HCINT3_NAK_POS                           (4U)
#define USBFS_HCINT3_NAK                               (0x00000010UL)
#define USBFS_HCINT3_ACK_POS                           (5U)
#define USBFS_HCINT3_ACK                               (0x00000020UL)
#define USBFS_HCINT3_NYET_POS                          (6U)
#define USBFS_HCINT3_NYET                              (0x00000040UL)
#define USBFS_HCINT3_XACTERR_POS                       (7U)
#define USBFS_HCINT3_XACTERR                           (0x00000080UL)
#define USBFS_HCINT3_BBLERR_POS                        (8U)
#define USBFS_HCINT3_BBLERR                            (0x00000100UL)
#define USBFS_HCINT3_FRMOVRUN_POS                      (9U)
#define USBFS_HCINT3_FRMOVRUN                          (0x00000200UL)
#define USBFS_HCINT3_DATATGLERR_POS                    (10U)
#define USBFS_HCINT3_DATATGLERR                        (0x00000400UL)

