levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_HCINTMSK3 register  */
#define USBFS_HCINTMSK3_XFERCOMPLMSK_POS               (0U)
#define USBFS_HCINTMSK3_XFERCOMPLMSK                   (0x00000001UL)
#define USBFS_HCINTMSK3_CHHLTDMSK_POS                  (1U)
#define USBFS_HCINTMSK3_CHHLTDMSK                      (0x00000002UL)
#define USBFS_HCINTMSK3_AHBERRMSK_POS                  (2U)
#define USBFS_HCINTMSK3_AHBERRMSK                      (0x00000004UL)
#define USBFS_HCINTMSK3_STALLMSK_POS                   (3U)
#define USBFS_HCINTMSK3_STALLMSK                       (0x00000008UL)
#define USBFS_HCINTMSK3_NAKMSK_POS                     (4U)
#define USBFS_HCINTMSK3_NAKMSK                         (0x00000010UL)
#define USBFS_HCINTMSK3_ACKMSK_POS                     (5U)
#define USBFS_HCINTMSK3_ACKMSK                         (0x00000020UL)
#define USBFS_HCINTMSK3_NYETMSK_POS                    (6U)
#define USBFS_HCINTMSK3_NYETMSK                        (0x00000040UL)
#define USBFS_HCINTMSK3_XACTERRMSK_POS                 (7U)
#define USBFS_HCINTMSK3_XACTERRMSK                     (0x00000080UL)
#define USBFS_HCINTMSK3_BBLERRMSK_POS                  (8U)
#define USBFS_HCINTMSK3_BBLERRMSK                      (0x00000100UL)
#define USBFS_HCINTMSK3_FRMOVRUNMSK_POS                (9U)
#define USBFS_HCINTMSK3_FRMOVRUNMSK                    (0x00000200UL)
#define USBFS_HCINTMSK3_DATATGLERRMSK_POS              (10U)
#define USBFS_HCINTMSK3_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ3 register  */
#define USBFS_HCTSIZ3_XFERSIZE_POS                     (0U)
#define USBFS_HCTSIZ3_XFERSIZE                         (0x0007FFFFUL)
#define USBFS_HCTSIZ3_PKTCNT_POS                       (19U)
#define USBFS_HCTSIZ3_PKTCNT                           (0x1FF80000UL)
#define USBFS_HCTSIZ3_PID_POS                          (29U)
#define USBFS_HCTSIZ3_PID                              (0x60000000UL)
#define USBFS_HCTSIZ3_PID_0                            (0x20000000UL)
#define USBFS_HCTSIZ3_PID_1                            (0x40000000UL)
#define USBFS_HCTSIZ3_DOPNG_POS                        (31U)
#define USBFS_HCTSIZ3_DOPNG                            (0x80000000UL)

/*  Bit definition for USBFS_HCDMA3 register  */
#define USBFS_HCDMA3                                   (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR4 register  */
#define USBFS_HCCHAR4_MPS_POS                          (0U)
#define USBFS_HCCHAR4_MPS                              (0x000007FFUL)
#define USBFS_HCCHAR4_EPNUM_POS                        (11U)
#define USBFS_HCCHAR4_EPNUM                            (0x00007800UL)
#define USBFS_HCCHAR4_EPDIR_POS                        (15U)
#define USBFS_HCCHAR4_EPDIR                            (0x00008000UL)
#define USBFS_HCCHAR4_LSPDDEV_POS                      (17U)
#define USBFS_HCCHAR4_LSPDDEV                          (0x00020000UL)
#define USBFS_HCCHAR4_EPTYPE_POS                       (18U)
#define USBFS_HCCHAR4_EPTYPE                           (0x000C0000UL)
#define USBFS_HCCHAR4_EPTYPE_0                         (0x00040000UL)
#define USBFS_HCCHAR4_EPTYPE_1                         (0x00080000UL)
#define USBFS_HCCHAR4_EC_POS                           (20U)
#define USBFS_HCCHAR4_EC                               (0x00300000UL)
#define USBFS_HCCHAR4_DEVADDR_POS                      (22U)
#define USBFS_HCCHAR4_DEVADDR                          (0x1FC00000UL)
#define USBFS_HCCHAR4_ODDFRM_POS                       (29U)
#define USBFS_HCCHAR4_ODDFRM                           (0x20000000UL)
#define USBFS_HCCHAR4_CHDIS_POS                        (30U)
#define USBFS_HCCHAR4_CHDIS                            (0x40000000UL)
#define USBFS_HCCHAR4_CHENA_POS                        (31U)
#define USBFS_HCCHAR4_CHENA                            (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT4 register  */
#define USBFS_HCSPLT4_PRTADDR_POS                      (0U)
#define USBFS_HCSPLT4_PRTADDR                          (0x0000007FUL)
#define USBFS_HCSPLT4_HUBADDR_POS                      (7U)
#define USBFS_HCSPLT4_HUBADDR                          (0x00003F80UL)
#define USBFS_HCSPLT4_XACTPOS_POS                      (14U)
#define USBFS_HCSPLT4_XACTPOS                          (0x0000C000UL)
#define USBFS_HCSPLT4_XACTPOS_0                        (0x00004000UL)
#define USBFS_HCSPLT4_XACTPOS_1                        (0x00008000UL)
#define USBFS_HCSPLT4_COMPSPLT_POS                     (16U)
#define USBFS_HCSPLT4_COMPSPLT                         (0x00010000UL)
#define USBFS_HCSPLT4_SPLTENA_POS                      (31U)
#define USBFS_HCSPLT4_SPLTENA                          (0x80000000UL)

/*  Bit definition for USBFS_HCINT4 register  */
#define USBFS_HCINT4_XFERCOMPL_POS                     (0U)
#define USBFS_HCINT4_XFERCOMPL                         (0x00000001UL)
#define USBFS_HCINT4_CHHLTD_POS                        (1U)
#define USBFS_HCINT4_CHHLTD                            (0x00000002UL)
#define USBFS_HCINT4_AHBERR_POS                        (2U)
#define USBFS_HCINT4_AHBERR                            (0x00000004UL)
#define USBFS_HCINT4_STALL_POS                         (3U)
#define USBFS_HCINT4_STALL                             (0x00000008UL)
#define USBFS_HCINT4_NAK_POS                           (4U)
#define USBFS_HCINT4_NAK                               (0x00000010UL)
#define USBFS_HCINT4_ACK_POS                           (5U)
#define USBFS_HCINT4_ACK                               (0x00000020UL)
#define USBFS_HCINT4_NYET_POS                          (6U)
#define USBFS_HCINT4_NYET                              (0x00000040UL)
#define USBFS_HCINT4_XACTERR_POS                       (7U)
#define USBFS_HCINT4_XACTERR                           (0x00000080UL)
#define USBFS_HCINT4_BBLERR_POS                        (8U)
#define USBFS_HCINT4_BBLERR                            (0x00000100UL)
#define USBFS_HCINT4_FRMOVRUN_POS                      (9U)
#define USBFS_HCINT4_FRMOVRUN                          (0x00000200UL)
#define USBFS_HCINT4_DATATGLERR_POS                    (10U)
#define USBFS_HCINT4_DATATGLERR                        (0x00000400UL)

