levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_HCINTMSK4 register  */
#define USBFS_HCINTMSK4_XFERCOMPLMSK_POS               (0U)
#define USBFS_HCINTMSK4_XFERCOMPLMSK                   (0x00000001UL)
#define USBFS_HCINTMSK4_CHHLTDMSK_POS                  (1U)
#define USBFS_HCINTMSK4_CHHLTDMSK                      (0x00000002UL)
#define USBFS_HCINTMSK4_AHBERRMSK_POS                  (2U)
#define USBFS_HCINTMSK4_AHBERRMSK                      (0x00000004UL)
#define USBFS_HCINTMSK4_STALLMSK_POS                   (3U)
#define USBFS_HCINTMSK4_STALLMSK                       (0x00000008UL)
#define USBFS_HCINTMSK4_NAKMSK_POS                     (4U)
#define USBFS_HCINTMSK4_NAKMSK                         (0x00000010UL)
#define USBFS_HCINTMSK4_ACKMSK_POS                     (5U)
#define USBFS_HCINTMSK4_ACKMSK                         (0x00000020UL)
#define USBFS_HCINTMSK4_NYETMSK_POS                    (6U)
#define USBFS_HCINTMSK4_NYETMSK                        (0x00000040UL)
#define USBFS_HCINTMSK4_XACTERRMSK_POS                 (7U)
#define USBFS_HCINTMSK4_XACTERRMSK                     (0x00000080UL)
#define USBFS_HCINTMSK4_BBLERRMSK_POS                  (8U)
#define USBFS_HCINTMSK4_BBLERRMSK                      (0x00000100UL)
#define USBFS_HCINTMSK4_FRMOVRUNMSK_POS                (9U)
#define USBFS_HCINTMSK4_FRMOVRUNMSK                    (0x00000200UL)
#define USBFS_HCINTMSK4_DATATGLERRMSK_POS              (10U)
#define USBFS_HCINTMSK4_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ4 register  */
#define USBFS_HCTSIZ4_XFERSIZE_POS                     (0U)
#define USBFS_HCTSIZ4_XFERSIZE                         (0x0007FFFFUL)
#define USBFS_HCTSIZ4_PKTCNT_POS                       (19U)
#define USBFS_HCTSIZ4_PKTCNT                           (0x1FF80000UL)
#define USBFS_HCTSIZ4_PID_POS                          (29U)
#define USBFS_HCTSIZ4_PID                              (0x60000000UL)
#define USBFS_HCTSIZ4_PID_0                            (0x20000000UL)
#define USBFS_HCTSIZ4_PID_1                            (0x40000000UL)
#define USBFS_HCTSIZ4_DOPNG_POS                        (31U)
#define USBFS_HCTSIZ4_DOPNG                            (0x80000000UL)

/*  Bit definition for USBFS_HCDMA4 register  */
#define USBFS_HCDMA4                                   (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR5 register  */
#define USBFS_HCCHAR5_MPS_POS                          (0U)
#define USBFS_HCCHAR5_MPS                              (0x000007FFUL)
#define USBFS_HCCHAR5_EPNUM_POS                        (11U)
#define USBFS_HCCHAR5_EPNUM                            (0x00007800UL)
#define USBFS_HCCHAR5_EPDIR_POS                        (15U)
#define USBFS_HCCHAR5_EPDIR                            (0x00008000UL)
#define USBFS_HCCHAR5_LSPDDEV_POS                      (17U)
#define USBFS_HCCHAR5_LSPDDEV                          (0x00020000UL)
#define USBFS_HCCHAR5_EPTYPE_POS                       (18U)
#define USBFS_HCCHAR5_EPTYPE                           (0x000C0000UL)
#define USBFS_HCCHAR5_EPTYPE_0                         (0x00040000UL)
#define USBFS_HCCHAR5_EPTYPE_1                         (0x00080000UL)
#define USBFS_HCCHAR5_EC_POS                           (20U)
#define USBFS_HCCHAR5_EC                               (0x00300000UL)
#define USBFS_HCCHAR5_DEVADDR_POS                      (22U)
#define USBFS_HCCHAR5_DEVADDR                          (0x1FC00000UL)
#define USBFS_HCCHAR5_ODDFRM_POS                       (29U)
#define USBFS_HCCHAR5_ODDFRM                           (0x20000000UL)
#define USBFS_HCCHAR5_CHDIS_POS                        (30U)
#define USBFS_HCCHAR5_CHDIS                            (0x40000000UL)
#define USBFS_HCCHAR5_CHENA_POS                        (31U)
#define USBFS_HCCHAR5_CHENA                            (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT5 register  */
#define USBFS_HCSPLT5_PRTADDR_POS                      (0U)
#define USBFS_HCSPLT5_PRTADDR                          (0x0000007FUL)
#define USBFS_HCSPLT5_HUBADDR_POS                      (7U)
#define USBFS_HCSPLT5_HUBADDR                          (0x00003F80UL)
#define USBFS_HCSPLT5_XACTPOS_POS                      (14U)
#define USBFS_HCSPLT5_XACTPOS                          (0x0000C000UL)
#define USBFS_HCSPLT5_XACTPOS_0                        (0x00004000UL)
#define USBFS_HCSPLT5_XACTPOS_1                        (0x00008000UL)
#define USBFS_HCSPLT5_COMPSPLT_POS                     (16U)
#define USBFS_HCSPLT5_COMPSPLT                         (0x00010000UL)
#define USBFS_HCSPLT5_SPLTENA_POS                      (31U)
#define USBFS_HCSPLT5_SPLTENA                          (0x80000000UL)

/*  Bit definition for USBFS_HCINT5 register  */
#define USBFS_HCINT5_XFERCOMPL_POS                     (0U)
#define USBFS_HCINT5_XFERCOMPL                         (0x00000001UL)
#define USBFS_HCINT5_CHHLTD_POS                        (1U)
#define USBFS_HCINT5_CHHLTD                            (0x00000002UL)
#define USBFS_HCINT5_AHBERR_POS                        (2U)
#define USBFS_HCINT5_AHBERR                            (0x00000004UL)
#define USBFS_HCINT5_STALL_POS                         (3U)
#define USBFS_HCINT5_STALL                             (0x00000008UL)
#define USBFS_HCINT5_NAK_POS                           (4U)
#define USBFS_HCINT5_NAK                               (0x00000010UL)
#define USBFS_HCINT5_ACK_POS                           (5U)
#define USBFS_HCINT5_ACK                               (0x00000020UL)
#define USBFS_HCINT5_NYET_POS                          (6U)
#define USBFS_HCINT5_NYET                              (0x00000040UL)
#define USBFS_HCINT5_XACTERR_POS                       (7U)
#define USBFS_HCINT5_XACTERR                           (0x00000080UL)
#define USBFS_HCINT5_BBLERR_POS                        (8U)
#define USBFS_HCINT5_BBLERR                            (0x00000100UL)
#define USBFS_HCINT5_FRMOVRUN_POS                      (9U)
#define USBFS_HCINT5_FRMOVRUN                          (0x00000200UL)
#define USBFS_HCINT5_DATATGLERR_POS                    (10U)
#define USBFS_HCINT5_DATATGLERR                        (0x00000400UL)

/*  Bit definition for USBFS_HCINTMSK5 register  */
#define USBFS_HCINTMSK5_XFERCOMPLMSK_POS               (0U)
#define USBFS_HCINTMSK5_XFERCOMPLMSK                   (0x00000001UL)
#define USBFS_HCINTMSK5_CHHLTDMSK_POS                  (1U)
#define USBFS_HCINTMSK5_CHHLTDMSK                      (0x00000002UL)
#define USBFS_HCINTMSK5_AHBERRMSK_POS                  (2U)
#define USBFS_HCINTMSK5_AHBERRMSK                      (0x00000004UL)
#define USBFS_HCINTMSK5_STALLMSK_POS                   (3U)
#define USBFS_HCINTMSK5_STALLMSK                       (0x00000008UL)
#define USBFS_HCINTMSK5_NAKMSK_POS                     (4U)
#define USBFS_HCINTMSK5_NAKMSK                         (0x00000010UL)
#define USBFS_HCINTMSK5_ACKMSK_POS                     (5U)
#define USBFS_HCINTMSK5_ACKMSK                         (0x00000020UL)
#define USBFS_HCINTMSK5_NYETMSK_POS                    (6U)
#define USBFS_HCINTMSK5_NYETMSK                        (0x00000040UL)
#define USBFS_HCINTMSK5_XACTERRMSK_POS                 (7U)
#define USBFS_HCINTMSK5_XACTERRMSK                     (0x00000080UL)
#define USBFS_HCINTMSK5_BBLERRMSK_POS                  (8U)
#define USBFS_HCINTMSK5_BBLERRMSK                      (0x00000100UL)
#define USBFS_HCINTMSK5_FRMOVRUNMSK_POS                (9U)
#define USBFS_HCINTMSK5_FRMOVRUNMSK                    (0x00000200UL)
#define USBFS_HCINTMSK5_DATATGLERRMSK_POS              (10U)
#define USBFS_HCINTMSK5_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ5 register  */
#define USBFS_HCTSIZ5_XFERSIZE_POS                     (0U)
#define USBFS_HCTSIZ5_XFERSIZE                         (0x0007FFFFUL)
#define USBFS_HCTSIZ5_PKTCNT_POS                       (19U)
#define USBFS_HCTSIZ5_PKTCNT                           (0x1FF80000UL)
#define USBFS_HCTSIZ5_PID_POS                          (29U)
#define USBFS_HCTSIZ5_PID                              (0x60000000UL)
#define USBFS_HCTSIZ5_PID_0                            (0x20000000UL)
#define USBFS_HCTSIZ5_PID_1                            (0x40000000UL)
#define USBFS_HCTSIZ5_DOPNG_POS                        (31U)
#define USBFS_HCTSIZ5_DOPNG                            (0x80000000UL)

/*  Bit definition for USBFS_HCDMA5 register  */
#define USBFS_HCDMA5                                   (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR6 register  */
#define USBFS_HCCHAR6_MPS_POS                          (0U)
#define USBFS_HCCHAR6_MPS                              (0x000007FFUL)
#define USBFS_HCCHAR6_EPNUM_POS                        (11U)
#define USBFS_HCCHAR6_EPNUM                            (0x00007800UL)
#define USBFS_HCCHAR6_EPDIR_POS                        (15U)
#define USBFS_HCCHAR6_EPDIR                            (0x00008000UL)
#define USBFS_HCCHAR6_LSPDDEV_POS                      (17U)
#define USBFS_HCCHAR6_LSPDDEV                          (0x00020000UL)
#define USBFS_HCCHAR6_EPTYPE_POS                       (18U)
#define USBFS_HCCHAR6_EPTYPE                           (0x000C0000UL)
#define USBFS_HCCHAR6_EPTYPE_0                         (0x00040000UL)
#define USBFS_HCCHAR6_EPTYPE_1                         (0x00080000UL)
#define USBFS_HCCHAR6_EC_POS                           (20U)
#define USBFS_HCCHAR6_EC                               (0x00300000UL)
#define USBFS_HCCHAR6_DEVADDR_POS                      (22U)
#define USBFS_HCCHAR6_DEVADDR                          (0x1FC00000UL)
#define USBFS_HCCHAR6_ODDFRM_POS                       (29U)
#define USBFS_HCCHAR6_ODDFRM                           (0x20000000UL)
#define USBFS_HCCHAR6_CHDIS_POS                        (30U)
#define USBFS_HCCHAR6_CHDIS                            (0x40000000UL)
#define USBFS_HCCHAR6_CHENA_POS                        (31U)
#define USBFS_HCCHAR6_CHENA                            (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT6 register  */
#define USBFS_HCSPLT6_PRTADDR_POS                      (0U)
#define USBFS_HCSPLT6_PRTADDR                          (0x0000007FUL)
#define USBFS_HCSPLT6_HUBADDR_POS                      (7U)
#define USBFS_HCSPLT6_HUBADDR                          (0x00003F80UL)
#define USBFS_HCSPLT6_XACTPOS_POS                      (14U)
#define USBFS_HCSPLT6_XACTPOS                          (0x0000C000UL)
#define USBFS_HCSPLT6_XACTPOS_0                        (0x00004000UL)
#define USBFS_HCSPLT6_XACTPOS_1                        (0x00008000UL)
#define USBFS_HCSPLT6_COMPSPLT_POS                     (16U)
#define USBFS_HCSPLT6_COMPSPLT                         (0x00010000UL)
#define USBFS_HCSPLT6_SPLTENA_POS                      (31U)
#define USBFS_HCSPLT6_SPLTENA                          (0x80000000UL)

