levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_HCINT6 register  */
#define USBFS_HCINT6_XFERCOMPL_POS                     (0U)
#define USBFS_HCINT6_XFERCOMPL                         (0x00000001UL)
#define USBFS_HCINT6_CHHLTD_POS                        (1U)
#define USBFS_HCINT6_CHHLTD                            (0x00000002UL)
#define USBFS_HCINT6_AHBERR_POS                        (2U)
#define USBFS_HCINT6_AHBERR                            (0x00000004UL)
#define USBFS_HCINT6_STALL_POS                         (3U)
#define USBFS_HCINT6_STALL                             (0x00000008UL)
#define USBFS_HCINT6_NAK_POS                           (4U)
#define USBFS_HCINT6_NAK                               (0x00000010UL)
#define USBFS_HCINT6_ACK_POS                           (5U)
#define USBFS_HCINT6_ACK                               (0x00000020UL)
#define USBFS_HCINT6_NYET_POS                          (6U)
#define USBFS_HCINT6_NYET                              (0x00000040UL)
#define USBFS_HCINT6_XACTERR_POS                       (7U)
#define USBFS_HCINT6_XACTERR                           (0x00000080UL)
#define USBFS_HCINT6_BBLERR_POS                        (8U)
#define USBFS_HCINT6_BBLERR                            (0x00000100UL)
#define USBFS_HCINT6_FRMOVRUN_POS                      (9U)
#define USBFS_HCINT6_FRMOVRUN                          (0x00000200UL)
#define USBFS_HCINT6_DATATGLERR_POS                    (10U)
#define USBFS_HCINT6_DATATGLERR                        (0x00000400UL)

/*  Bit definition for USBFS_HCINTMSK6 register  */
#define USBFS_HCINTMSK6_XFERCOMPLMSK_POS               (0U)
#define USBFS_HCINTMSK6_XFERCOMPLMSK                   (0x00000001UL)
#define USBFS_HCINTMSK6_CHHLTDMSK_POS                  (1U)
#define USBFS_HCINTMSK6_CHHLTDMSK                      (0x00000002UL)
#define USBFS_HCINTMSK6_AHBERRMSK_POS                  (2U)
#define USBFS_HCINTMSK6_AHBERRMSK                      (0x00000004UL)
#define USBFS_HCINTMSK6_STALLMSK_POS                   (3U)
#define USBFS_HCINTMSK6_STALLMSK                       (0x00000008UL)
#define USBFS_HCINTMSK6_NAKMSK_POS                     (4U)
#define USBFS_HCINTMSK6_NAKMSK                         (0x00000010UL)
#define USBFS_HCINTMSK6_ACKMSK_POS                     (5U)
#define USBFS_HCINTMSK6_ACKMSK                         (0x00000020UL)
#define USBFS_HCINTMSK6_NYETMSK_POS                    (6U)
#define USBFS_HCINTMSK6_NYETMSK                        (0x00000040UL)
#define USBFS_HCINTMSK6_XACTERRMSK_POS                 (7U)
#define USBFS_HCINTMSK6_XACTERRMSK                     (0x00000080UL)
#define USBFS_HCINTMSK6_BBLERRMSK_POS                  (8U)
#define USBFS_HCINTMSK6_BBLERRMSK                      (0x00000100UL)
#define USBFS_HCINTMSK6_FRMOVRUNMSK_POS                (9U)
#define USBFS_HCINTMSK6_FRMOVRUNMSK                    (0x00000200UL)
#define USBFS_HCINTMSK6_DATATGLERRMSK_POS              (10U)
#define USBFS_HCINTMSK6_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ6 register  */
#define USBFS_HCTSIZ6_XFERSIZE_POS                     (0U)
#define USBFS_HCTSIZ6_XFERSIZE                         (0x0007FFFFUL)
#define USBFS_HCTSIZ6_PKTCNT_POS                       (19U)
#define USBFS_HCTSIZ6_PKTCNT                           (0x1FF80000UL)
#define USBFS_HCTSIZ6_PID_POS                          (29U)
#define USBFS_HCTSIZ6_PID                              (0x60000000UL)
#define USBFS_HCTSIZ6_PID_0                            (0x20000000UL)
#define USBFS_HCTSIZ6_PID_1                            (0x40000000UL)
#define USBFS_HCTSIZ6_DOPNG_POS                        (31U)
#define USBFS_HCTSIZ6_DOPNG                            (0x80000000UL)

/*  Bit definition for USBFS_HCDMA6 register  */
#define USBFS_HCDMA6                                   (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR7 register  */
#define USBFS_HCCHAR7_MPS_POS                          (0U)
#define USBFS_HCCHAR7_MPS                              (0x000007FFUL)
#define USBFS_HCCHAR7_EPNUM_POS                        (11U)
#define USBFS_HCCHAR7_EPNUM                            (0x00007800UL)
#define USBFS_HCCHAR7_EPDIR_POS                        (15U)
#define USBFS_HCCHAR7_EPDIR                            (0x00008000UL)
#define USBFS_HCCHAR7_LSPDDEV_POS                      (17U)
#define USBFS_HCCHAR7_LSPDDEV                          (0x00020000UL)
#define USBFS_HCCHAR7_EPTYPE_POS                       (18U)
#define USBFS_HCCHAR7_EPTYPE                           (0x000C0000UL)
#define USBFS_HCCHAR7_EPTYPE_0                         (0x00040000UL)
#define USBFS_HCCHAR7_EPTYPE_1                         (0x00080000UL)
#define USBFS_HCCHAR7_EC_POS                           (20U)
#define USBFS_HCCHAR7_EC                               (0x00300000UL)
#define USBFS_HCCHAR7_DEVADDR_POS                      (22U)
#define USBFS_HCCHAR7_DEVADDR                          (0x1FC00000UL)
#define USBFS_HCCHAR7_ODDFRM_POS                       (29U)
#define USBFS_HCCHAR7_ODDFRM                           (0x20000000UL)
#define USBFS_HCCHAR7_CHDIS_POS                        (30U)
#define USBFS_HCCHAR7_CHDIS                            (0x40000000UL)
#define USBFS_HCCHAR7_CHENA_POS                        (31U)
#define USBFS_HCCHAR7_CHENA                            (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT7 register  */
#define USBFS_HCSPLT7_PRTADDR_POS                      (0U)
#define USBFS_HCSPLT7_PRTADDR                          (0x0000007FUL)
#define USBFS_HCSPLT7_HUBADDR_POS                      (7U)
#define USBFS_HCSPLT7_HUBADDR                          (0x00003F80UL)
#define USBFS_HCSPLT7_XACTPOS_POS                      (14U)
#define USBFS_HCSPLT7_XACTPOS                          (0x0000C000UL)
#define USBFS_HCSPLT7_XACTPOS_0                        (0x00004000UL)
#define USBFS_HCSPLT7_XACTPOS_1                        (0x00008000UL)
#define USBFS_HCSPLT7_COMPSPLT_POS                     (16U)
#define USBFS_HCSPLT7_COMPSPLT                         (0x00010000UL)
#define USBFS_HCSPLT7_SPLTENA_POS                      (31U)
#define USBFS_HCSPLT7_SPLTENA                          (0x80000000UL)

/*  Bit definition for USBFS_HCINT7 register  */
#define USBFS_HCINT7_XFERCOMPL_POS                     (0U)
#define USBFS_HCINT7_XFERCOMPL                         (0x00000001UL)
#define USBFS_HCINT7_CHHLTD_POS                        (1U)
#define USBFS_HCINT7_CHHLTD                            (0x00000002UL)
#define USBFS_HCINT7_AHBERR_POS                        (2U)
#define USBFS_HCINT7_AHBERR                            (0x00000004UL)
#define USBFS_HCINT7_STALL_POS                         (3U)
#define USBFS_HCINT7_STALL                             (0x00000008UL)
#define USBFS_HCINT7_NAK_POS                           (4U)
#define USBFS_HCINT7_NAK                               (0x00000010UL)
#define USBFS_HCINT7_ACK_POS                           (5U)
#define USBFS_HCINT7_ACK                               (0x00000020UL)
#define USBFS_HCINT7_NYET_POS                          (6U)
#define USBFS_HCINT7_NYET                              (0x00000040UL)
#define USBFS_HCINT7_XACTERR_POS                       (7U)
#define USBFS_HCINT7_XACTERR                           (0x00000080UL)
#define USBFS_HCINT7_BBLERR_POS                        (8U)
#define USBFS_HCINT7_BBLERR                            (0x00000100UL)
#define USBFS_HCINT7_FRMOVRUN_POS                      (9U)
#define USBFS_HCINT7_FRMOVRUN                          (0x00000200UL)
#define USBFS_HCINT7_DATATGLERR_POS                    (10U)
#define USBFS_HCINT7_DATATGLERR                        (0x00000400UL)

/*  Bit definition for USBFS_HCINTMSK7 register  */
#define USBFS_HCINTMSK7_XFERCOMPLMSK_POS               (0U)
#define USBFS_HCINTMSK7_XFERCOMPLMSK                   (0x00000001UL)
#define USBFS_HCINTMSK7_CHHLTDMSK_POS                  (1U)
#define USBFS_HCINTMSK7_CHHLTDMSK                      (0x00000002UL)
#define USBFS_HCINTMSK7_AHBERRMSK_POS                  (2U)
#define USBFS_HCINTMSK7_AHBERRMSK                      (0x00000004UL)
#define USBFS_HCINTMSK7_STALLMSK_POS                   (3U)
#define USBFS_HCINTMSK7_STALLMSK                       (0x00000008UL)
#define USBFS_HCINTMSK7_NAKMSK_POS                     (4U)
#define USBFS_HCINTMSK7_NAKMSK                         (0x00000010UL)
#define USBFS_HCINTMSK7_ACKMSK_POS                     (5U)
#define USBFS_HCINTMSK7_ACKMSK                         (0x00000020UL)
#define USBFS_HCINTMSK7_NYETMSK_POS                    (6U)
#define USBFS_HCINTMSK7_NYETMSK                        (0x00000040UL)
#define USBFS_HCINTMSK7_XACTERRMSK_POS                 (7U)
#define USBFS_HCINTMSK7_XACTERRMSK                     (0x00000080UL)
#define USBFS_HCINTMSK7_BBLERRMSK_POS                  (8U)
#define USBFS_HCINTMSK7_BBLERRMSK                      (0x00000100UL)
#define USBFS_HCINTMSK7_FRMOVRUNMSK_POS                (9U)
#define USBFS_HCINTMSK7_FRMOVRUNMSK                    (0x00000200UL)
#define USBFS_HCINTMSK7_DATATGLERRMSK_POS              (10U)
#define USBFS_HCINTMSK7_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ7 register  */
#define USBFS_HCTSIZ7_XFERSIZE_POS                     (0U)
#define USBFS_HCTSIZ7_XFERSIZE                         (0x0007FFFFUL)
#define USBFS_HCTSIZ7_PKTCNT_POS                       (19U)
#define USBFS_HCTSIZ7_PKTCNT                           (0x1FF80000UL)
#define USBFS_HCTSIZ7_PID_POS                          (29U)
#define USBFS_HCTSIZ7_PID                              (0x60000000UL)
#define USBFS_HCTSIZ7_PID_0                            (0x20000000UL)
#define USBFS_HCTSIZ7_PID_1                            (0x40000000UL)
#define USBFS_HCTSIZ7_DOPNG_POS                        (31U)
#define USBFS_HCTSIZ7_DOPNG                            (0x80000000UL)

/*  Bit definition for USBFS_HCDMA7 register  */
#define USBFS_HCDMA7                                   (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR8 register  */
#define USBFS_HCCHAR8_MPS_POS                          (0U)
#define USBFS_HCCHAR8_MPS                              (0x000007FFUL)
#define USBFS_HCCHAR8_EPNUM_POS                        (11U)
#define USBFS_HCCHAR8_EPNUM                            (0x00007800UL)
#define USBFS_HCCHAR8_EPDIR_POS                        (15U)
#define USBFS_HCCHAR8_EPDIR                            (0x00008000UL)
#define USBFS_HCCHAR8_LSPDDEV_POS                      (17U)
#define USBFS_HCCHAR8_LSPDDEV                          (0x00020000UL)
#define USBFS_HCCHAR8_EPTYPE_POS                       (18U)
#define USBFS_HCCHAR8_EPTYPE                           (0x000C0000UL)
#define USBFS_HCCHAR8_EPTYPE_0                         (0x00040000UL)
#define USBFS_HCCHAR8_EPTYPE_1                         (0x00080000UL)
#define USBFS_HCCHAR8_EC_POS                           (20U)
#define USBFS_HCCHAR8_EC                               (0x00300000UL)
#define USBFS_HCCHAR8_DEVADDR_POS                      (22U)
#define USBFS_HCCHAR8_DEVADDR                          (0x1FC00000UL)
#define USBFS_HCCHAR8_ODDFRM_POS                       (29U)
#define USBFS_HCCHAR8_ODDFRM                           (0x20000000UL)
#define USBFS_HCCHAR8_CHDIS_POS                        (30U)
#define USBFS_HCCHAR8_CHDIS                            (0x40000000UL)
#define USBFS_HCCHAR8_CHENA_POS                        (31U)
#define USBFS_HCCHAR8_CHENA                            (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT8 register  */
#define USBFS_HCSPLT8_PRTADDR_POS                      (0U)
#define USBFS_HCSPLT8_PRTADDR                          (0x0000007FUL)
#define USBFS_HCSPLT8_HUBADDR_POS                      (7U)
#define USBFS_HCSPLT8_HUBADDR                          (0x00003F80UL)
#define USBFS_HCSPLT8_XACTPOS_POS                      (14U)
#define USBFS_HCSPLT8_XACTPOS                          (0x0000C000UL)
#define USBFS_HCSPLT8_XACTPOS_0                        (0x00004000UL)
#define USBFS_HCSPLT8_XACTPOS_1                        (0x00008000UL)
#define USBFS_HCSPLT8_COMPSPLT_POS                     (16U)
#define USBFS_HCSPLT8_COMPSPLT                         (0x00010000UL)
#define USBFS_HCSPLT8_SPLTENA_POS                      (31U)
#define USBFS_HCSPLT8_SPLTENA                          (0x80000000UL)

