levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_HCINT8 register  */
#define USBFS_HCINT8_XFERCOMPL_POS                     (0U)
#define USBFS_HCINT8_XFERCOMPL                         (0x00000001UL)
#define USBFS_HCINT8_CHHLTD_POS                        (1U)
#define USBFS_HCINT8_CHHLTD                            (0x00000002UL)
#define USBFS_HCINT8_AHBERR_POS                        (2U)
#define USBFS_HCINT8_AHBERR                            (0x00000004UL)
#define USBFS_HCINT8_STALL_POS                         (3U)
#define USBFS_HCINT8_STALL                             (0x00000008UL)
#define USBFS_HCINT8_NAK_POS                           (4U)
#define USBFS_HCINT8_NAK                               (0x00000010UL)
#define USBFS_HCINT8_ACK_POS                           (5U)
#define USBFS_HCINT8_ACK                               (0x00000020UL)
#define USBFS_HCINT8_NYET_POS                          (6U)
#define USBFS_HCINT8_NYET                              (0x00000040UL)
#define USBFS_HCINT8_XACTERR_POS                       (7U)
#define USBFS_HCINT8_XACTERR                           (0x00000080UL)
#define USBFS_HCINT8_BBLERR_POS                        (8U)
#define USBFS_HCINT8_BBLERR                            (0x00000100UL)
#define USBFS_HCINT8_FRMOVRUN_POS                      (9U)
#define USBFS_HCINT8_FRMOVRUN                          (0x00000200UL)
#define USBFS_HCINT8_DATATGLERR_POS                    (10U)
#define USBFS_HCINT8_DATATGLERR                        (0x00000400UL)

/*  Bit definition for USBFS_HCINTMSK8 register  */
#define USBFS_HCINTMSK8_XFERCOMPLMSK_POS               (0U)
#define USBFS_HCINTMSK8_XFERCOMPLMSK                   (0x00000001UL)
#define USBFS_HCINTMSK8_CHHLTDMSK_POS                  (1U)
#define USBFS_HCINTMSK8_CHHLTDMSK                      (0x00000002UL)
#define USBFS_HCINTMSK8_AHBERRMSK_POS                  (2U)
#define USBFS_HCINTMSK8_AHBERRMSK                      (0x00000004UL)
#define USBFS_HCINTMSK8_STALLMSK_POS                   (3U)
#define USBFS_HCINTMSK8_STALLMSK                       (0x00000008UL)
#define USBFS_HCINTMSK8_NAKMSK_POS                     (4U)
#define USBFS_HCINTMSK8_NAKMSK                         (0x00000010UL)
#define USBFS_HCINTMSK8_ACKMSK_POS                     (5U)
#define USBFS_HCINTMSK8_ACKMSK                         (0x00000020UL)
#define USBFS_HCINTMSK8_NYETMSK_POS                    (6U)
#define USBFS_HCINTMSK8_NYETMSK                        (0x00000040UL)
#define USBFS_HCINTMSK8_XACTERRMSK_POS                 (7U)
#define USBFS_HCINTMSK8_XACTERRMSK                     (0x00000080UL)
#define USBFS_HCINTMSK8_BBLERRMSK_POS                  (8U)
#define USBFS_HCINTMSK8_BBLERRMSK                      (0x00000100UL)
#define USBFS_HCINTMSK8_FRMOVRUNMSK_POS                (9U)
#define USBFS_HCINTMSK8_FRMOVRUNMSK                    (0x00000200UL)
#define USBFS_HCINTMSK8_DATATGLERRMSK_POS              (10U)
#define USBFS_HCINTMSK8_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ8 register  */
#define USBFS_HCTSIZ8_XFERSIZE_POS                     (0U)
#define USBFS_HCTSIZ8_XFERSIZE                         (0x0007FFFFUL)
#define USBFS_HCTSIZ8_PKTCNT_POS                       (19U)
#define USBFS_HCTSIZ8_PKTCNT                           (0x1FF80000UL)
#define USBFS_HCTSIZ8_PID_POS                          (29U)
#define USBFS_HCTSIZ8_PID                              (0x60000000UL)
#define USBFS_HCTSIZ8_PID_0                            (0x20000000UL)
#define USBFS_HCTSIZ8_PID_1                            (0x40000000UL)
#define USBFS_HCTSIZ8_DOPNG_POS                        (31U)
#define USBFS_HCTSIZ8_DOPNG                            (0x80000000UL)

/*  Bit definition for USBFS_HCDMA8 register  */
#define USBFS_HCDMA8                                   (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR9 register  */
#define USBFS_HCCHAR9_MPS_POS                          (0U)
#define USBFS_HCCHAR9_MPS                              (0x000007FFUL)
#define USBFS_HCCHAR9_EPNUM_POS                        (11U)
#define USBFS_HCCHAR9_EPNUM                            (0x00007800UL)
#define USBFS_HCCHAR9_EPDIR_POS                        (15U)
#define USBFS_HCCHAR9_EPDIR                            (0x00008000UL)
#define USBFS_HCCHAR9_LSPDDEV_POS                      (17U)
#define USBFS_HCCHAR9_LSPDDEV                          (0x00020000UL)
#define USBFS_HCCHAR9_EPTYPE_POS                       (18U)
#define USBFS_HCCHAR9_EPTYPE                           (0x000C0000UL)
#define USBFS_HCCHAR9_EPTYPE_0                         (0x00040000UL)
#define USBFS_HCCHAR9_EPTYPE_1                         (0x00080000UL)
#define USBFS_HCCHAR9_EC_POS                           (20U)
#define USBFS_HCCHAR9_EC                               (0x00300000UL)
#define USBFS_HCCHAR9_DEVADDR_POS                      (22U)
#define USBFS_HCCHAR9_DEVADDR                          (0x1FC00000UL)
#define USBFS_HCCHAR9_ODDFRM_POS                       (29U)
#define USBFS_HCCHAR9_ODDFRM                           (0x20000000UL)
#define USBFS_HCCHAR9_CHDIS_POS                        (30U)
#define USBFS_HCCHAR9_CHDIS                            (0x40000000UL)
#define USBFS_HCCHAR9_CHENA_POS                        (31U)
#define USBFS_HCCHAR9_CHENA                            (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT9 register  */
#define USBFS_HCSPLT9_PRTADDR_POS                      (0U)
#define USBFS_HCSPLT9_PRTADDR                          (0x0000007FUL)
#define USBFS_HCSPLT9_HUBADDR_POS                      (7U)
#define USBFS_HCSPLT9_HUBADDR                          (0x00003F80UL)
#define USBFS_HCSPLT9_XACTPOS_POS                      (14U)
#define USBFS_HCSPLT9_XACTPOS                          (0x0000C000UL)
#define USBFS_HCSPLT9_XACTPOS_0                        (0x00004000UL)
#define USBFS_HCSPLT9_XACTPOS_1                        (0x00008000UL)
#define USBFS_HCSPLT9_COMPSPLT_POS                     (16U)
#define USBFS_HCSPLT9_COMPSPLT                         (0x00010000UL)
#define USBFS_HCSPLT9_SPLTENA_POS                      (31U)
#define USBFS_HCSPLT9_SPLTENA                          (0x80000000UL)

/*  Bit definition for USBFS_HCINT9 register  */
#define USBFS_HCINT9_XFERCOMPL_POS                     (0U)
#define USBFS_HCINT9_XFERCOMPL                         (0x00000001UL)
#define USBFS_HCINT9_CHHLTD_POS                        (1U)
#define USBFS_HCINT9_CHHLTD                            (0x00000002UL)
#define USBFS_HCINT9_AHBERR_POS                        (2U)
#define USBFS_HCINT9_AHBERR                            (0x00000004UL)
#define USBFS_HCINT9_STALL_POS                         (3U)
#define USBFS_HCINT9_STALL                             (0x00000008UL)
#define USBFS_HCINT9_NAK_POS                           (4U)
#define USBFS_HCINT9_NAK                               (0x00000010UL)
#define USBFS_HCINT9_ACK_POS                           (5U)
#define USBFS_HCINT9_ACK                               (0x00000020UL)
#define USBFS_HCINT9_NYET_POS                          (6U)
#define USBFS_HCINT9_NYET                              (0x00000040UL)
#define USBFS_HCINT9_XACTERR_POS                       (7U)
#define USBFS_HCINT9_XACTERR                           (0x00000080UL)
#define USBFS_HCINT9_BBLERR_POS                        (8U)
#define USBFS_HCINT9_BBLERR                            (0x00000100UL)
#define USBFS_HCINT9_FRMOVRUN_POS                      (9U)
#define USBFS_HCINT9_FRMOVRUN                          (0x00000200UL)
#define USBFS_HCINT9_DATATGLERR_POS                    (10U)
#define USBFS_HCINT9_DATATGLERR                        (0x00000400UL)

/*  Bit definition for USBFS_HCINTMSK9 register  */
#define USBFS_HCINTMSK9_XFERCOMPLMSK_POS               (0U)
#define USBFS_HCINTMSK9_XFERCOMPLMSK                   (0x00000001UL)
#define USBFS_HCINTMSK9_CHHLTDMSK_POS                  (1U)
#define USBFS_HCINTMSK9_CHHLTDMSK                      (0x00000002UL)
#define USBFS_HCINTMSK9_AHBERRMSK_POS                  (2U)
#define USBFS_HCINTMSK9_AHBERRMSK                      (0x00000004UL)
#define USBFS_HCINTMSK9_STALLMSK_POS                   (3U)
#define USBFS_HCINTMSK9_STALLMSK                       (0x00000008UL)
#define USBFS_HCINTMSK9_NAKMSK_POS                     (4U)
#define USBFS_HCINTMSK9_NAKMSK                         (0x00000010UL)
#define USBFS_HCINTMSK9_ACKMSK_POS                     (5U)
#define USBFS_HCINTMSK9_ACKMSK                         (0x00000020UL)
#define USBFS_HCINTMSK9_NYETMSK_POS                    (6U)
#define USBFS_HCINTMSK9_NYETMSK                        (0x00000040UL)
#define USBFS_HCINTMSK9_XACTERRMSK_POS                 (7U)
#define USBFS_HCINTMSK9_XACTERRMSK                     (0x00000080UL)
#define USBFS_HCINTMSK9_BBLERRMSK_POS                  (8U)
#define USBFS_HCINTMSK9_BBLERRMSK                      (0x00000100UL)
#define USBFS_HCINTMSK9_FRMOVRUNMSK_POS                (9U)
#define USBFS_HCINTMSK9_FRMOVRUNMSK                    (0x00000200UL)
#define USBFS_HCINTMSK9_DATATGLERRMSK_POS              (10U)
#define USBFS_HCINTMSK9_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ9 register  */
#define USBFS_HCTSIZ9_XFERSIZE_POS                     (0U)
#define USBFS_HCTSIZ9_XFERSIZE                         (0x0007FFFFUL)
#define USBFS_HCTSIZ9_PKTCNT_POS                       (19U)
#define USBFS_HCTSIZ9_PKTCNT                           (0x1FF80000UL)
#define USBFS_HCTSIZ9_PID_POS                          (29U)
#define USBFS_HCTSIZ9_PID                              (0x60000000UL)
#define USBFS_HCTSIZ9_PID_0                            (0x20000000UL)
#define USBFS_HCTSIZ9_PID_1                            (0x40000000UL)
#define USBFS_HCTSIZ9_DOPNG_POS                        (31U)
#define USBFS_HCTSIZ9_DOPNG                            (0x80000000UL)

/*  Bit definition for USBFS_HCDMA9 register  */
#define USBFS_HCDMA9                                   (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR10 register  */
#define USBFS_HCCHAR10_MPS_POS                         (0U)
#define USBFS_HCCHAR10_MPS                             (0x000007FFUL)
#define USBFS_HCCHAR10_EPNUM_POS                       (11U)
#define USBFS_HCCHAR10_EPNUM                           (0x00007800UL)
#define USBFS_HCCHAR10_EPDIR_POS                       (15U)
#define USBFS_HCCHAR10_EPDIR                           (0x00008000UL)
#define USBFS_HCCHAR10_LSPDDEV_POS                     (17U)
#define USBFS_HCCHAR10_LSPDDEV                         (0x00020000UL)
#define USBFS_HCCHAR10_EPTYPE_POS                      (18U)
#define USBFS_HCCHAR10_EPTYPE                          (0x000C0000UL)
#define USBFS_HCCHAR10_EPTYPE_0                        (0x00040000UL)
#define USBFS_HCCHAR10_EPTYPE_1                        (0x00080000UL)
#define USBFS_HCCHAR10_EC_POS                          (20U)
#define USBFS_HCCHAR10_EC                              (0x00300000UL)
#define USBFS_HCCHAR10_DEVADDR_POS                     (22U)
#define USBFS_HCCHAR10_DEVADDR                         (0x1FC00000UL)
#define USBFS_HCCHAR10_ODDFRM_POS                      (29U)
#define USBFS_HCCHAR10_ODDFRM                          (0x20000000UL)
#define USBFS_HCCHAR10_CHDIS_POS                       (30U)
#define USBFS_HCCHAR10_CHDIS                           (0x40000000UL)
#define USBFS_HCCHAR10_CHENA_POS                       (31U)
#define USBFS_HCCHAR10_CHENA                           (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT10 register  */
#define USBFS_HCSPLT10_PRTADDR_POS                     (0U)
#define USBFS_HCSPLT10_PRTADDR                         (0x0000007FUL)
#define USBFS_HCSPLT10_HUBADDR_POS                     (7U)
#define USBFS_HCSPLT10_HUBADDR                         (0x00003F80UL)
#define USBFS_HCSPLT10_XACTPOS_POS                     (14U)
#define USBFS_HCSPLT10_XACTPOS                         (0x0000C000UL)
#define USBFS_HCSPLT10_XACTPOS_0                       (0x00004000UL)
#define USBFS_HCSPLT10_XACTPOS_1                       (0x00008000UL)
#define USBFS_HCSPLT10_COMPSPLT_POS                    (16U)
#define USBFS_HCSPLT10_COMPSPLT                        (0x00010000UL)
#define USBFS_HCSPLT10_SPLTENA_POS                     (31U)
#define USBFS_HCSPLT10_SPLTENA                         (0x80000000UL)

