levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_HCINT10 register  */
#define USBFS_HCINT10_XFERCOMPL_POS                    (0U)
#define USBFS_HCINT10_XFERCOMPL                        (0x00000001UL)
#define USBFS_HCINT10_CHHLTD_POS                       (1U)
#define USBFS_HCINT10_CHHLTD                           (0x00000002UL)
#define USBFS_HCINT10_AHBERR_POS                       (2U)
#define USBFS_HCINT10_AHBERR                           (0x00000004UL)
#define USBFS_HCINT10_STALL_POS                        (3U)
#define USBFS_HCINT10_STALL                            (0x00000008UL)
#define USBFS_HCINT10_NAK_POS                          (4U)
#define USBFS_HCINT10_NAK                              (0x00000010UL)
#define USBFS_HCINT10_ACK_POS                          (5U)
#define USBFS_HCINT10_ACK                              (0x00000020UL)
#define USBFS_HCINT10_NYET_POS                         (6U)
#define USBFS_HCINT10_NYET                             (0x00000040UL)
#define USBFS_HCINT10_XACTERR_POS                      (7U)
#define USBFS_HCINT10_XACTERR                          (0x00000080UL)
#define USBFS_HCINT10_BBLERR_POS                       (8U)
#define USBFS_HCINT10_BBLERR                           (0x00000100UL)
#define USBFS_HCINT10_FRMOVRUN_POS                     (9U)
#define USBFS_HCINT10_FRMOVRUN                         (0x00000200UL)
#define USBFS_HCINT10_DATATGLERR_POS                   (10U)
#define USBFS_HCINT10_DATATGLERR                       (0x00000400UL)

/*  Bit definition for USBFS_HCINTMSK10 register  */
#define USBFS_HCINTMSK10_XFERCOMPLMSK_POS              (0U)
#define USBFS_HCINTMSK10_XFERCOMPLMSK                  (0x00000001UL)
#define USBFS_HCINTMSK10_CHHLTDMSK_POS                 (1U)
#define USBFS_HCINTMSK10_CHHLTDMSK                     (0x00000002UL)
#define USBFS_HCINTMSK10_AHBERRMSK_POS                 (2U)
#define USBFS_HCINTMSK10_AHBERRMSK                     (0x00000004UL)
#define USBFS_HCINTMSK10_STALLMSK_POS                  (3U)
#define USBFS_HCINTMSK10_STALLMSK                      (0x00000008UL)
#define USBFS_HCINTMSK10_NAKMSK_POS                    (4U)
#define USBFS_HCINTMSK10_NAKMSK                        (0x00000010UL)
#define USBFS_HCINTMSK10_ACKMSK_POS                    (5U)
#define USBFS_HCINTMSK10_ACKMSK                        (0x00000020UL)
#define USBFS_HCINTMSK10_NYETMSK_POS                   (6U)
#define USBFS_HCINTMSK10_NYETMSK                       (0x00000040UL)
#define USBFS_HCINTMSK10_XACTERRMSK_POS                (7U)
#define USBFS_HCINTMSK10_XACTERRMSK                    (0x00000080UL)
#define USBFS_HCINTMSK10_BBLERRMSK_POS                 (8U)
#define USBFS_HCINTMSK10_BBLERRMSK                     (0x00000100UL)
#define USBFS_HCINTMSK10_FRMOVRUNMSK_POS               (9U)
#define USBFS_HCINTMSK10_FRMOVRUNMSK                   (0x00000200UL)
#define USBFS_HCINTMSK10_DATATGLERRMSK_POS             (10U)
#define USBFS_HCINTMSK10_DATATGLERRMSK                 (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ10 register  */
#define USBFS_HCTSIZ10_XFERSIZE_POS                    (0U)
#define USBFS_HCTSIZ10_XFERSIZE                        (0x0007FFFFUL)
#define USBFS_HCTSIZ10_PKTCNT_POS                      (19U)
#define USBFS_HCTSIZ10_PKTCNT                          (0x1FF80000UL)
#define USBFS_HCTSIZ10_PID_POS                         (29U)
#define USBFS_HCTSIZ10_PID                             (0x60000000UL)
#define USBFS_HCTSIZ10_PID_0                           (0x20000000UL)
#define USBFS_HCTSIZ10_PID_1                           (0x40000000UL)
#define USBFS_HCTSIZ10_DOPNG_POS                       (31U)
#define USBFS_HCTSIZ10_DOPNG                           (0x80000000UL)

/*  Bit definition for USBFS_HCDMA10 register  */
#define USBFS_HCDMA10                                  (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR11 register  */
#define USBFS_HCCHAR11_MPS_POS                         (0U)
#define USBFS_HCCHAR11_MPS                             (0x000007FFUL)
#define USBFS_HCCHAR11_EPNUM_POS                       (11U)
#define USBFS_HCCHAR11_EPNUM                           (0x00007800UL)
#define USBFS_HCCHAR11_EPDIR_POS                       (15U)
#define USBFS_HCCHAR11_EPDIR                           (0x00008000UL)
#define USBFS_HCCHAR11_LSPDDEV_POS                     (17U)
#define USBFS_HCCHAR11_LSPDDEV                         (0x00020000UL)
#define USBFS_HCCHAR11_EPTYPE_POS                      (18U)
#define USBFS_HCCHAR11_EPTYPE                          (0x000C0000UL)
#define USBFS_HCCHAR11_EPTYPE_0                        (0x00040000UL)
#define USBFS_HCCHAR11_EPTYPE_1                        (0x00080000UL)
#define USBFS_HCCHAR11_EC_POS                          (20U)
#define USBFS_HCCHAR11_EC                              (0x00300000UL)
#define USBFS_HCCHAR11_DEVADDR_POS                     (22U)
#define USBFS_HCCHAR11_DEVADDR                         (0x1FC00000UL)
#define USBFS_HCCHAR11_ODDFRM_POS                      (29U)
#define USBFS_HCCHAR11_ODDFRM                          (0x20000000UL)
#define USBFS_HCCHAR11_CHDIS_POS                       (30U)
#define USBFS_HCCHAR11_CHDIS                           (0x40000000UL)
#define USBFS_HCCHAR11_CHENA_POS                       (31U)
#define USBFS_HCCHAR11_CHENA                           (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT11 register  */
#define USBFS_HCSPLT11_PRTADDR_POS                     (0U)
#define USBFS_HCSPLT11_PRTADDR                         (0x0000007FUL)
#define USBFS_HCSPLT11_HUBADDR_POS                     (7U)
#define USBFS_HCSPLT11_HUBADDR                         (0x00003F80UL)
#define USBFS_HCSPLT11_XACTPOS_POS                     (14U)
#define USBFS_HCSPLT11_XACTPOS                         (0x0000C000UL)
#define USBFS_HCSPLT11_XACTPOS_0                       (0x00004000UL)
#define USBFS_HCSPLT11_XACTPOS_1                       (0x00008000UL)
#define USBFS_HCSPLT11_COMPSPLT_POS                    (16U)
#define USBFS_HCSPLT11_COMPSPLT                        (0x00010000UL)
#define USBFS_HCSPLT11_SPLTENA_POS                     (31U)
#define USBFS_HCSPLT11_SPLTENA                         (0x80000000UL)

/*  Bit definition for USBFS_HCINT11 register  */
#define USBFS_HCINT11_XFERCOMPL_POS                    (0U)
#define USBFS_HCINT11_XFERCOMPL                        (0x00000001UL)
#define USBFS_HCINT11_CHHLTD_POS                       (1U)
#define USBFS_HCINT11_CHHLTD                           (0x00000002UL)
#define USBFS_HCINT11_AHBERR_POS                       (2U)
#define USBFS_HCINT11_AHBERR                           (0x00000004UL)
#define USBFS_HCINT11_STALL_POS                        (3U)
#define USBFS_HCINT11_STALL                            (0x00000008UL)
#define USBFS_HCINT11_NAK_POS                          (4U)
#define USBFS_HCINT11_NAK                              (0x00000010UL)
#define USBFS_HCINT11_ACK_POS                          (5U)
#define USBFS_HCINT11_ACK                              (0x00000020UL)
#define USBFS_HCINT11_NYET_POS                         (6U)
#define USBFS_HCINT11_NYET                             (0x00000040UL)
#define USBFS_HCINT11_XACTERR_POS                      (7U)
#define USBFS_HCINT11_XACTERR                          (0x00000080UL)
#define USBFS_HCINT11_BBLERR_POS                       (8U)
#define USBFS_HCINT11_BBLERR                           (0x00000100UL)
#define USBFS_HCINT11_FRMOVRUN_POS                     (9U)
#define USBFS_HCINT11_FRMOVRUN                         (0x00000200UL)
#define USBFS_HCINT11_DATATGLERR_POS                   (10U)
#define USBFS_HCINT11_DATATGLERR                       (0x00000400UL)

/*  Bit definition for USBFS_HCINTMSK11 register  */
#define USBFS_HCINTMSK11_XFERCOMPLMSK_POS              (0U)
#define USBFS_HCINTMSK11_XFERCOMPLMSK                  (0x00000001UL)
#define USBFS_HCINTMSK11_CHHLTDMSK_POS                 (1U)
#define USBFS_HCINTMSK11_CHHLTDMSK                     (0x00000002UL)
#define USBFS_HCINTMSK11_AHBERRMSK_POS                 (2U)
#define USBFS_HCINTMSK11_AHBERRMSK                     (0x00000004UL)
#define USBFS_HCINTMSK11_STALLMSK_POS                  (3U)
#define USBFS_HCINTMSK11_STALLMSK                      (0x00000008UL)
#define USBFS_HCINTMSK11_NAKMSK_POS                    (4U)
#define USBFS_HCINTMSK11_NAKMSK                        (0x00000010UL)
#define USBFS_HCINTMSK11_ACKMSK_POS                    (5U)
#define USBFS_HCINTMSK11_ACKMSK                        (0x00000020UL)
#define USBFS_HCINTMSK11_NYETMSK_POS                   (6U)
#define USBFS_HCINTMSK11_NYETMSK                       (0x00000040UL)
#define USBFS_HCINTMSK11_XACTERRMSK_POS                (7U)
#define USBFS_HCINTMSK11_XACTERRMSK                    (0x00000080UL)
#define USBFS_HCINTMSK11_BBLERRMSK_POS                 (8U)
#define USBFS_HCINTMSK11_BBLERRMSK                     (0x00000100UL)
#define USBFS_HCINTMSK11_FRMOVRUNMSK_POS               (9U)
#define USBFS_HCINTMSK11_FRMOVRUNMSK                   (0x00000200UL)
#define USBFS_HCINTMSK11_DATATGLERRMSK_POS             (10U)
#define USBFS_HCINTMSK11_DATATGLERRMSK                 (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ11 register  */
#define USBFS_HCTSIZ11_XFERSIZE_POS                    (0U)
#define USBFS_HCTSIZ11_XFERSIZE                        (0x0007FFFFUL)
#define USBFS_HCTSIZ11_PKTCNT_POS                      (19U)
#define USBFS_HCTSIZ11_PKTCNT                          (0x1FF80000UL)
#define USBFS_HCTSIZ11_PID_POS                         (29U)
#define USBFS_HCTSIZ11_PID                             (0x60000000UL)
#define USBFS_HCTSIZ11_PID_0                           (0x20000000UL)
#define USBFS_HCTSIZ11_PID_1                           (0x40000000UL)
#define USBFS_HCTSIZ11_DOPNG_POS                       (31U)
#define USBFS_HCTSIZ11_DOPNG                           (0x80000000UL)

/*  Bit definition for USBFS_HCDMA11 register  */
#define USBFS_HCDMA11                                  (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR12 register  */
#define USBFS_HCCHAR12_MPS_POS                         (0U)
#define USBFS_HCCHAR12_MPS                             (0x000007FFUL)
#define USBFS_HCCHAR12_EPNUM_POS                       (11U)
#define USBFS_HCCHAR12_EPNUM                           (0x00007800UL)
#define USBFS_HCCHAR12_EPDIR_POS                       (15U)
#define USBFS_HCCHAR12_EPDIR                           (0x00008000UL)
#define USBFS_HCCHAR12_LSPDDEV_POS                     (17U)
#define USBFS_HCCHAR12_LSPDDEV                         (0x00020000UL)
#define USBFS_HCCHAR12_EPTYPE_POS                      (18U)
#define USBFS_HCCHAR12_EPTYPE                          (0x000C0000UL)
#define USBFS_HCCHAR12_EPTYPE_0                        (0x00040000UL)
#define USBFS_HCCHAR12_EPTYPE_1                        (0x00080000UL)
#define USBFS_HCCHAR12_EC_POS                          (20U)
#define USBFS_HCCHAR12_EC                              (0x00300000UL)
#define USBFS_HCCHAR12_DEVADDR_POS                     (22U)
#define USBFS_HCCHAR12_DEVADDR                         (0x1FC00000UL)
#define USBFS_HCCHAR12_ODDFRM_POS                      (29U)
#define USBFS_HCCHAR12_ODDFRM                          (0x20000000UL)
#define USBFS_HCCHAR12_CHDIS_POS                       (30U)
#define USBFS_HCCHAR12_CHDIS                           (0x40000000UL)
#define USBFS_HCCHAR12_CHENA_POS                       (31U)
#define USBFS_HCCHAR12_CHENA                           (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT12 register  */
#define USBFS_HCSPLT12_PRTADDR_POS                     (0U)
#define USBFS_HCSPLT12_PRTADDR                         (0x0000007FUL)
#define USBFS_HCSPLT12_HUBADDR_POS                     (7U)
#define USBFS_HCSPLT12_HUBADDR                         (0x00003F80UL)
#define USBFS_HCSPLT12_XACTPOS_POS                     (14U)
#define USBFS_HCSPLT12_XACTPOS                         (0x0000C000UL)
#define USBFS_HCSPLT12_XACTPOS_0                       (0x00004000UL)
#define USBFS_HCSPLT12_XACTPOS_1                       (0x00008000UL)
#define USBFS_HCSPLT12_COMPSPLT_POS                    (16U)
#define USBFS_HCSPLT12_COMPSPLT                        (0x00010000UL)
#define USBFS_HCSPLT12_SPLTENA_POS                     (31U)
#define USBFS_HCSPLT12_SPLTENA                         (0x80000000UL)

/*  Bit definition for USBFS_HCINT12 register  */
#define USBFS_HCINT12_XFERCOMPL_POS                    (0U)
#define USBFS_HCINT12_XFERCOMPL                        (0x00000001UL)
#define USBFS_HCINT12_CHHLTD_POS                       (1U)
#define USBFS_HCINT12_CHHLTD                           (0x00000002UL)
#define USBFS_HCINT12_AHBERR_POS                       (2U)
#define USBFS_HCINT12_AHBERR                           (0x00000004UL)
#define USBFS_HCINT12_STALL_POS                        (3U)
#define USBFS_HCINT12_STALL                            (0x00000008UL)
#define USBFS_HCINT12_NAK_POS                          (4U)
#define USBFS_HCINT12_NAK                              (0x00000010UL)
#define USBFS_HCINT12_ACK_POS                          (5U)
#define USBFS_HCINT12_ACK                              (0x00000020UL)
#define USBFS_HCINT12_NYET_POS                         (6U)
#define USBFS_HCINT12_NYET                             (0x00000040UL)
#define USBFS_HCINT12_XACTERR_POS                      (7U)
#define USBFS_HCINT12_XACTERR                          (0x00000080UL)
#define USBFS_HCINT12_BBLERR_POS                       (8U)
#define USBFS_HCINT12_BBLERR                           (0x00000100UL)
#define USBFS_HCINT12_FRMOVRUN_POS                     (9U)
#define USBFS_HCINT12_FRMOVRUN                         (0x00000200UL)
#define USBFS_HCINT12_DATATGLERR_POS                   (10U)
#define USBFS_HCINT12_DATATGLERR                       (0x00000400UL)

/*  Bit definition for USBFS_HCINTMSK12 register  */
#define USBFS_HCINTMSK12_XFERCOMPLMSK_POS              (0U)
#define USBFS_HCINTMSK12_XFERCOMPLMSK                  (0x00000001UL)
#define USBFS_HCINTMSK12_CHHLTDMSK_POS                 (1U)
#define USBFS_HCINTMSK12_CHHLTDMSK                     (0x00000002UL)
#define USBFS_HCINTMSK12_AHBERRMSK_POS                 (2U)
#define USBFS_HCINTMSK12_AHBERRMSK                     (0x00000004UL)
#define USBFS_HCINTMSK12_STALLMSK_POS                  (3U)
#define USBFS_HCINTMSK12_STALLMSK                      (0x00000008UL)
#define USBFS_HCINTMSK12_NAKMSK_POS                    (4U)
#define USBFS_HCINTMSK12_NAKMSK                        (0x00000010UL)
#define USBFS_HCINTMSK12_ACKMSK_POS                    (5U)
#define USBFS_HCINTMSK12_ACKMSK                        (0x00000020UL)
#define USBFS_HCINTMSK12_NYETMSK_POS                   (6U)
#define USBFS_HCINTMSK12_NYETMSK                       (0x00000040UL)
#define USBFS_HCINTMSK12_XACTERRMSK_POS                (7U)
#define USBFS_HCINTMSK12_XACTERRMSK                    (0x00000080UL)
#define USBFS_HCINTMSK12_BBLERRMSK_POS                 (8U)
#define USBFS_HCINTMSK12_BBLERRMSK                     (0x00000100UL)
#define USBFS_HCINTMSK12_FRMOVRUNMSK_POS               (9U)
#define USBFS_HCINTMSK12_FRMOVRUNMSK                   (0x00000200UL)
#define USBFS_HCINTMSK12_DATATGLERRMSK_POS             (10U)
#define USBFS_HCINTMSK12_DATATGLERRMSK                 (0x00000400UL)

