levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_HCTSIZ12 register  */
#define USBFS_HCTSIZ12_XFERSIZE_POS                    (0U)
#define USBFS_HCTSIZ12_XFERSIZE                        (0x0007FFFFUL)
#define USBFS_HCTSIZ12_PKTCNT_POS                      (19U)
#define USBFS_HCTSIZ12_PKTCNT                          (0x1FF80000UL)
#define USBFS_HCTSIZ12_PID_POS                         (29U)
#define USBFS_HCTSIZ12_PID                             (0x60000000UL)
#define USBFS_HCTSIZ12_PID_0                           (0x20000000UL)
#define USBFS_HCTSIZ12_PID_1                           (0x40000000UL)
#define USBFS_HCTSIZ12_DOPNG_POS                       (31U)
#define USBFS_HCTSIZ12_DOPNG                           (0x80000000UL)

/*  Bit definition for USBFS_HCDMA12 register  */
#define USBFS_HCDMA12                                  (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR13 register  */
#define USBFS_HCCHAR13_MPS_POS                         (0U)
#define USBFS_HCCHAR13_MPS                             (0x000007FFUL)
#define USBFS_HCCHAR13_EPNUM_POS                       (11U)
#define USBFS_HCCHAR13_EPNUM                           (0x00007800UL)
#define USBFS_HCCHAR13_EPDIR_POS                       (15U)
#define USBFS_HCCHAR13_EPDIR                           (0x00008000UL)
#define USBFS_HCCHAR13_LSPDDEV_POS                     (17U)
#define USBFS_HCCHAR13_LSPDDEV                         (0x00020000UL)
#define USBFS_HCCHAR13_EPTYPE_POS                      (18U)
#define USBFS_HCCHAR13_EPTYPE                          (0x000C0000UL)
#define USBFS_HCCHAR13_EPTYPE_0                        (0x00040000UL)
#define USBFS_HCCHAR13_EPTYPE_1                        (0x00080000UL)
#define USBFS_HCCHAR13_EC_POS                          (20U)
#define USBFS_HCCHAR13_EC                              (0x00300000UL)
#define USBFS_HCCHAR13_DEVADDR_POS                     (22U)
#define USBFS_HCCHAR13_DEVADDR                         (0x1FC00000UL)
#define USBFS_HCCHAR13_ODDFRM_POS                      (29U)
#define USBFS_HCCHAR13_ODDFRM                          (0x20000000UL)
#define USBFS_HCCHAR13_CHDIS_POS                       (30U)
#define USBFS_HCCHAR13_CHDIS                           (0x40000000UL)
#define USBFS_HCCHAR13_CHENA_POS                       (31U)
#define USBFS_HCCHAR13_CHENA                           (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT13 register  */
#define USBFS_HCSPLT13_PRTADDR_POS                     (0U)
#define USBFS_HCSPLT13_PRTADDR                         (0x0000007FUL)
#define USBFS_HCSPLT13_HUBADDR_POS                     (7U)
#define USBFS_HCSPLT13_HUBADDR                         (0x00003F80UL)
#define USBFS_HCSPLT13_XACTPOS_POS                     (14U)
#define USBFS_HCSPLT13_XACTPOS                         (0x0000C000UL)
#define USBFS_HCSPLT13_XACTPOS_0                       (0x00004000UL)
#define USBFS_HCSPLT13_XACTPOS_1                       (0x00008000UL)
#define USBFS_HCSPLT13_COMPSPLT_POS                    (16U)
#define USBFS_HCSPLT13_COMPSPLT                        (0x00010000UL)
#define USBFS_HCSPLT13_SPLTENA_POS                     (31U)
#define USBFS_HCSPLT13_SPLTENA                         (0x80000000UL)

/*  Bit definition for USBFS_HCINT13 register  */
#define USBFS_HCINT13_XFERCOMPL_POS                    (0U)
#define USBFS_HCINT13_XFERCOMPL                        (0x00000001UL)
#define USBFS_HCINT13_CHHLTD_POS                       (1U)
#define USBFS_HCINT13_CHHLTD                           (0x00000002UL)
#define USBFS_HCINT13_AHBERR_POS                       (2U)
#define USBFS_HCINT13_AHBERR                           (0x00000004UL)
#define USBFS_HCINT13_STALL_POS                        (3U)
#define USBFS_HCINT13_STALL                            (0x00000008UL)
#define USBFS_HCINT13_NAK_POS                          (4U)
#define USBFS_HCINT13_NAK                              (0x00000010UL)
#define USBFS_HCINT13_ACK_POS                          (5U)
#define USBFS_HCINT13_ACK                              (0x00000020UL)
#define USBFS_HCINT13_NYET_POS                         (6U)
#define USBFS_HCINT13_NYET                             (0x00000040UL)
#define USBFS_HCINT13_XACTERR_POS                      (7U)
#define USBFS_HCINT13_XACTERR                          (0x00000080UL)
#define USBFS_HCINT13_BBLERR_POS                       (8U)
#define USBFS_HCINT13_BBLERR                           (0x00000100UL)
#define USBFS_HCINT13_FRMOVRUN_POS                     (9U)
#define USBFS_HCINT13_FRMOVRUN                         (0x00000200UL)
#define USBFS_HCINT13_DATATGLERR_POS                   (10U)
#define USBFS_HCINT13_DATATGLERR                       (0x00000400UL)

/*  Bit definition for USBFS_HCINTMSK13 register  */
#define USBFS_HCINTMSK13_XFERCOMPLMSK_POS              (0U)
#define USBFS_HCINTMSK13_XFERCOMPLMSK                  (0x00000001UL)
#define USBFS_HCINTMSK13_CHHLTDMSK_POS                 (1U)
#define USBFS_HCINTMSK13_CHHLTDMSK                     (0x00000002UL)
#define USBFS_HCINTMSK13_AHBERRMSK_POS                 (2U)
#define USBFS_HCINTMSK13_AHBERRMSK                     (0x00000004UL)
#define USBFS_HCINTMSK13_STALLMSK_POS                  (3U)
#define USBFS_HCINTMSK13_STALLMSK                      (0x00000008UL)
#define USBFS_HCINTMSK13_NAKMSK_POS                    (4U)
#define USBFS_HCINTMSK13_NAKMSK                        (0x00000010UL)
#define USBFS_HCINTMSK13_ACKMSK_POS                    (5U)
#define USBFS_HCINTMSK13_ACKMSK                        (0x00000020UL)
#define USBFS_HCINTMSK13_NYETMSK_POS                   (6U)
#define USBFS_HCINTMSK13_NYETMSK                       (0x00000040UL)
#define USBFS_HCINTMSK13_XACTERRMSK_POS                (7U)
#define USBFS_HCINTMSK13_XACTERRMSK                    (0x00000080UL)
#define USBFS_HCINTMSK13_BBLERRMSK_POS                 (8U)
#define USBFS_HCINTMSK13_BBLERRMSK                     (0x00000100UL)
#define USBFS_HCINTMSK13_FRMOVRUNMSK_POS               (9U)
#define USBFS_HCINTMSK13_FRMOVRUNMSK                   (0x00000200UL)
#define USBFS_HCINTMSK13_DATATGLERRMSK_POS             (10U)
#define USBFS_HCINTMSK13_DATATGLERRMSK                 (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ13 register  */
#define USBFS_HCTSIZ13_XFERSIZE_POS                    (0U)
#define USBFS_HCTSIZ13_XFERSIZE                        (0x0007FFFFUL)
#define USBFS_HCTSIZ13_PKTCNT_POS                      (19U)
#define USBFS_HCTSIZ13_PKTCNT                          (0x1FF80000UL)
#define USBFS_HCTSIZ13_PID_POS                         (29U)
#define USBFS_HCTSIZ13_PID                             (0x60000000UL)
#define USBFS_HCTSIZ13_PID_0                           (0x20000000UL)
#define USBFS_HCTSIZ13_PID_1                           (0x40000000UL)
#define USBFS_HCTSIZ13_DOPNG_POS                       (31U)
#define USBFS_HCTSIZ13_DOPNG                           (0x80000000UL)

