levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_HCDMA13 register  */
#define USBFS_HCDMA13                                  (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR14 register  */
#define USBFS_HCCHAR14_MPS_POS                         (0U)
#define USBFS_HCCHAR14_MPS                             (0x000007FFUL)
#define USBFS_HCCHAR14_EPNUM_POS                       (11U)
#define USBFS_HCCHAR14_EPNUM                           (0x00007800UL)
#define USBFS_HCCHAR14_EPDIR_POS                       (15U)
#define USBFS_HCCHAR14_EPDIR                           (0x00008000UL)
#define USBFS_HCCHAR14_LSPDDEV_POS                     (17U)
#define USBFS_HCCHAR14_LSPDDEV                         (0x00020000UL)
#define USBFS_HCCHAR14_EPTYPE_POS                      (18U)
#define USBFS_HCCHAR14_EPTYPE                          (0x000C0000UL)
#define USBFS_HCCHAR14_EPTYPE_0                        (0x00040000UL)
#define USBFS_HCCHAR14_EPTYPE_1                        (0x00080000UL)
#define USBFS_HCCHAR14_EC_POS                          (20U)
#define USBFS_HCCHAR14_EC                              (0x00300000UL)
#define USBFS_HCCHAR14_DEVADDR_POS                     (22U)
#define USBFS_HCCHAR14_DEVADDR                         (0x1FC00000UL)
#define USBFS_HCCHAR14_ODDFRM_POS                      (29U)
#define USBFS_HCCHAR14_ODDFRM                          (0x20000000UL)
#define USBFS_HCCHAR14_CHDIS_POS                       (30U)
#define USBFS_HCCHAR14_CHDIS                           (0x40000000UL)
#define USBFS_HCCHAR14_CHENA_POS                       (31U)
#define USBFS_HCCHAR14_CHENA                           (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT14 register  */
#define USBFS_HCSPLT14_PRTADDR_POS                     (0U)
#define USBFS_HCSPLT14_PRTADDR                         (0x0000007FUL)
#define USBFS_HCSPLT14_HUBADDR_POS                     (7U)
#define USBFS_HCSPLT14_HUBADDR                         (0x00003F80UL)
#define USBFS_HCSPLT14_XACTPOS_POS                     (14U)
#define USBFS_HCSPLT14_XACTPOS                         (0x0000C000UL)
#define USBFS_HCSPLT14_XACTPOS_0                       (0x00004000UL)
#define USBFS_HCSPLT14_XACTPOS_1                       (0x00008000UL)
#define USBFS_HCSPLT14_COMPSPLT_POS                    (16U)
#define USBFS_HCSPLT14_COMPSPLT                        (0x00010000UL)
#define USBFS_HCSPLT14_SPLTENA_POS                     (31U)
#define USBFS_HCSPLT14_SPLTENA                         (0x80000000UL)

/*  Bit definition for USBFS_HCINT14 register  */
#define USBFS_HCINT14_XFERCOMPL_POS                    (0U)
#define USBFS_HCINT14_XFERCOMPL                        (0x00000001UL)
#define USBFS_HCINT14_CHHLTD_POS                       (1U)
#define USBFS_HCINT14_CHHLTD                           (0x00000002UL)
#define USBFS_HCINT14_AHBERR_POS                       (2U)
#define USBFS_HCINT14_AHBERR                           (0x00000004UL)
#define USBFS_HCINT14_STALL_POS                        (3U)
#define USBFS_HCINT14_STALL                            (0x00000008UL)
#define USBFS_HCINT14_NAK_POS                          (4U)
#define USBFS_HCINT14_NAK                              (0x00000010UL)
#define USBFS_HCINT14_ACK_POS                          (5U)
#define USBFS_HCINT14_ACK                              (0x00000020UL)
#define USBFS_HCINT14_NYET_POS                         (6U)
#define USBFS_HCINT14_NYET                             (0x00000040UL)
#define USBFS_HCINT14_XACTERR_POS                      (7U)
#define USBFS_HCINT14_XACTERR                          (0x00000080UL)
#define USBFS_HCINT14_BBLERR_POS                       (8U)
#define USBFS_HCINT14_BBLERR                           (0x00000100UL)
#define USBFS_HCINT14_FRMOVRUN_POS                     (9U)
#define USBFS_HCINT14_FRMOVRUN                         (0x00000200UL)
#define USBFS_HCINT14_DATATGLERR_POS                   (10U)
#define USBFS_HCINT14_DATATGLERR                       (0x00000400UL)

/*  Bit definition for USBFS_HCINTMSK14 register  */
#define USBFS_HCINTMSK14_XFERCOMPLMSK_POS              (0U)
#define USBFS_HCINTMSK14_XFERCOMPLMSK                  (0x00000001UL)
#define USBFS_HCINTMSK14_CHHLTDMSK_POS                 (1U)
#define USBFS_HCINTMSK14_CHHLTDMSK                     (0x00000002UL)
#define USBFS_HCINTMSK14_AHBERRMSK_POS                 (2U)
#define USBFS_HCINTMSK14_AHBERRMSK                     (0x00000004UL)
#define USBFS_HCINTMSK14_STALLMSK_POS                  (3U)
#define USBFS_HCINTMSK14_STALLMSK                      (0x00000008UL)
#define USBFS_HCINTMSK14_NAKMSK_POS                    (4U)
#define USBFS_HCINTMSK14_NAKMSK                        (0x00000010UL)
#define USBFS_HCINTMSK14_ACKMSK_POS                    (5U)
#define USBFS_HCINTMSK14_ACKMSK                        (0x00000020UL)
#define USBFS_HCINTMSK14_NYETMSK_POS                   (6U)
#define USBFS_HCINTMSK14_NYETMSK                       (0x00000040UL)
#define USBFS_HCINTMSK14_XACTERRMSK_POS                (7U)
#define USBFS_HCINTMSK14_XACTERRMSK                    (0x00000080UL)
#define USBFS_HCINTMSK14_BBLERRMSK_POS                 (8U)
#define USBFS_HCINTMSK14_BBLERRMSK                     (0x00000100UL)
#define USBFS_HCINTMSK14_FRMOVRUNMSK_POS               (9U)
#define USBFS_HCINTMSK14_FRMOVRUNMSK                   (0x00000200UL)
#define USBFS_HCINTMSK14_DATATGLERRMSK_POS             (10U)
#define USBFS_HCINTMSK14_DATATGLERRMSK                 (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ14 register  */
#define USBFS_HCTSIZ14_XFERSIZE_POS                    (0U)
#define USBFS_HCTSIZ14_XFERSIZE                        (0x0007FFFFUL)
#define USBFS_HCTSIZ14_PKTCNT_POS                      (19U)
#define USBFS_HCTSIZ14_PKTCNT                          (0x1FF80000UL)
#define USBFS_HCTSIZ14_PID_POS                         (29U)
#define USBFS_HCTSIZ14_PID                             (0x60000000UL)
#define USBFS_HCTSIZ14_PID_0                           (0x20000000UL)
#define USBFS_HCTSIZ14_PID_1                           (0x40000000UL)
#define USBFS_HCTSIZ14_DOPNG_POS                       (31U)
#define USBFS_HCTSIZ14_DOPNG                           (0x80000000UL)

