levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_HCDMA14 register  */
#define USBFS_HCDMA14                                  (0xFFFFFFFFUL)

/*  Bit definition for USBFS_HCCHAR15 register  */
#define USBFS_HCCHAR15_MPS_POS                         (0U)
#define USBFS_HCCHAR15_MPS                             (0x000007FFUL)
#define USBFS_HCCHAR15_EPNUM_POS                       (11U)
#define USBFS_HCCHAR15_EPNUM                           (0x00007800UL)
#define USBFS_HCCHAR15_EPDIR_POS                       (15U)
#define USBFS_HCCHAR15_EPDIR                           (0x00008000UL)
#define USBFS_HCCHAR15_LSPDDEV_POS                     (17U)
#define USBFS_HCCHAR15_LSPDDEV                         (0x00020000UL)
#define USBFS_HCCHAR15_EPTYPE_POS                      (18U)
#define USBFS_HCCHAR15_EPTYPE                          (0x000C0000UL)
#define USBFS_HCCHAR15_EPTYPE_0                        (0x00040000UL)
#define USBFS_HCCHAR15_EPTYPE_1                        (0x00080000UL)
#define USBFS_HCCHAR15_EC_POS                          (20U)
#define USBFS_HCCHAR15_EC                              (0x00300000UL)
#define USBFS_HCCHAR15_DEVADDR_POS                     (22U)
#define USBFS_HCCHAR15_DEVADDR                         (0x1FC00000UL)
#define USBFS_HCCHAR15_ODDFRM_POS                      (29U)
#define USBFS_HCCHAR15_ODDFRM                          (0x20000000UL)
#define USBFS_HCCHAR15_CHDIS_POS                       (30U)
#define USBFS_HCCHAR15_CHDIS                           (0x40000000UL)
#define USBFS_HCCHAR15_CHENA_POS                       (31U)
#define USBFS_HCCHAR15_CHENA                           (0x80000000UL)

/*  Bit definition for USBFS_HCSPLT15 register  */
#define USBFS_HCSPLT15_PRTADDR_POS                     (0U)
#define USBFS_HCSPLT15_PRTADDR                         (0x0000007FUL)
#define USBFS_HCSPLT15_HUBADDR_POS                     (7U)
#define USBFS_HCSPLT15_HUBADDR                         (0x00003F80UL)
#define USBFS_HCSPLT15_XACTPOS_POS                     (14U)
#define USBFS_HCSPLT15_XACTPOS                         (0x0000C000UL)
#define USBFS_HCSPLT15_XACTPOS_0                       (0x00004000UL)
#define USBFS_HCSPLT15_XACTPOS_1                       (0x00008000UL)
#define USBFS_HCSPLT15_COMPSPLT_POS                    (16U)
#define USBFS_HCSPLT15_COMPSPLT                        (0x00010000UL)
#define USBFS_HCSPLT15_SPLTENA_POS                     (31U)
#define USBFS_HCSPLT15_SPLTENA                         (0x80000000UL)

/*  Bit definition for USBFS_HCINT15 register  */
#define USBFS_HCINT15_XFERCOMPL_POS                    (0U)
#define USBFS_HCINT15_XFERCOMPL                        (0x00000001UL)
#define USBFS_HCINT15_CHHLTD_POS                       (1U)
#define USBFS_HCINT15_CHHLTD                           (0x00000002UL)
#define USBFS_HCINT15_AHBERR_POS                       (2U)
#define USBFS_HCINT15_AHBERR                           (0x00000004UL)
#define USBFS_HCINT15_STALL_POS                        (3U)
#define USBFS_HCINT15_STALL                            (0x00000008UL)
#define USBFS_HCINT15_NAK_POS                          (4U)
#define USBFS_HCINT15_NAK                              (0x00000010UL)
#define USBFS_HCINT15_ACK_POS                          (5U)
#define USBFS_HCINT15_ACK                              (0x00000020UL)
#define USBFS_HCINT15_NYET_POS                         (6U)
#define USBFS_HCINT15_NYET                             (0x00000040UL)
#define USBFS_HCINT15_XACTERR_POS                      (7U)
#define USBFS_HCINT15_XACTERR                          (0x00000080UL)
#define USBFS_HCINT15_BBLERR_POS                       (8U)
#define USBFS_HCINT15_BBLERR                           (0x00000100UL)
#define USBFS_HCINT15_FRMOVRUN_POS                     (9U)
#define USBFS_HCINT15_FRMOVRUN                         (0x00000200UL)
#define USBFS_HCINT15_DATATGLERR_POS                   (10U)
#define USBFS_HCINT15_DATATGLERR                       (0x00000400UL)

/*  Bit definition for USBFS_HCINTMSK15 register  */
#define USBFS_HCINTMSK15_XFERCOMPLMSK_POS              (0U)
#define USBFS_HCINTMSK15_XFERCOMPLMSK                  (0x00000001UL)
#define USBFS_HCINTMSK15_CHHLTDMSK_POS                 (1U)
#define USBFS_HCINTMSK15_CHHLTDMSK                     (0x00000002UL)
#define USBFS_HCINTMSK15_AHBERRMSK_POS                 (2U)
#define USBFS_HCINTMSK15_AHBERRMSK                     (0x00000004UL)
#define USBFS_HCINTMSK15_STALLMSK_POS                  (3U)
#define USBFS_HCINTMSK15_STALLMSK                      (0x00000008UL)
#define USBFS_HCINTMSK15_NAKMSK_POS                    (4U)
#define USBFS_HCINTMSK15_NAKMSK                        (0x00000010UL)
#define USBFS_HCINTMSK15_ACKMSK_POS                    (5U)
#define USBFS_HCINTMSK15_ACKMSK                        (0x00000020UL)
#define USBFS_HCINTMSK15_NYETMSK_POS                   (6U)
#define USBFS_HCINTMSK15_NYETMSK                       (0x00000040UL)
#define USBFS_HCINTMSK15_XACTERRMSK_POS                (7U)
#define USBFS_HCINTMSK15_XACTERRMSK                    (0x00000080UL)
#define USBFS_HCINTMSK15_BBLERRMSK_POS                 (8U)
#define USBFS_HCINTMSK15_BBLERRMSK                     (0x00000100UL)
#define USBFS_HCINTMSK15_FRMOVRUNMSK_POS               (9U)
#define USBFS_HCINTMSK15_FRMOVRUNMSK                   (0x00000200UL)
#define USBFS_HCINTMSK15_DATATGLERRMSK_POS             (10U)
#define USBFS_HCINTMSK15_DATATGLERRMSK                 (0x00000400UL)

/*  Bit definition for USBFS_HCTSIZ15 register  */
#define USBFS_HCTSIZ15_XFERSIZE_POS                    (0U)
#define USBFS_HCTSIZ15_XFERSIZE                        (0x0007FFFFUL)
#define USBFS_HCTSIZ15_PKTCNT_POS                      (19U)
#define USBFS_HCTSIZ15_PKTCNT                          (0x1FF80000UL)
#define USBFS_HCTSIZ15_PID_POS                         (29U)
#define USBFS_HCTSIZ15_PID                             (0x60000000UL)
#define USBFS_HCTSIZ15_PID_0                           (0x20000000UL)
#define USBFS_HCTSIZ15_PID_1                           (0x40000000UL)
#define USBFS_HCTSIZ15_DOPNG_POS                       (31U)
#define USBFS_HCTSIZ15_DOPNG                           (0x80000000UL)

/*  Bit definition for USBFS_HCDMA15 register  */
#define USBFS_HCDMA15                                  (0xFFFFFFFFUL)

