levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DCFG register  */
#define USBFS_DCFG_DEVSPD_POS                          (0U)
#define USBFS_DCFG_DEVSPD                              (0x00000003UL)
#define USBFS_DCFG_DEVSPD_0                            (0x00000001UL)
#define USBFS_DCFG_DEVSPD_1                            (0x00000002UL)
#define USBFS_DCFG_NZSTSOUTHSHK_POS                    (2U)
#define USBFS_DCFG_NZSTSOUTHSHK                        (0x00000004UL)
#define USBFS_DCFG_ENA32KHZSUSP_POS                    (3U)
#define USBFS_DCFG_ENA32KHZSUSP                        (0x00000008UL)
#define USBFS_DCFG_DEVADDR_POS                         (4U)
#define USBFS_DCFG_DEVADDR                             (0x000007F0UL)
#define USBFS_DCFG_PERFRINT_POS                        (11U)
#define USBFS_DCFG_PERFRINT                            (0x00001800UL)
#define USBFS_DCFG_PERFRINT_0                          (0x00000800UL)
#define USBFS_DCFG_PERFRINT_1                          (0x00001000UL)
#define USBFS_DCFG_XCVRDLY_POS                         (14U)
#define USBFS_DCFG_XCVRDLY                             (0x00004000UL)
#define USBFS_DCFG_ERRATICINTMSK_POS                   (15U)
#define USBFS_DCFG_ERRATICINTMSK                       (0x00008000UL)
#define USBFS_DCFG_PERSCHINTVL_POS                     (24U)
#define USBFS_DCFG_PERSCHINTVL                         (0x03000000UL)
#define USBFS_DCFG_PERSCHINTVL_0                       (0x01000000UL)
#define USBFS_DCFG_PERSCHINTVL_1                       (0x02000000UL)
#define USBFS_DCFG_RESVALID_POS                        (26U)
#define USBFS_DCFG_RESVALID                            (0xFC000000UL)

/*  Bit definition for USBFS_DCTL register  */
#define USBFS_DCTL_RMTWKUPSIG_POS                      (0U)
#define USBFS_DCTL_RMTWKUPSIG                          (0x00000001UL)
#define USBFS_DCTL_SFTDISCON_POS                       (1U)
#define USBFS_DCTL_SFTDISCON                           (0x00000002UL)
#define USBFS_DCTL_GNPINNAKSTS_POS                     (2U)
#define USBFS_DCTL_GNPINNAKSTS                         (0x00000004UL)
#define USBFS_DCTL_GOUTNAKSTS_POS                      (3U)
#define USBFS_DCTL_GOUTNAKSTS                          (0x00000008UL)
#define USBFS_DCTL_TSTCTL_POS                          (4U)
#define USBFS_DCTL_TSTCTL                              (0x00000070UL)
#define USBFS_DCTL_TSTCTL_0                            (0x00000010UL)
#define USBFS_DCTL_TSTCTL_1                            (0x00000020UL)
#define USBFS_DCTL_TSTCTL_2                            (0x00000040UL)
#define USBFS_DCTL_SGNPINNAK_POS                       (7U)
#define USBFS_DCTL_SGNPINNAK                           (0x00000080UL)
#define USBFS_DCTL_CGNPINNAK_POS                       (8U)
#define USBFS_DCTL_CGNPINNAK                           (0x00000100UL)
#define USBFS_DCTL_SGOUTNAK_POS                        (9U)
#define USBFS_DCTL_SGOUTNAK                            (0x00000200UL)
#define USBFS_DCTL_CGOUTNAK_POS                        (10U)
#define USBFS_DCTL_CGOUTNAK                            (0x00000400UL)
#define USBFS_DCTL_PWRONPRGDONE_POS                    (11U)
#define USBFS_DCTL_PWRONPRGDONE                        (0x00000800UL)
#define USBFS_DCTL_IGNRFRMNUM_POS                      (15U)
#define USBFS_DCTL_IGNRFRMNUM                          (0x00008000UL)
#define USBFS_DCTL_NAKONBBLE_POS                       (16U)
#define USBFS_DCTL_NAKONBBLE                           (0x00010000UL)
#define USBFS_DCTL_DEEPSLEEPBESLREJECT_POS             (18U)
#define USBFS_DCTL_DEEPSLEEPBESLREJECT                 (0x00040000UL)
#define USBFS_DCTL_SERVINT_POS                         (19U)
#define USBFS_DCTL_SERVINT                             (0x00080000UL)

/*  Bit definition for USBFS_DSTS register  */
#define USBFS_DSTS_SUSPSTS_POS                         (0U)
#define USBFS_DSTS_SUSPSTS                             (0x00000001UL)
#define USBFS_DSTS_ENUMSPD_POS                         (1U)
#define USBFS_DSTS_ENUMSPD                             (0x00000006UL)
#define USBFS_DSTS_ENUMSPD_0                           (0x00000002UL)
#define USBFS_DSTS_ENUMSPD_1                           (0x00000004UL)
#define USBFS_DSTS_ERRTICERR_POS                       (3U)
#define USBFS_DSTS_ERRTICERR                           (0x00000008UL)
#define USBFS_DSTS_SOFFN_POS                           (8U)
#define USBFS_DSTS_SOFFN                               (0x003FFF00UL)
#define USBFS_DSTS_DEVLNSTS_POS                        (22U)
#define USBFS_DSTS_DEVLNSTS                            (0x00C00000UL)
#define USBFS_DSTS_DEVLNSTS_0                          (0x00400000UL)
#define USBFS_DSTS_DEVLNSTS_1                          (0x00800000UL)

/*  Bit definition for USBFS_DIEPMSK register  */
#define USBFS_DIEPMSK_XFERCOMPLMSK_POS                 (0U)
#define USBFS_DIEPMSK_XFERCOMPLMSK                     (0x00000001UL)
#define USBFS_DIEPMSK_EPDISBLDMSK_POS                  (1U)
#define USBFS_DIEPMSK_EPDISBLDMSK                      (0x00000002UL)
#define USBFS_DIEPMSK_AHBERRMSK_POS                    (2U)
#define USBFS_DIEPMSK_AHBERRMSK                        (0x00000004UL)
#define USBFS_DIEPMSK_TIMEOUTMSK_POS                   (3U)
#define USBFS_DIEPMSK_TIMEOUTMSK                       (0x00000008UL)
#define USBFS_DIEPMSK_INTKNTXFEMPMSK_POS               (4U)
#define USBFS_DIEPMSK_INTKNTXFEMPMSK                   (0x00000010UL)
#define USBFS_DIEPMSK_INTKNEPMISMSK_POS                (5U)
#define USBFS_DIEPMSK_INTKNEPMISMSK                    (0x00000020UL)
#define USBFS_DIEPMSK_INEPNAKEFFMSK_POS                (6U)
#define USBFS_DIEPMSK_INEPNAKEFFMSK                    (0x00000040UL)
#define USBFS_DIEPMSK_TXFIFOUNDRNMSK_POS               (8U)
#define USBFS_DIEPMSK_TXFIFOUNDRNMSK                   (0x00000100UL)
#define USBFS_DIEPMSK_NAKMSK_POS                       (13U)
#define USBFS_DIEPMSK_NAKMSK                           (0x00002000UL)

/*  Bit definition for USBFS_DOEPMSK register  */
#define USBFS_DOEPMSK_XFERCOMPLMSK_POS                 (0U)
#define USBFS_DOEPMSK_XFERCOMPLMSK                     (0x00000001UL)
#define USBFS_DOEPMSK_EPDISBLDMSK_POS                  (1U)
#define USBFS_DOEPMSK_EPDISBLDMSK                      (0x00000002UL)
#define USBFS_DOEPMSK_AHBERRMSK_POS                    (2U)
#define USBFS_DOEPMSK_AHBERRMSK                        (0x00000004UL)
#define USBFS_DOEPMSK_SETUPMSK_POS                     (3U)
#define USBFS_DOEPMSK_SETUPMSK                         (0x00000008UL)
#define USBFS_DOEPMSK_OUTTKNEPDISMSK_POS               (4U)
#define USBFS_DOEPMSK_OUTTKNEPDISMSK                   (0x00000010UL)
#define USBFS_DOEPMSK_STSPHSERCVDMSK_POS               (5U)
#define USBFS_DOEPMSK_STSPHSERCVDMSK                   (0x00000020UL)
#define USBFS_DOEPMSK_BACK2BACKSETUP_POS               (6U)
#define USBFS_DOEPMSK_BACK2BACKSETUP                   (0x00000040UL)
#define USBFS_DOEPMSK_OUTPKTERRMSK_POS                 (8U)
#define USBFS_DOEPMSK_OUTPKTERRMSK                     (0x00000100UL)
#define USBFS_DOEPMSK_BBLEERRMSK_POS                   (12U)
#define USBFS_DOEPMSK_BBLEERRMSK                       (0x00001000UL)
#define USBFS_DOEPMSK_NAKMSK_POS                       (13U)
#define USBFS_DOEPMSK_NAKMSK                           (0x00002000UL)
#define USBFS_DOEPMSK_NYETMSK_POS                      (14U)
#define USBFS_DOEPMSK_NYETMSK                          (0x00004000UL)

/*  Bit definition for USBFS_DAINT register  */
#define USBFS_DAINT_INEPINT0_POS                       (0U)
#define USBFS_DAINT_INEPINT0                           (0x00000001UL)
#define USBFS_DAINT_INEPINT1_POS                       (1U)
#define USBFS_DAINT_INEPINT1                           (0x00000002UL)
#define USBFS_DAINT_INEPINT2_POS                       (2U)
#define USBFS_DAINT_INEPINT2                           (0x00000004UL)
#define USBFS_DAINT_INEPINT3_POS                       (3U)
#define USBFS_DAINT_INEPINT3                           (0x00000008UL)
#define USBFS_DAINT_INEPINT4_POS                       (4U)
#define USBFS_DAINT_INEPINT4                           (0x00000010UL)
#define USBFS_DAINT_INEPINT5_POS                       (5U)
#define USBFS_DAINT_INEPINT5                           (0x00000020UL)
#define USBFS_DAINT_INEPINT6_POS                       (6U)
#define USBFS_DAINT_INEPINT6                           (0x00000040UL)
#define USBFS_DAINT_INEPINT7_POS                       (7U)
#define USBFS_DAINT_INEPINT7                           (0x00000080UL)
#define USBFS_DAINT_INEPINT8_POS                       (8U)
#define USBFS_DAINT_INEPINT8                           (0x00000100UL)
#define USBFS_DAINT_INEPINT9_POS                       (9U)
#define USBFS_DAINT_INEPINT9                           (0x00000200UL)
#define USBFS_DAINT_INEPINT10_POS                      (10U)
#define USBFS_DAINT_INEPINT10                          (0x00000400UL)
#define USBFS_DAINT_INEPINT11_POS                      (11U)
#define USBFS_DAINT_INEPINT11                          (0x00000800UL)
#define USBFS_DAINT_INEPINT12_POS                      (12U)
#define USBFS_DAINT_INEPINT12                          (0x00001000UL)
#define USBFS_DAINT_INEPINT13_POS                      (13U)
#define USBFS_DAINT_INEPINT13                          (0x00002000UL)
#define USBFS_DAINT_INEPINT14_POS                      (14U)
#define USBFS_DAINT_INEPINT14                          (0x00004000UL)
#define USBFS_DAINT_INEPINT15_POS                      (15U)
#define USBFS_DAINT_INEPINT15                          (0x00008000UL)
#define USBFS_DAINT_OUTEPINT0_POS                      (16U)
#define USBFS_DAINT_OUTEPINT0                          (0x00010000UL)
#define USBFS_DAINT_OUTEPINT1_POS                      (17U)
#define USBFS_DAINT_OUTEPINT1                          (0x00020000UL)
#define USBFS_DAINT_OUTEPINT2_POS                      (18U)
#define USBFS_DAINT_OUTEPINT2                          (0x00040000UL)
#define USBFS_DAINT_OUTEPINT3_POS                      (19U)
#define USBFS_DAINT_OUTEPINT3                          (0x00080000UL)
#define USBFS_DAINT_OUTEPINT4_POS                      (20U)
#define USBFS_DAINT_OUTEPINT4                          (0x00100000UL)
#define USBFS_DAINT_OUTEPINT5_POS                      (21U)
#define USBFS_DAINT_OUTEPINT5                          (0x00200000UL)
#define USBFS_DAINT_OUTEPINT6_POS                      (22U)
#define USBFS_DAINT_OUTEPINT6                          (0x00400000UL)
#define USBFS_DAINT_OUTEPINT7_POS                      (23U)
#define USBFS_DAINT_OUTEPINT7                          (0x00800000UL)
#define USBFS_DAINT_OUTEPINT8_POS                      (24U)
#define USBFS_DAINT_OUTEPINT8                          (0x01000000UL)
#define USBFS_DAINT_OUTEPINT9_POS                      (25U)
#define USBFS_DAINT_OUTEPINT9                          (0x02000000UL)
#define USBFS_DAINT_OUTEPINT10_POS                     (26U)
#define USBFS_DAINT_OUTEPINT10                         (0x04000000UL)
#define USBFS_DAINT_OUTEPINT11_POS                     (27U)
#define USBFS_DAINT_OUTEPINT11                         (0x08000000UL)
#define USBFS_DAINT_OUTEPINT12_POS                     (28U)
#define USBFS_DAINT_OUTEPINT12                         (0x10000000UL)
#define USBFS_DAINT_OUTEPINT13_POS                     (29U)
#define USBFS_DAINT_OUTEPINT13                         (0x20000000UL)
#define USBFS_DAINT_OUTEPINT14_POS                     (30U)
#define USBFS_DAINT_OUTEPINT14                         (0x40000000UL)
#define USBFS_DAINT_OUTEPINT15_POS                     (31U)
#define USBFS_DAINT_OUTEPINT15                         (0x80000000UL)

