levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DAINTMSK register  */
#define USBFS_DAINTMSK_INEPMSK0_POS                    (0U)
#define USBFS_DAINTMSK_INEPMSK0                        (0x00000001UL)
#define USBFS_DAINTMSK_INEPMSK1_POS                    (1U)
#define USBFS_DAINTMSK_INEPMSK1                        (0x00000002UL)
#define USBFS_DAINTMSK_INEPMSK2_POS                    (2U)
#define USBFS_DAINTMSK_INEPMSK2                        (0x00000004UL)
#define USBFS_DAINTMSK_INEPMSK3_POS                    (3U)
#define USBFS_DAINTMSK_INEPMSK3                        (0x00000008UL)
#define USBFS_DAINTMSK_INEPMSK4_POS                    (4U)
#define USBFS_DAINTMSK_INEPMSK4                        (0x00000010UL)
#define USBFS_DAINTMSK_INEPMSK5_POS                    (5U)
#define USBFS_DAINTMSK_INEPMSK5                        (0x00000020UL)
#define USBFS_DAINTMSK_INEPMSK6_POS                    (6U)
#define USBFS_DAINTMSK_INEPMSK6                        (0x00000040UL)
#define USBFS_DAINTMSK_INEPMSK7_POS                    (7U)
#define USBFS_DAINTMSK_INEPMSK7                        (0x00000080UL)
#define USBFS_DAINTMSK_INEPMSK8_POS                    (8U)
#define USBFS_DAINTMSK_INEPMSK8                        (0x00000100UL)
#define USBFS_DAINTMSK_INEPMSK9_POS                    (9U)
#define USBFS_DAINTMSK_INEPMSK9                        (0x00000200UL)
#define USBFS_DAINTMSK_INEPMSK10_POS                   (10U)
#define USBFS_DAINTMSK_INEPMSK10                       (0x00000400UL)
#define USBFS_DAINTMSK_INEPMSK11_POS                   (11U)
#define USBFS_DAINTMSK_INEPMSK11                       (0x00000800UL)
#define USBFS_DAINTMSK_INEPMSK12_POS                   (12U)
#define USBFS_DAINTMSK_INEPMSK12                       (0x00001000UL)
#define USBFS_DAINTMSK_INEPMSK13_POS                   (13U)
#define USBFS_DAINTMSK_INEPMSK13                       (0x00002000UL)
#define USBFS_DAINTMSK_INEPMSK14_POS                   (14U)
#define USBFS_DAINTMSK_INEPMSK14                       (0x00004000UL)
#define USBFS_DAINTMSK_INEPMSK15_POS                   (15U)
#define USBFS_DAINTMSK_INEPMSK15                       (0x00008000UL)
#define USBFS_DAINTMSK_OUTEPMSK0_POS                   (16U)
#define USBFS_DAINTMSK_OUTEPMSK0                       (0x00010000UL)
#define USBFS_DAINTMSK_OUTEPMSK1_POS                   (17U)
#define USBFS_DAINTMSK_OUTEPMSK1                       (0x00020000UL)
#define USBFS_DAINTMSK_OUTEPMSK2_POS                   (18U)
#define USBFS_DAINTMSK_OUTEPMSK2                       (0x00040000UL)
#define USBFS_DAINTMSK_OUTEPMSK3_POS                   (19U)
#define USBFS_DAINTMSK_OUTEPMSK3                       (0x00080000UL)
#define USBFS_DAINTMSK_OUTEPMSK4_POS                   (20U)
#define USBFS_DAINTMSK_OUTEPMSK4                       (0x00100000UL)
#define USBFS_DAINTMSK_OUTEPMSK5_POS                   (21U)
#define USBFS_DAINTMSK_OUTEPMSK5                       (0x00200000UL)
#define USBFS_DAINTMSK_OUTEPMSK6_POS                   (22U)
#define USBFS_DAINTMSK_OUTEPMSK6                       (0x00400000UL)
#define USBFS_DAINTMSK_OUTEPMSK7_POS                   (23U)
#define USBFS_DAINTMSK_OUTEPMSK7                       (0x00800000UL)
#define USBFS_DAINTMSK_OUTEPMSK8_POS                   (24U)
#define USBFS_DAINTMSK_OUTEPMSK8                       (0x01000000UL)
#define USBFS_DAINTMSK_OUTEPMSK9_POS                   (25U)
#define USBFS_DAINTMSK_OUTEPMSK9                       (0x02000000UL)
#define USBFS_DAINTMSK_OUTEPMSK10_POS                  (26U)
#define USBFS_DAINTMSK_OUTEPMSK10                      (0x04000000UL)
#define USBFS_DAINTMSK_OUTEPMSK11_POS                  (27U)
#define USBFS_DAINTMSK_OUTEPMSK11                      (0x08000000UL)
#define USBFS_DAINTMSK_OUTEPMSK12_POS                  (28U)
#define USBFS_DAINTMSK_OUTEPMSK12                      (0x10000000UL)
#define USBFS_DAINTMSK_OUTEPMSK13_POS                  (29U)
#define USBFS_DAINTMSK_OUTEPMSK13                      (0x20000000UL)
#define USBFS_DAINTMSK_OUTEPMSK14_POS                  (30U)
#define USBFS_DAINTMSK_OUTEPMSK14                      (0x40000000UL)
#define USBFS_DAINTMSK_OUTEPMSK15_POS                  (31U)
#define USBFS_DAINTMSK_OUTEPMSK15                      (0x80000000UL)

/*  Bit definition for USBFS_DIEPEMPMSK register  */
#define USBFS_DIEPEMPMSK_INEPTXFEMPMSK                 (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL0 register  */
#define USBFS_DIEPCTL0_MPS_POS                         (0U)
#define USBFS_DIEPCTL0_MPS                             (0x00000003UL)
#define USBFS_DIEPCTL0_USBACTEP_POS                    (15U)
#define USBFS_DIEPCTL0_USBACTEP                        (0x00008000UL)
#define USBFS_DIEPCTL0_NAKSTS_POS                      (17U)
#define USBFS_DIEPCTL0_NAKSTS                          (0x00020000UL)
#define USBFS_DIEPCTL0_EPTYPE_POS                      (18U)
#define USBFS_DIEPCTL0_EPTYPE                          (0x000C0000UL)
#define USBFS_DIEPCTL0_EPTYPE_0                        (0x00040000UL)
#define USBFS_DIEPCTL0_EPTYPE_1                        (0x00080000UL)
#define USBFS_DIEPCTL0_STALL_POS                       (21U)
#define USBFS_DIEPCTL0_STALL                           (0x00200000UL)
#define USBFS_DIEPCTL0_TXFNUM_POS                      (22U)
#define USBFS_DIEPCTL0_TXFNUM                          (0x03C00000UL)
#define USBFS_DIEPCTL0_CNAK_POS                        (26U)
#define USBFS_DIEPCTL0_CNAK                            (0x04000000UL)
#define USBFS_DIEPCTL0_SNAK_POS                        (27U)
#define USBFS_DIEPCTL0_SNAK                            (0x08000000UL)
#define USBFS_DIEPCTL0_EPDIS_POS                       (30U)
#define USBFS_DIEPCTL0_EPDIS                           (0x40000000UL)
#define USBFS_DIEPCTL0_EPENA_POS                       (31U)
#define USBFS_DIEPCTL0_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DIEPINT0 register  */
#define USBFS_DIEPINT0_XFERCOMPL_POS                   (0U)
#define USBFS_DIEPINT0_XFERCOMPL                       (0x00000001UL)
#define USBFS_DIEPINT0_EPDISBLD_POS                    (1U)
#define USBFS_DIEPINT0_EPDISBLD                        (0x00000002UL)
#define USBFS_DIEPINT0_AHBERR_POS                      (2U)
#define USBFS_DIEPINT0_AHBERR                          (0x00000004UL)
#define USBFS_DIEPINT0_TIMEOUT_POS                     (3U)
#define USBFS_DIEPINT0_TIMEOUT                         (0x00000008UL)
#define USBFS_DIEPINT0_INTKNTXFEMP_POS                 (4U)
#define USBFS_DIEPINT0_INTKNTXFEMP                     (0x00000010UL)
#define USBFS_DIEPINT0_INTKNEPMIS_POS                  (5U)
#define USBFS_DIEPINT0_INTKNEPMIS                      (0x00000020UL)
#define USBFS_DIEPINT0_INEPNAKEFF_POS                  (6U)
#define USBFS_DIEPINT0_INEPNAKEFF                      (0x00000040UL)
#define USBFS_DIEPINT0_TXFEMP_POS                      (7U)
#define USBFS_DIEPINT0_TXFEMP                          (0x00000080UL)
#define USBFS_DIEPINT0_TXFIFOUNDRN_POS                 (8U)
#define USBFS_DIEPINT0_TXFIFOUNDRN                     (0x00000100UL)
#define USBFS_DIEPINT0_BNAINTR_POS                     (9U)
#define USBFS_DIEPINT0_BNAINTR                         (0x00000200UL)
#define USBFS_DIEPINT0_PKTDRPSTS_POS                   (11U)
#define USBFS_DIEPINT0_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DIEPINT0_BBLEERR_POS                     (12U)
#define USBFS_DIEPINT0_BBLEERR                         (0x00001000UL)
#define USBFS_DIEPINT0_NAKINTRPT_POS                   (13U)
#define USBFS_DIEPINT0_NAKINTRPT                       (0x00002000UL)
#define USBFS_DIEPINT0_NYETINTRPT_POS                  (14U)
#define USBFS_DIEPINT0_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBFS_DIEPTSIZ0 register  */
#define USBFS_DIEPTSIZ0_XFERSIZE_POS                   (0U)
#define USBFS_DIEPTSIZ0_XFERSIZE                       (0x0000007FUL)
#define USBFS_DIEPTSIZ0_PKTCNT_POS                     (19U)
#define USBFS_DIEPTSIZ0_PKTCNT                         (0x00180000UL)

/*  Bit definition for USBFS_DIEPDMA0 register  */
#define USBFS_DIEPDMA0                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS0 register  */
#define USBFS_DTXFSTS0_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL1 register  */
#define USBFS_DIEPCTL1_MPS_POS                         (0U)
#define USBFS_DIEPCTL1_MPS                             (0x000007FFUL)
#define USBFS_DIEPCTL1_USBACTEP_POS                    (15U)
#define USBFS_DIEPCTL1_USBACTEP                        (0x00008000UL)
#define USBFS_DIEPCTL1_DPID_POS                        (16U)
#define USBFS_DIEPCTL1_DPID                            (0x00010000UL)
#define USBFS_DIEPCTL1_NAKSTS_POS                      (17U)
#define USBFS_DIEPCTL1_NAKSTS                          (0x00020000UL)
#define USBFS_DIEPCTL1_EPTYPE_POS                      (18U)
#define USBFS_DIEPCTL1_EPTYPE                          (0x000C0000UL)
#define USBFS_DIEPCTL1_EPTYPE_0                        (0x00040000UL)
#define USBFS_DIEPCTL1_EPTYPE_1                        (0x00080000UL)
#define USBFS_DIEPCTL1_STALL_POS                       (21U)
#define USBFS_DIEPCTL1_STALL                           (0x00200000UL)
#define USBFS_DIEPCTL1_TXFNUM_POS                      (22U)
#define USBFS_DIEPCTL1_TXFNUM                          (0x03C00000UL)
#define USBFS_DIEPCTL1_CNAK_POS                        (26U)
#define USBFS_DIEPCTL1_CNAK                            (0x04000000UL)
#define USBFS_DIEPCTL1_SNAK_POS                        (27U)
#define USBFS_DIEPCTL1_SNAK                            (0x08000000UL)
#define USBFS_DIEPCTL1_SETD0PID_POS                    (28U)
#define USBFS_DIEPCTL1_SETD0PID                        (0x10000000UL)
#define USBFS_DIEPCTL1_SETD1PID_POS                    (29U)
#define USBFS_DIEPCTL1_SETD1PID                        (0x20000000UL)
#define USBFS_DIEPCTL1_EPDIS_POS                       (30U)
#define USBFS_DIEPCTL1_EPDIS                           (0x40000000UL)
#define USBFS_DIEPCTL1_EPENA_POS                       (31U)
#define USBFS_DIEPCTL1_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DIEPINT1 register  */
#define USBFS_DIEPINT1_XFERCOMPL_POS                   (0U)
#define USBFS_DIEPINT1_XFERCOMPL                       (0x00000001UL)
#define USBFS_DIEPINT1_EPDISBLD_POS                    (1U)
#define USBFS_DIEPINT1_EPDISBLD                        (0x00000002UL)
#define USBFS_DIEPINT1_AHBERR_POS                      (2U)
#define USBFS_DIEPINT1_AHBERR                          (0x00000004UL)
#define USBFS_DIEPINT1_TIMEOUT_POS                     (3U)
#define USBFS_DIEPINT1_TIMEOUT                         (0x00000008UL)
#define USBFS_DIEPINT1_INTKNTXFEMP_POS                 (4U)
#define USBFS_DIEPINT1_INTKNTXFEMP                     (0x00000010UL)
#define USBFS_DIEPINT1_INTKNEPMIS_POS                  (5U)
#define USBFS_DIEPINT1_INTKNEPMIS                      (0x00000020UL)
#define USBFS_DIEPINT1_INEPNAKEFF_POS                  (6U)
#define USBFS_DIEPINT1_INEPNAKEFF                      (0x00000040UL)
#define USBFS_DIEPINT1_TXFEMP_POS                      (7U)
#define USBFS_DIEPINT1_TXFEMP                          (0x00000080UL)
#define USBFS_DIEPINT1_TXFIFOUNDRN_POS                 (8U)
#define USBFS_DIEPINT1_TXFIFOUNDRN                     (0x00000100UL)
#define USBFS_DIEPINT1_BNAINTR_POS                     (9U)
#define USBFS_DIEPINT1_BNAINTR                         (0x00000200UL)
#define USBFS_DIEPINT1_PKTDRPSTS_POS                   (11U)
#define USBFS_DIEPINT1_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DIEPINT1_BBLEERR_POS                     (12U)
#define USBFS_DIEPINT1_BBLEERR                         (0x00001000UL)
#define USBFS_DIEPINT1_NAKINTRPT_POS                   (13U)
#define USBFS_DIEPINT1_NAKINTRPT                       (0x00002000UL)
#define USBFS_DIEPINT1_NYETINTRPT_POS                  (14U)
#define USBFS_DIEPINT1_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBFS_DIEPTSIZ1 register  */
#define USBFS_DIEPTSIZ1_XFERSIZE_POS                   (0U)
#define USBFS_DIEPTSIZ1_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DIEPTSIZ1_PKTCNT_POS                     (19U)
#define USBFS_DIEPTSIZ1_PKTCNT                         (0x1FF80000UL)
#define USBFS_DIEPTSIZ1_MC_POS                         (29U)
#define USBFS_DIEPTSIZ1_MC                             (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA1 register  */
#define USBFS_DIEPDMA1                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS1 register  */
#define USBFS_DTXFSTS1_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL2 register  */
#define USBFS_DIEPCTL2_MPS_POS                         (0U)
#define USBFS_DIEPCTL2_MPS                             (0x000007FFUL)
#define USBFS_DIEPCTL2_USBACTEP_POS                    (15U)
#define USBFS_DIEPCTL2_USBACTEP                        (0x00008000UL)
#define USBFS_DIEPCTL2_DPID_POS                        (16U)
#define USBFS_DIEPCTL2_DPID                            (0x00010000UL)
#define USBFS_DIEPCTL2_NAKSTS_POS                      (17U)
#define USBFS_DIEPCTL2_NAKSTS                          (0x00020000UL)
#define USBFS_DIEPCTL2_EPTYPE_POS                      (18U)
#define USBFS_DIEPCTL2_EPTYPE                          (0x000C0000UL)
#define USBFS_DIEPCTL2_EPTYPE_0                        (0x00040000UL)
#define USBFS_DIEPCTL2_EPTYPE_1                        (0x00080000UL)
#define USBFS_DIEPCTL2_STALL_POS                       (21U)
#define USBFS_DIEPCTL2_STALL                           (0x00200000UL)
#define USBFS_DIEPCTL2_TXFNUM_POS                      (22U)
#define USBFS_DIEPCTL2_TXFNUM                          (0x03C00000UL)
#define USBFS_DIEPCTL2_CNAK_POS                        (26U)
#define USBFS_DIEPCTL2_CNAK                            (0x04000000UL)
#define USBFS_DIEPCTL2_SNAK_POS                        (27U)
#define USBFS_DIEPCTL2_SNAK                            (0x08000000UL)
#define USBFS_DIEPCTL2_SETD0PID_POS                    (28U)
#define USBFS_DIEPCTL2_SETD0PID                        (0x10000000UL)
#define USBFS_DIEPCTL2_SETD1PID_POS                    (29U)
#define USBFS_DIEPCTL2_SETD1PID                        (0x20000000UL)
#define USBFS_DIEPCTL2_EPDIS_POS                       (30U)
#define USBFS_DIEPCTL2_EPDIS                           (0x40000000UL)
#define USBFS_DIEPCTL2_EPENA_POS                       (31U)
#define USBFS_DIEPCTL2_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DIEPINT2 register  */
#define USBFS_DIEPINT2_XFERCOMPL_POS                   (0U)
#define USBFS_DIEPINT2_XFERCOMPL                       (0x00000001UL)
#define USBFS_DIEPINT2_EPDISBLD_POS                    (1U)
#define USBFS_DIEPINT2_EPDISBLD                        (0x00000002UL)
#define USBFS_DIEPINT2_AHBERR_POS                      (2U)
#define USBFS_DIEPINT2_AHBERR                          (0x00000004UL)
#define USBFS_DIEPINT2_TIMEOUT_POS                     (3U)
#define USBFS_DIEPINT2_TIMEOUT                         (0x00000008UL)
#define USBFS_DIEPINT2_INTKNTXFEMP_POS                 (4U)
#define USBFS_DIEPINT2_INTKNTXFEMP                     (0x00000010UL)
#define USBFS_DIEPINT2_INTKNEPMIS_POS                  (5U)
#define USBFS_DIEPINT2_INTKNEPMIS                      (0x00000020UL)
#define USBFS_DIEPINT2_INEPNAKEFF_POS                  (6U)
#define USBFS_DIEPINT2_INEPNAKEFF                      (0x00000040UL)
#define USBFS_DIEPINT2_TXFEMP_POS                      (7U)
#define USBFS_DIEPINT2_TXFEMP                          (0x00000080UL)
#define USBFS_DIEPINT2_TXFIFOUNDRN_POS                 (8U)
#define USBFS_DIEPINT2_TXFIFOUNDRN                     (0x00000100UL)
#define USBFS_DIEPINT2_BNAINTR_POS                     (9U)
#define USBFS_DIEPINT2_BNAINTR                         (0x00000200UL)
#define USBFS_DIEPINT2_PKTDRPSTS_POS                   (11U)
#define USBFS_DIEPINT2_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DIEPINT2_BBLEERR_POS                     (12U)
#define USBFS_DIEPINT2_BBLEERR                         (0x00001000UL)
#define USBFS_DIEPINT2_NAKINTRPT_POS                   (13U)
#define USBFS_DIEPINT2_NAKINTRPT                       (0x00002000UL)
#define USBFS_DIEPINT2_NYETINTRPT_POS                  (14U)
#define USBFS_DIEPINT2_NYETINTRPT                      (0x00004000UL)

