levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DIEPTSIZ2 register  */
#define USBFS_DIEPTSIZ2_XFERSIZE_POS                   (0U)
#define USBFS_DIEPTSIZ2_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DIEPTSIZ2_PKTCNT_POS                     (19U)
#define USBFS_DIEPTSIZ2_PKTCNT                         (0x1FF80000UL)
#define USBFS_DIEPTSIZ2_MC_POS                         (29U)
#define USBFS_DIEPTSIZ2_MC                             (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA2 register  */
#define USBFS_DIEPDMA2                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS2 register  */
#define USBFS_DTXFSTS2_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL3 register  */
#define USBFS_DIEPCTL3_MPS_POS                         (0U)
#define USBFS_DIEPCTL3_MPS                             (0x000007FFUL)
#define USBFS_DIEPCTL3_USBACTEP_POS                    (15U)
#define USBFS_DIEPCTL3_USBACTEP                        (0x00008000UL)
#define USBFS_DIEPCTL3_DPID_POS                        (16U)
#define USBFS_DIEPCTL3_DPID                            (0x00010000UL)
#define USBFS_DIEPCTL3_NAKSTS_POS                      (17U)
#define USBFS_DIEPCTL3_NAKSTS                          (0x00020000UL)
#define USBFS_DIEPCTL3_EPTYPE_POS                      (18U)
#define USBFS_DIEPCTL3_EPTYPE                          (0x000C0000UL)
#define USBFS_DIEPCTL3_EPTYPE_0                        (0x00040000UL)
#define USBFS_DIEPCTL3_EPTYPE_1                        (0x00080000UL)
#define USBFS_DIEPCTL3_STALL_POS                       (21U)
#define USBFS_DIEPCTL3_STALL                           (0x00200000UL)
#define USBFS_DIEPCTL3_TXFNUM_POS                      (22U)
#define USBFS_DIEPCTL3_TXFNUM                          (0x03C00000UL)
#define USBFS_DIEPCTL3_CNAK_POS                        (26U)
#define USBFS_DIEPCTL3_CNAK                            (0x04000000UL)
#define USBFS_DIEPCTL3_SNAK_POS                        (27U)
#define USBFS_DIEPCTL3_SNAK                            (0x08000000UL)
#define USBFS_DIEPCTL3_SETD0PID_POS                    (28U)
#define USBFS_DIEPCTL3_SETD0PID                        (0x10000000UL)
#define USBFS_DIEPCTL3_SETD1PID_POS                    (29U)
#define USBFS_DIEPCTL3_SETD1PID                        (0x20000000UL)
#define USBFS_DIEPCTL3_EPDIS_POS                       (30U)
#define USBFS_DIEPCTL3_EPDIS                           (0x40000000UL)
#define USBFS_DIEPCTL3_EPENA_POS                       (31U)
#define USBFS_DIEPCTL3_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DIEPINT3 register  */
#define USBFS_DIEPINT3_XFERCOMPL_POS                   (0U)
#define USBFS_DIEPINT3_XFERCOMPL                       (0x00000001UL)
#define USBFS_DIEPINT3_EPDISBLD_POS                    (1U)
#define USBFS_DIEPINT3_EPDISBLD                        (0x00000002UL)
#define USBFS_DIEPINT3_AHBERR_POS                      (2U)
#define USBFS_DIEPINT3_AHBERR                          (0x00000004UL)
#define USBFS_DIEPINT3_TIMEOUT_POS                     (3U)
#define USBFS_DIEPINT3_TIMEOUT                         (0x00000008UL)
#define USBFS_DIEPINT3_INTKNTXFEMP_POS                 (4U)
#define USBFS_DIEPINT3_INTKNTXFEMP                     (0x00000010UL)
#define USBFS_DIEPINT3_INTKNEPMIS_POS                  (5U)
#define USBFS_DIEPINT3_INTKNEPMIS                      (0x00000020UL)
#define USBFS_DIEPINT3_INEPNAKEFF_POS                  (6U)
#define USBFS_DIEPINT3_INEPNAKEFF                      (0x00000040UL)
#define USBFS_DIEPINT3_TXFEMP_POS                      (7U)
#define USBFS_DIEPINT3_TXFEMP                          (0x00000080UL)
#define USBFS_DIEPINT3_TXFIFOUNDRN_POS                 (8U)
#define USBFS_DIEPINT3_TXFIFOUNDRN                     (0x00000100UL)
#define USBFS_DIEPINT3_BNAINTR_POS                     (9U)
#define USBFS_DIEPINT3_BNAINTR                         (0x00000200UL)
#define USBFS_DIEPINT3_PKTDRPSTS_POS                   (11U)
#define USBFS_DIEPINT3_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DIEPINT3_BBLEERR_POS                     (12U)
#define USBFS_DIEPINT3_BBLEERR                         (0x00001000UL)
#define USBFS_DIEPINT3_NAKINTRPT_POS                   (13U)
#define USBFS_DIEPINT3_NAKINTRPT                       (0x00002000UL)
#define USBFS_DIEPINT3_NYETINTRPT_POS                  (14U)
#define USBFS_DIEPINT3_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBFS_DIEPTSIZ3 register  */
#define USBFS_DIEPTSIZ3_XFERSIZE_POS                   (0U)
#define USBFS_DIEPTSIZ3_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DIEPTSIZ3_PKTCNT_POS                     (19U)
#define USBFS_DIEPTSIZ3_PKTCNT                         (0x1FF80000UL)
#define USBFS_DIEPTSIZ3_MC_POS                         (29U)
#define USBFS_DIEPTSIZ3_MC                             (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA3 register  */
#define USBFS_DIEPDMA3                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS3 register  */
#define USBFS_DTXFSTS3_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL4 register  */
#define USBFS_DIEPCTL4_MPS_POS                         (0U)
#define USBFS_DIEPCTL4_MPS                             (0x000007FFUL)
#define USBFS_DIEPCTL4_USBACTEP_POS                    (15U)
#define USBFS_DIEPCTL4_USBACTEP                        (0x00008000UL)
#define USBFS_DIEPCTL4_DPID_POS                        (16U)
#define USBFS_DIEPCTL4_DPID                            (0x00010000UL)
#define USBFS_DIEPCTL4_NAKSTS_POS                      (17U)
#define USBFS_DIEPCTL4_NAKSTS                          (0x00020000UL)
#define USBFS_DIEPCTL4_EPTYPE_POS                      (18U)
#define USBFS_DIEPCTL4_EPTYPE                          (0x000C0000UL)
#define USBFS_DIEPCTL4_EPTYPE_0                        (0x00040000UL)
#define USBFS_DIEPCTL4_EPTYPE_1                        (0x00080000UL)
#define USBFS_DIEPCTL4_STALL_POS                       (21U)
#define USBFS_DIEPCTL4_STALL                           (0x00200000UL)
#define USBFS_DIEPCTL4_TXFNUM_POS                      (22U)
#define USBFS_DIEPCTL4_TXFNUM                          (0x03C00000UL)
#define USBFS_DIEPCTL4_CNAK_POS                        (26U)
#define USBFS_DIEPCTL4_CNAK                            (0x04000000UL)
#define USBFS_DIEPCTL4_SNAK_POS                        (27U)
#define USBFS_DIEPCTL4_SNAK                            (0x08000000UL)
#define USBFS_DIEPCTL4_SETD0PID_POS                    (28U)
#define USBFS_DIEPCTL4_SETD0PID                        (0x10000000UL)
#define USBFS_DIEPCTL4_SETD1PID_POS                    (29U)
#define USBFS_DIEPCTL4_SETD1PID                        (0x20000000UL)
#define USBFS_DIEPCTL4_EPDIS_POS                       (30U)
#define USBFS_DIEPCTL4_EPDIS                           (0x40000000UL)
#define USBFS_DIEPCTL4_EPENA_POS                       (31U)
#define USBFS_DIEPCTL4_EPENA                           (0x80000000UL)

