levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DIEPINT4 register  */
#define USBFS_DIEPINT4_XFERCOMPL_POS                   (0U)
#define USBFS_DIEPINT4_XFERCOMPL                       (0x00000001UL)
#define USBFS_DIEPINT4_EPDISBLD_POS                    (1U)
#define USBFS_DIEPINT4_EPDISBLD                        (0x00000002UL)
#define USBFS_DIEPINT4_AHBERR_POS                      (2U)
#define USBFS_DIEPINT4_AHBERR                          (0x00000004UL)
#define USBFS_DIEPINT4_TIMEOUT_POS                     (3U)
#define USBFS_DIEPINT4_TIMEOUT                         (0x00000008UL)
#define USBFS_DIEPINT4_INTKNTXFEMP_POS                 (4U)
#define USBFS_DIEPINT4_INTKNTXFEMP                     (0x00000010UL)
#define USBFS_DIEPINT4_INTKNEPMIS_POS                  (5U)
#define USBFS_DIEPINT4_INTKNEPMIS                      (0x00000020UL)
#define USBFS_DIEPINT4_INEPNAKEFF_POS                  (6U)
#define USBFS_DIEPINT4_INEPNAKEFF                      (0x00000040UL)
#define USBFS_DIEPINT4_TXFEMP_POS                      (7U)
#define USBFS_DIEPINT4_TXFEMP                          (0x00000080UL)
#define USBFS_DIEPINT4_TXFIFOUNDRN_POS                 (8U)
#define USBFS_DIEPINT4_TXFIFOUNDRN                     (0x00000100UL)
#define USBFS_DIEPINT4_BNAINTR_POS                     (9U)
#define USBFS_DIEPINT4_BNAINTR                         (0x00000200UL)
#define USBFS_DIEPINT4_PKTDRPSTS_POS                   (11U)
#define USBFS_DIEPINT4_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DIEPINT4_BBLEERR_POS                     (12U)
#define USBFS_DIEPINT4_BBLEERR                         (0x00001000UL)
#define USBFS_DIEPINT4_NAKINTRPT_POS                   (13U)
#define USBFS_DIEPINT4_NAKINTRPT                       (0x00002000UL)
#define USBFS_DIEPINT4_NYETINTRPT_POS                  (14U)
#define USBFS_DIEPINT4_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBFS_DIEPTSIZ4 register  */
#define USBFS_DIEPTSIZ4_XFERSIZE_POS                   (0U)
#define USBFS_DIEPTSIZ4_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DIEPTSIZ4_PKTCNT_POS                     (19U)
#define USBFS_DIEPTSIZ4_PKTCNT                         (0x1FF80000UL)
#define USBFS_DIEPTSIZ4_MC_POS                         (29U)
#define USBFS_DIEPTSIZ4_MC                             (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA4 register  */
#define USBFS_DIEPDMA4                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS4 register  */
#define USBFS_DTXFSTS4_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL5 register  */
#define USBFS_DIEPCTL5_MPS_POS                         (0U)
#define USBFS_DIEPCTL5_MPS                             (0x000007FFUL)
#define USBFS_DIEPCTL5_USBACTEP_POS                    (15U)
#define USBFS_DIEPCTL5_USBACTEP                        (0x00008000UL)
#define USBFS_DIEPCTL5_DPID_POS                        (16U)
#define USBFS_DIEPCTL5_DPID                            (0x00010000UL)
#define USBFS_DIEPCTL5_NAKSTS_POS                      (17U)
#define USBFS_DIEPCTL5_NAKSTS                          (0x00020000UL)
#define USBFS_DIEPCTL5_EPTYPE_POS                      (18U)
#define USBFS_DIEPCTL5_EPTYPE                          (0x000C0000UL)
#define USBFS_DIEPCTL5_EPTYPE_0                        (0x00040000UL)
#define USBFS_DIEPCTL5_EPTYPE_1                        (0x00080000UL)
#define USBFS_DIEPCTL5_STALL_POS                       (21U)
#define USBFS_DIEPCTL5_STALL                           (0x00200000UL)
#define USBFS_DIEPCTL5_TXFNUM_POS                      (22U)
#define USBFS_DIEPCTL5_TXFNUM                          (0x03C00000UL)
#define USBFS_DIEPCTL5_CNAK_POS                        (26U)
#define USBFS_DIEPCTL5_CNAK                            (0x04000000UL)
#define USBFS_DIEPCTL5_SNAK_POS                        (27U)
#define USBFS_DIEPCTL5_SNAK                            (0x08000000UL)
#define USBFS_DIEPCTL5_SETD0PID_POS                    (28U)
#define USBFS_DIEPCTL5_SETD0PID                        (0x10000000UL)
#define USBFS_DIEPCTL5_SETD1PID_POS                    (29U)
#define USBFS_DIEPCTL5_SETD1PID                        (0x20000000UL)
#define USBFS_DIEPCTL5_EPDIS_POS                       (30U)
#define USBFS_DIEPCTL5_EPDIS                           (0x40000000UL)
#define USBFS_DIEPCTL5_EPENA_POS                       (31U)
#define USBFS_DIEPCTL5_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DIEPINT5 register  */
#define USBFS_DIEPINT5_XFERCOMPL_POS                   (0U)
#define USBFS_DIEPINT5_XFERCOMPL                       (0x00000001UL)
#define USBFS_DIEPINT5_EPDISBLD_POS                    (1U)
#define USBFS_DIEPINT5_EPDISBLD                        (0x00000002UL)
#define USBFS_DIEPINT5_AHBERR_POS                      (2U)
#define USBFS_DIEPINT5_AHBERR                          (0x00000004UL)
#define USBFS_DIEPINT5_TIMEOUT_POS                     (3U)
#define USBFS_DIEPINT5_TIMEOUT                         (0x00000008UL)
#define USBFS_DIEPINT5_INTKNTXFEMP_POS                 (4U)
#define USBFS_DIEPINT5_INTKNTXFEMP                     (0x00000010UL)
#define USBFS_DIEPINT5_INTKNEPMIS_POS                  (5U)
#define USBFS_DIEPINT5_INTKNEPMIS                      (0x00000020UL)
#define USBFS_DIEPINT5_INEPNAKEFF_POS                  (6U)
#define USBFS_DIEPINT5_INEPNAKEFF                      (0x00000040UL)
#define USBFS_DIEPINT5_TXFEMP_POS                      (7U)
#define USBFS_DIEPINT5_TXFEMP                          (0x00000080UL)
#define USBFS_DIEPINT5_TXFIFOUNDRN_POS                 (8U)
#define USBFS_DIEPINT5_TXFIFOUNDRN                     (0x00000100UL)
#define USBFS_DIEPINT5_BNAINTR_POS                     (9U)
#define USBFS_DIEPINT5_BNAINTR                         (0x00000200UL)
#define USBFS_DIEPINT5_PKTDRPSTS_POS                   (11U)
#define USBFS_DIEPINT5_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DIEPINT5_BBLEERR_POS                     (12U)
#define USBFS_DIEPINT5_BBLEERR                         (0x00001000UL)
#define USBFS_DIEPINT5_NAKINTRPT_POS                   (13U)
#define USBFS_DIEPINT5_NAKINTRPT                       (0x00002000UL)
#define USBFS_DIEPINT5_NYETINTRPT_POS                  (14U)
#define USBFS_DIEPINT5_NYETINTRPT                      (0x00004000UL)

