levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DIEPTSIZ5 register  */
#define USBFS_DIEPTSIZ5_XFERSIZE_POS                   (0U)
#define USBFS_DIEPTSIZ5_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DIEPTSIZ5_PKTCNT_POS                     (19U)
#define USBFS_DIEPTSIZ5_PKTCNT                         (0x1FF80000UL)
#define USBFS_DIEPTSIZ5_MC_POS                         (29U)
#define USBFS_DIEPTSIZ5_MC                             (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA5 register  */
#define USBFS_DIEPDMA5                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS5 register  */
#define USBFS_DTXFSTS5_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL6 register  */
#define USBFS_DIEPCTL6_MPS_POS                         (0U)
#define USBFS_DIEPCTL6_MPS                             (0x000007FFUL)
#define USBFS_DIEPCTL6_USBACTEP_POS                    (15U)
#define USBFS_DIEPCTL6_USBACTEP                        (0x00008000UL)
#define USBFS_DIEPCTL6_DPID_POS                        (16U)
#define USBFS_DIEPCTL6_DPID                            (0x00010000UL)
#define USBFS_DIEPCTL6_NAKSTS_POS                      (17U)
#define USBFS_DIEPCTL6_NAKSTS                          (0x00020000UL)
#define USBFS_DIEPCTL6_EPTYPE_POS                      (18U)
#define USBFS_DIEPCTL6_EPTYPE                          (0x000C0000UL)
#define USBFS_DIEPCTL6_EPTYPE_0                        (0x00040000UL)
#define USBFS_DIEPCTL6_EPTYPE_1                        (0x00080000UL)
#define USBFS_DIEPCTL6_STALL_POS                       (21U)
#define USBFS_DIEPCTL6_STALL                           (0x00200000UL)
#define USBFS_DIEPCTL6_TXFNUM_POS                      (22U)
#define USBFS_DIEPCTL6_TXFNUM                          (0x03C00000UL)
#define USBFS_DIEPCTL6_CNAK_POS                        (26U)
#define USBFS_DIEPCTL6_CNAK                            (0x04000000UL)
#define USBFS_DIEPCTL6_SNAK_POS                        (27U)
#define USBFS_DIEPCTL6_SNAK                            (0x08000000UL)
#define USBFS_DIEPCTL6_SETD0PID_POS                    (28U)
#define USBFS_DIEPCTL6_SETD0PID                        (0x10000000UL)
#define USBFS_DIEPCTL6_SETD1PID_POS                    (29U)
#define USBFS_DIEPCTL6_SETD1PID                        (0x20000000UL)
#define USBFS_DIEPCTL6_EPDIS_POS                       (30U)
#define USBFS_DIEPCTL6_EPDIS                           (0x40000000UL)
#define USBFS_DIEPCTL6_EPENA_POS                       (31U)
#define USBFS_DIEPCTL6_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DIEPINT6 register  */
#define USBFS_DIEPINT6_XFERCOMPL_POS                   (0U)
#define USBFS_DIEPINT6_XFERCOMPL                       (0x00000001UL)
#define USBFS_DIEPINT6_EPDISBLD_POS                    (1U)
#define USBFS_DIEPINT6_EPDISBLD                        (0x00000002UL)
#define USBFS_DIEPINT6_AHBERR_POS                      (2U)
#define USBFS_DIEPINT6_AHBERR                          (0x00000004UL)
#define USBFS_DIEPINT6_TIMEOUT_POS                     (3U)
#define USBFS_DIEPINT6_TIMEOUT                         (0x00000008UL)
#define USBFS_DIEPINT6_INTKNTXFEMP_POS                 (4U)
#define USBFS_DIEPINT6_INTKNTXFEMP                     (0x00000010UL)
#define USBFS_DIEPINT6_INTKNEPMIS_POS                  (5U)
#define USBFS_DIEPINT6_INTKNEPMIS                      (0x00000020UL)
#define USBFS_DIEPINT6_INEPNAKEFF_POS                  (6U)
#define USBFS_DIEPINT6_INEPNAKEFF                      (0x00000040UL)
#define USBFS_DIEPINT6_TXFEMP_POS                      (7U)
#define USBFS_DIEPINT6_TXFEMP                          (0x00000080UL)
#define USBFS_DIEPINT6_TXFIFOUNDRN_POS                 (8U)
#define USBFS_DIEPINT6_TXFIFOUNDRN                     (0x00000100UL)
#define USBFS_DIEPINT6_BNAINTR_POS                     (9U)
#define USBFS_DIEPINT6_BNAINTR                         (0x00000200UL)
#define USBFS_DIEPINT6_PKTDRPSTS_POS                   (11U)
#define USBFS_DIEPINT6_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DIEPINT6_BBLEERR_POS                     (12U)
#define USBFS_DIEPINT6_BBLEERR                         (0x00001000UL)
#define USBFS_DIEPINT6_NAKINTRPT_POS                   (13U)
#define USBFS_DIEPINT6_NAKINTRPT                       (0x00002000UL)
#define USBFS_DIEPINT6_NYETINTRPT_POS                  (14U)
#define USBFS_DIEPINT6_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBFS_DIEPTSIZ6 register  */
#define USBFS_DIEPTSIZ6_XFERSIZE_POS                   (0U)
#define USBFS_DIEPTSIZ6_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DIEPTSIZ6_PKTCNT_POS                     (19U)
#define USBFS_DIEPTSIZ6_PKTCNT                         (0x1FF80000UL)
#define USBFS_DIEPTSIZ6_MC_POS                         (29U)
#define USBFS_DIEPTSIZ6_MC                             (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA6 register  */
#define USBFS_DIEPDMA6                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS6 register  */
#define USBFS_DTXFSTS6_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL7 register  */
#define USBFS_DIEPCTL7_MPS_POS                         (0U)
#define USBFS_DIEPCTL7_MPS                             (0x000007FFUL)
#define USBFS_DIEPCTL7_USBACTEP_POS                    (15U)
#define USBFS_DIEPCTL7_USBACTEP                        (0x00008000UL)
#define USBFS_DIEPCTL7_DPID_POS                        (16U)
#define USBFS_DIEPCTL7_DPID                            (0x00010000UL)
#define USBFS_DIEPCTL7_NAKSTS_POS                      (17U)
#define USBFS_DIEPCTL7_NAKSTS                          (0x00020000UL)
#define USBFS_DIEPCTL7_EPTYPE_POS                      (18U)
#define USBFS_DIEPCTL7_EPTYPE                          (0x000C0000UL)
#define USBFS_DIEPCTL7_EPTYPE_0                        (0x00040000UL)
#define USBFS_DIEPCTL7_EPTYPE_1                        (0x00080000UL)
#define USBFS_DIEPCTL7_STALL_POS                       (21U)
#define USBFS_DIEPCTL7_STALL                           (0x00200000UL)
#define USBFS_DIEPCTL7_TXFNUM_POS                      (22U)
#define USBFS_DIEPCTL7_TXFNUM                          (0x03C00000UL)
#define USBFS_DIEPCTL7_CNAK_POS                        (26U)
#define USBFS_DIEPCTL7_CNAK                            (0x04000000UL)
#define USBFS_DIEPCTL7_SNAK_POS                        (27U)
#define USBFS_DIEPCTL7_SNAK                            (0x08000000UL)
#define USBFS_DIEPCTL7_SETD0PID_POS                    (28U)
#define USBFS_DIEPCTL7_SETD0PID                        (0x10000000UL)
#define USBFS_DIEPCTL7_SETD1PID_POS                    (29U)
#define USBFS_DIEPCTL7_SETD1PID                        (0x20000000UL)
#define USBFS_DIEPCTL7_EPDIS_POS                       (30U)
#define USBFS_DIEPCTL7_EPDIS                           (0x40000000UL)
#define USBFS_DIEPCTL7_EPENA_POS                       (31U)
#define USBFS_DIEPCTL7_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DIEPINT7 register  */
#define USBFS_DIEPINT7_XFERCOMPL_POS                   (0U)
#define USBFS_DIEPINT7_XFERCOMPL                       (0x00000001UL)
#define USBFS_DIEPINT7_EPDISBLD_POS                    (1U)
#define USBFS_DIEPINT7_EPDISBLD                        (0x00000002UL)
#define USBFS_DIEPINT7_AHBERR_POS                      (2U)
#define USBFS_DIEPINT7_AHBERR                          (0x00000004UL)
#define USBFS_DIEPINT7_TIMEOUT_POS                     (3U)
#define USBFS_DIEPINT7_TIMEOUT                         (0x00000008UL)
#define USBFS_DIEPINT7_INTKNTXFEMP_POS                 (4U)
#define USBFS_DIEPINT7_INTKNTXFEMP                     (0x00000010UL)
#define USBFS_DIEPINT7_INTKNEPMIS_POS                  (5U)
#define USBFS_DIEPINT7_INTKNEPMIS                      (0x00000020UL)
#define USBFS_DIEPINT7_INEPNAKEFF_POS                  (6U)
#define USBFS_DIEPINT7_INEPNAKEFF                      (0x00000040UL)
#define USBFS_DIEPINT7_TXFEMP_POS                      (7U)
#define USBFS_DIEPINT7_TXFEMP                          (0x00000080UL)
#define USBFS_DIEPINT7_TXFIFOUNDRN_POS                 (8U)
#define USBFS_DIEPINT7_TXFIFOUNDRN                     (0x00000100UL)
#define USBFS_DIEPINT7_BNAINTR_POS                     (9U)
#define USBFS_DIEPINT7_BNAINTR                         (0x00000200UL)
#define USBFS_DIEPINT7_PKTDRPSTS_POS                   (11U)
#define USBFS_DIEPINT7_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DIEPINT7_BBLEERR_POS                     (12U)
#define USBFS_DIEPINT7_BBLEERR                         (0x00001000UL)
#define USBFS_DIEPINT7_NAKINTRPT_POS                   (13U)
#define USBFS_DIEPINT7_NAKINTRPT                       (0x00002000UL)
#define USBFS_DIEPINT7_NYETINTRPT_POS                  (14U)
#define USBFS_DIEPINT7_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBFS_DIEPTSIZ7 register  */
#define USBFS_DIEPTSIZ7_XFERSIZE_POS                   (0U)
#define USBFS_DIEPTSIZ7_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DIEPTSIZ7_PKTCNT_POS                     (19U)
#define USBFS_DIEPTSIZ7_PKTCNT                         (0x1FF80000UL)
#define USBFS_DIEPTSIZ7_MC_POS                         (29U)
#define USBFS_DIEPTSIZ7_MC                             (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA7 register  */
#define USBFS_DIEPDMA7                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS7 register  */
#define USBFS_DTXFSTS7_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL8 register  */
#define USBFS_DIEPCTL8_MPS_POS                         (0U)
#define USBFS_DIEPCTL8_MPS                             (0x000007FFUL)
#define USBFS_DIEPCTL8_USBACTEP_POS                    (15U)
#define USBFS_DIEPCTL8_USBACTEP                        (0x00008000UL)
#define USBFS_DIEPCTL8_DPID_POS                        (16U)
#define USBFS_DIEPCTL8_DPID                            (0x00010000UL)
#define USBFS_DIEPCTL8_NAKSTS_POS                      (17U)
#define USBFS_DIEPCTL8_NAKSTS                          (0x00020000UL)
#define USBFS_DIEPCTL8_EPTYPE_POS                      (18U)
#define USBFS_DIEPCTL8_EPTYPE                          (0x000C0000UL)
#define USBFS_DIEPCTL8_EPTYPE_0                        (0x00040000UL)
#define USBFS_DIEPCTL8_EPTYPE_1                        (0x00080000UL)
#define USBFS_DIEPCTL8_STALL_POS                       (21U)
#define USBFS_DIEPCTL8_STALL                           (0x00200000UL)
#define USBFS_DIEPCTL8_TXFNUM_POS                      (22U)
#define USBFS_DIEPCTL8_TXFNUM                          (0x03C00000UL)
#define USBFS_DIEPCTL8_CNAK_POS                        (26U)
#define USBFS_DIEPCTL8_CNAK                            (0x04000000UL)
#define USBFS_DIEPCTL8_SNAK_POS                        (27U)
#define USBFS_DIEPCTL8_SNAK                            (0x08000000UL)
#define USBFS_DIEPCTL8_SETD0PID_POS                    (28U)
#define USBFS_DIEPCTL8_SETD0PID                        (0x10000000UL)
#define USBFS_DIEPCTL8_SETD1PID_POS                    (29U)
#define USBFS_DIEPCTL8_SETD1PID                        (0x20000000UL)
#define USBFS_DIEPCTL8_EPDIS_POS                       (30U)
#define USBFS_DIEPCTL8_EPDIS                           (0x40000000UL)
#define USBFS_DIEPCTL8_EPENA_POS                       (31U)
#define USBFS_DIEPCTL8_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DIEPINT8 register  */
#define USBFS_DIEPINT8_XFERCOMPL_POS                   (0U)
#define USBFS_DIEPINT8_XFERCOMPL                       (0x00000001UL)
#define USBFS_DIEPINT8_EPDISBLD_POS                    (1U)
#define USBFS_DIEPINT8_EPDISBLD                        (0x00000002UL)
#define USBFS_DIEPINT8_AHBERR_POS                      (2U)
#define USBFS_DIEPINT8_AHBERR                          (0x00000004UL)
#define USBFS_DIEPINT8_TIMEOUT_POS                     (3U)
#define USBFS_DIEPINT8_TIMEOUT                         (0x00000008UL)
#define USBFS_DIEPINT8_INTKNTXFEMP_POS                 (4U)
#define USBFS_DIEPINT8_INTKNTXFEMP                     (0x00000010UL)
#define USBFS_DIEPINT8_INTKNEPMIS_POS                  (5U)
#define USBFS_DIEPINT8_INTKNEPMIS                      (0x00000020UL)
#define USBFS_DIEPINT8_INEPNAKEFF_POS                  (6U)
#define USBFS_DIEPINT8_INEPNAKEFF                      (0x00000040UL)
#define USBFS_DIEPINT8_TXFEMP_POS                      (7U)
#define USBFS_DIEPINT8_TXFEMP                          (0x00000080UL)
#define USBFS_DIEPINT8_TXFIFOUNDRN_POS                 (8U)
#define USBFS_DIEPINT8_TXFIFOUNDRN                     (0x00000100UL)
#define USBFS_DIEPINT8_BNAINTR_POS                     (9U)
#define USBFS_DIEPINT8_BNAINTR                         (0x00000200UL)
#define USBFS_DIEPINT8_PKTDRPSTS_POS                   (11U)
#define USBFS_DIEPINT8_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DIEPINT8_BBLEERR_POS                     (12U)
#define USBFS_DIEPINT8_BBLEERR                         (0x00001000UL)
#define USBFS_DIEPINT8_NAKINTRPT_POS                   (13U)
#define USBFS_DIEPINT8_NAKINTRPT                       (0x00002000UL)
#define USBFS_DIEPINT8_NYETINTRPT_POS                  (14U)
#define USBFS_DIEPINT8_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBFS_DIEPTSIZ8 register  */
#define USBFS_DIEPTSIZ8_XFERSIZE_POS                   (0U)
#define USBFS_DIEPTSIZ8_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DIEPTSIZ8_PKTCNT_POS                     (19U)
#define USBFS_DIEPTSIZ8_PKTCNT                         (0x1FF80000UL)
#define USBFS_DIEPTSIZ8_MC_POS                         (29U)
#define USBFS_DIEPTSIZ8_MC                             (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA8 register  */
#define USBFS_DIEPDMA8                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS8 register  */
#define USBFS_DTXFSTS8_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

