levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DIEPCTL9 register  */
#define USBFS_DIEPCTL9_MPS_POS                         (0U)
#define USBFS_DIEPCTL9_MPS                             (0x000007FFUL)
#define USBFS_DIEPCTL9_USBACTEP_POS                    (15U)
#define USBFS_DIEPCTL9_USBACTEP                        (0x00008000UL)
#define USBFS_DIEPCTL9_DPID_POS                        (16U)
#define USBFS_DIEPCTL9_DPID                            (0x00010000UL)
#define USBFS_DIEPCTL9_NAKSTS_POS                      (17U)
#define USBFS_DIEPCTL9_NAKSTS                          (0x00020000UL)
#define USBFS_DIEPCTL9_EPTYPE_POS                      (18U)
#define USBFS_DIEPCTL9_EPTYPE                          (0x000C0000UL)
#define USBFS_DIEPCTL9_EPTYPE_0                        (0x00040000UL)
#define USBFS_DIEPCTL9_EPTYPE_1                        (0x00080000UL)
#define USBFS_DIEPCTL9_STALL_POS                       (21U)
#define USBFS_DIEPCTL9_STALL                           (0x00200000UL)
#define USBFS_DIEPCTL9_TXFNUM_POS                      (22U)
#define USBFS_DIEPCTL9_TXFNUM                          (0x03C00000UL)
#define USBFS_DIEPCTL9_CNAK_POS                        (26U)
#define USBFS_DIEPCTL9_CNAK                            (0x04000000UL)
#define USBFS_DIEPCTL9_SNAK_POS                        (27U)
#define USBFS_DIEPCTL9_SNAK                            (0x08000000UL)
#define USBFS_DIEPCTL9_SETD0PID_POS                    (28U)
#define USBFS_DIEPCTL9_SETD0PID                        (0x10000000UL)
#define USBFS_DIEPCTL9_SETD1PID_POS                    (29U)
#define USBFS_DIEPCTL9_SETD1PID                        (0x20000000UL)
#define USBFS_DIEPCTL9_EPDIS_POS                       (30U)
#define USBFS_DIEPCTL9_EPDIS                           (0x40000000UL)
#define USBFS_DIEPCTL9_EPENA_POS                       (31U)
#define USBFS_DIEPCTL9_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DIEPINT9 register  */
#define USBFS_DIEPINT9_XFERCOMPL_POS                   (0U)
#define USBFS_DIEPINT9_XFERCOMPL                       (0x00000001UL)
#define USBFS_DIEPINT9_EPDISBLD_POS                    (1U)
#define USBFS_DIEPINT9_EPDISBLD                        (0x00000002UL)
#define USBFS_DIEPINT9_AHBERR_POS                      (2U)
#define USBFS_DIEPINT9_AHBERR                          (0x00000004UL)
#define USBFS_DIEPINT9_TIMEOUT_POS                     (3U)
#define USBFS_DIEPINT9_TIMEOUT                         (0x00000008UL)
#define USBFS_DIEPINT9_INTKNTXFEMP_POS                 (4U)
#define USBFS_DIEPINT9_INTKNTXFEMP                     (0x00000010UL)
#define USBFS_DIEPINT9_INTKNEPMIS_POS                  (5U)
#define USBFS_DIEPINT9_INTKNEPMIS                      (0x00000020UL)
#define USBFS_DIEPINT9_INEPNAKEFF_POS                  (6U)
#define USBFS_DIEPINT9_INEPNAKEFF                      (0x00000040UL)
#define USBFS_DIEPINT9_TXFEMP_POS                      (7U)
#define USBFS_DIEPINT9_TXFEMP                          (0x00000080UL)
#define USBFS_DIEPINT9_TXFIFOUNDRN_POS                 (8U)
#define USBFS_DIEPINT9_TXFIFOUNDRN                     (0x00000100UL)
#define USBFS_DIEPINT9_BNAINTR_POS                     (9U)
#define USBFS_DIEPINT9_BNAINTR                         (0x00000200UL)
#define USBFS_DIEPINT9_PKTDRPSTS_POS                   (11U)
#define USBFS_DIEPINT9_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DIEPINT9_BBLEERR_POS                     (12U)
#define USBFS_DIEPINT9_BBLEERR                         (0x00001000UL)
#define USBFS_DIEPINT9_NAKINTRPT_POS                   (13U)
#define USBFS_DIEPINT9_NAKINTRPT                       (0x00002000UL)
#define USBFS_DIEPINT9_NYETINTRPT_POS                  (14U)
#define USBFS_DIEPINT9_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBFS_DIEPTSIZ9 register  */
#define USBFS_DIEPTSIZ9_XFERSIZE_POS                   (0U)
#define USBFS_DIEPTSIZ9_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DIEPTSIZ9_PKTCNT_POS                     (19U)
#define USBFS_DIEPTSIZ9_PKTCNT                         (0x1FF80000UL)
#define USBFS_DIEPTSIZ9_MC_POS                         (29U)
#define USBFS_DIEPTSIZ9_MC                             (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA9 register  */
#define USBFS_DIEPDMA9                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS9 register  */
#define USBFS_DTXFSTS9_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL10 register  */
#define USBFS_DIEPCTL10_MPS_POS                        (0U)
#define USBFS_DIEPCTL10_MPS                            (0x000007FFUL)
#define USBFS_DIEPCTL10_USBACTEP_POS                   (15U)
#define USBFS_DIEPCTL10_USBACTEP                       (0x00008000UL)
#define USBFS_DIEPCTL10_DPID_POS                       (16U)
#define USBFS_DIEPCTL10_DPID                           (0x00010000UL)
#define USBFS_DIEPCTL10_NAKSTS_POS                     (17U)
#define USBFS_DIEPCTL10_NAKSTS                         (0x00020000UL)
#define USBFS_DIEPCTL10_EPTYPE_POS                     (18U)
#define USBFS_DIEPCTL10_EPTYPE                         (0x000C0000UL)
#define USBFS_DIEPCTL10_EPTYPE_0                       (0x00040000UL)
#define USBFS_DIEPCTL10_EPTYPE_1                       (0x00080000UL)
#define USBFS_DIEPCTL10_STALL_POS                      (21U)
#define USBFS_DIEPCTL10_STALL                          (0x00200000UL)
#define USBFS_DIEPCTL10_TXFNUM_POS                     (22U)
#define USBFS_DIEPCTL10_TXFNUM                         (0x03C00000UL)
#define USBFS_DIEPCTL10_CNAK_POS                       (26U)
#define USBFS_DIEPCTL10_CNAK                           (0x04000000UL)
#define USBFS_DIEPCTL10_SNAK_POS                       (27U)
#define USBFS_DIEPCTL10_SNAK                           (0x08000000UL)
#define USBFS_DIEPCTL10_SETD0PID_POS                   (28U)
#define USBFS_DIEPCTL10_SETD0PID                       (0x10000000UL)
#define USBFS_DIEPCTL10_SETD1PID_POS                   (29U)
#define USBFS_DIEPCTL10_SETD1PID                       (0x20000000UL)
#define USBFS_DIEPCTL10_EPDIS_POS                      (30U)
#define USBFS_DIEPCTL10_EPDIS                          (0x40000000UL)
#define USBFS_DIEPCTL10_EPENA_POS                      (31U)
#define USBFS_DIEPCTL10_EPENA                          (0x80000000UL)

/*  Bit definition for USBFS_DIEPINT10 register  */
#define USBFS_DIEPINT10_XFERCOMPL_POS                  (0U)
#define USBFS_DIEPINT10_XFERCOMPL                      (0x00000001UL)
#define USBFS_DIEPINT10_EPDISBLD_POS                   (1U)
#define USBFS_DIEPINT10_EPDISBLD                       (0x00000002UL)
#define USBFS_DIEPINT10_AHBERR_POS                     (2U)
#define USBFS_DIEPINT10_AHBERR                         (0x00000004UL)
#define USBFS_DIEPINT10_TIMEOUT_POS                    (3U)
#define USBFS_DIEPINT10_TIMEOUT                        (0x00000008UL)
#define USBFS_DIEPINT10_INTKNTXFEMP_POS                (4U)
#define USBFS_DIEPINT10_INTKNTXFEMP                    (0x00000010UL)
#define USBFS_DIEPINT10_INTKNEPMIS_POS                 (5U)
#define USBFS_DIEPINT10_INTKNEPMIS                     (0x00000020UL)
#define USBFS_DIEPINT10_INEPNAKEFF_POS                 (6U)
#define USBFS_DIEPINT10_INEPNAKEFF                     (0x00000040UL)
#define USBFS_DIEPINT10_TXFEMP_POS                     (7U)
#define USBFS_DIEPINT10_TXFEMP                         (0x00000080UL)
#define USBFS_DIEPINT10_TXFIFOUNDRN_POS                (8U)
#define USBFS_DIEPINT10_TXFIFOUNDRN                    (0x00000100UL)
#define USBFS_DIEPINT10_BNAINTR_POS                    (9U)
#define USBFS_DIEPINT10_BNAINTR                        (0x00000200UL)
#define USBFS_DIEPINT10_PKTDRPSTS_POS                  (11U)
#define USBFS_DIEPINT10_PKTDRPSTS                      (0x00000800UL)
#define USBFS_DIEPINT10_BBLEERR_POS                    (12U)
#define USBFS_DIEPINT10_BBLEERR                        (0x00001000UL)
#define USBFS_DIEPINT10_NAKINTRPT_POS                  (13U)
#define USBFS_DIEPINT10_NAKINTRPT                      (0x00002000UL)
#define USBFS_DIEPINT10_NYETINTRPT_POS                 (14U)
#define USBFS_DIEPINT10_NYETINTRPT                     (0x00004000UL)

