levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DIEPTSIZ10 register  */
#define USBFS_DIEPTSIZ10_XFERSIZE_POS                  (0U)
#define USBFS_DIEPTSIZ10_XFERSIZE                      (0x0007FFFFUL)
#define USBFS_DIEPTSIZ10_PKTCNT_POS                    (19U)
#define USBFS_DIEPTSIZ10_PKTCNT                        (0x1FF80000UL)
#define USBFS_DIEPTSIZ10_MC_POS                        (29U)
#define USBFS_DIEPTSIZ10_MC                            (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA10 register  */
#define USBFS_DIEPDMA10                                (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS10 register  */
#define USBFS_DTXFSTS10_INEPTXFSPCAVAIL                (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL11 register  */
#define USBFS_DIEPCTL11_MPS_POS                        (0U)
#define USBFS_DIEPCTL11_MPS                            (0x000007FFUL)
#define USBFS_DIEPCTL11_USBACTEP_POS                   (15U)
#define USBFS_DIEPCTL11_USBACTEP                       (0x00008000UL)
#define USBFS_DIEPCTL11_DPID_POS                       (16U)
#define USBFS_DIEPCTL11_DPID                           (0x00010000UL)
#define USBFS_DIEPCTL11_NAKSTS_POS                     (17U)
#define USBFS_DIEPCTL11_NAKSTS                         (0x00020000UL)
#define USBFS_DIEPCTL11_EPTYPE_POS                     (18U)
#define USBFS_DIEPCTL11_EPTYPE                         (0x000C0000UL)
#define USBFS_DIEPCTL11_EPTYPE_0                       (0x00040000UL)
#define USBFS_DIEPCTL11_EPTYPE_1                       (0x00080000UL)
#define USBFS_DIEPCTL11_STALL_POS                      (21U)
#define USBFS_DIEPCTL11_STALL                          (0x00200000UL)
#define USBFS_DIEPCTL11_TXFNUM_POS                     (22U)
#define USBFS_DIEPCTL11_TXFNUM                         (0x03C00000UL)
#define USBFS_DIEPCTL11_CNAK_POS                       (26U)
#define USBFS_DIEPCTL11_CNAK                           (0x04000000UL)
#define USBFS_DIEPCTL11_SNAK_POS                       (27U)
#define USBFS_DIEPCTL11_SNAK                           (0x08000000UL)
#define USBFS_DIEPCTL11_SETD0PID_POS                   (28U)
#define USBFS_DIEPCTL11_SETD0PID                       (0x10000000UL)
#define USBFS_DIEPCTL11_SETD1PID_POS                   (29U)
#define USBFS_DIEPCTL11_SETD1PID                       (0x20000000UL)
#define USBFS_DIEPCTL11_EPDIS_POS                      (30U)
#define USBFS_DIEPCTL11_EPDIS                          (0x40000000UL)
#define USBFS_DIEPCTL11_EPENA_POS                      (31U)
#define USBFS_DIEPCTL11_EPENA                          (0x80000000UL)

/*  Bit definition for USBFS_DIEPINT11 register  */
#define USBFS_DIEPINT11_XFERCOMPL_POS                  (0U)
#define USBFS_DIEPINT11_XFERCOMPL                      (0x00000001UL)
#define USBFS_DIEPINT11_EPDISBLD_POS                   (1U)
#define USBFS_DIEPINT11_EPDISBLD                       (0x00000002UL)
#define USBFS_DIEPINT11_AHBERR_POS                     (2U)
#define USBFS_DIEPINT11_AHBERR                         (0x00000004UL)
#define USBFS_DIEPINT11_TIMEOUT_POS                    (3U)
#define USBFS_DIEPINT11_TIMEOUT                        (0x00000008UL)
#define USBFS_DIEPINT11_INTKNTXFEMP_POS                (4U)
#define USBFS_DIEPINT11_INTKNTXFEMP                    (0x00000010UL)
#define USBFS_DIEPINT11_INTKNEPMIS_POS                 (5U)
#define USBFS_DIEPINT11_INTKNEPMIS                     (0x00000020UL)
#define USBFS_DIEPINT11_INEPNAKEFF_POS                 (6U)
#define USBFS_DIEPINT11_INEPNAKEFF                     (0x00000040UL)
#define USBFS_DIEPINT11_TXFEMP_POS                     (7U)
#define USBFS_DIEPINT11_TXFEMP                         (0x00000080UL)
#define USBFS_DIEPINT11_TXFIFOUNDRN_POS                (8U)
#define USBFS_DIEPINT11_TXFIFOUNDRN                    (0x00000100UL)
#define USBFS_DIEPINT11_BNAINTR_POS                    (9U)
#define USBFS_DIEPINT11_BNAINTR                        (0x00000200UL)
#define USBFS_DIEPINT11_PKTDRPSTS_POS                  (11U)
#define USBFS_DIEPINT11_PKTDRPSTS                      (0x00000800UL)
#define USBFS_DIEPINT11_BBLEERR_POS                    (12U)
#define USBFS_DIEPINT11_BBLEERR                        (0x00001000UL)
#define USBFS_DIEPINT11_NAKINTRPT_POS                  (13U)
#define USBFS_DIEPINT11_NAKINTRPT                      (0x00002000UL)
#define USBFS_DIEPINT11_NYETINTRPT_POS                 (14U)
#define USBFS_DIEPINT11_NYETINTRPT                     (0x00004000UL)

/*  Bit definition for USBFS_DIEPTSIZ11 register  */
#define USBFS_DIEPTSIZ11_XFERSIZE_POS                  (0U)
#define USBFS_DIEPTSIZ11_XFERSIZE                      (0x0007FFFFUL)
#define USBFS_DIEPTSIZ11_PKTCNT_POS                    (19U)
#define USBFS_DIEPTSIZ11_PKTCNT                        (0x1FF80000UL)
#define USBFS_DIEPTSIZ11_MC_POS                        (29U)
#define USBFS_DIEPTSIZ11_MC                            (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA11 register  */
#define USBFS_DIEPDMA11                                (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS11 register  */
#define USBFS_DTXFSTS11_INEPTXFSPCAVAIL                (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL12 register  */
#define USBFS_DIEPCTL12_MPS_POS                        (0U)
#define USBFS_DIEPCTL12_MPS                            (0x000007FFUL)
#define USBFS_DIEPCTL12_USBACTEP_POS                   (15U)
#define USBFS_DIEPCTL12_USBACTEP                       (0x00008000UL)
#define USBFS_DIEPCTL12_DPID_POS                       (16U)
#define USBFS_DIEPCTL12_DPID                           (0x00010000UL)
#define USBFS_DIEPCTL12_NAKSTS_POS                     (17U)
#define USBFS_DIEPCTL12_NAKSTS                         (0x00020000UL)
#define USBFS_DIEPCTL12_EPTYPE_POS                     (18U)
#define USBFS_DIEPCTL12_EPTYPE                         (0x000C0000UL)
#define USBFS_DIEPCTL12_EPTYPE_0                       (0x00040000UL)
#define USBFS_DIEPCTL12_EPTYPE_1                       (0x00080000UL)
#define USBFS_DIEPCTL12_STALL_POS                      (21U)
#define USBFS_DIEPCTL12_STALL                          (0x00200000UL)
#define USBFS_DIEPCTL12_TXFNUM_POS                     (22U)
#define USBFS_DIEPCTL12_TXFNUM                         (0x03C00000UL)
#define USBFS_DIEPCTL12_CNAK_POS                       (26U)
#define USBFS_DIEPCTL12_CNAK                           (0x04000000UL)
#define USBFS_DIEPCTL12_SNAK_POS                       (27U)
#define USBFS_DIEPCTL12_SNAK                           (0x08000000UL)
#define USBFS_DIEPCTL12_SETD0PID_POS                   (28U)
#define USBFS_DIEPCTL12_SETD0PID                       (0x10000000UL)
#define USBFS_DIEPCTL12_SETD1PID_POS                   (29U)
#define USBFS_DIEPCTL12_SETD1PID                       (0x20000000UL)
#define USBFS_DIEPCTL12_EPDIS_POS                      (30U)
#define USBFS_DIEPCTL12_EPDIS                          (0x40000000UL)
#define USBFS_DIEPCTL12_EPENA_POS                      (31U)
#define USBFS_DIEPCTL12_EPENA                          (0x80000000UL)

/*  Bit definition for USBFS_DIEPINT12 register  */
#define USBFS_DIEPINT12_XFERCOMPL_POS                  (0U)
#define USBFS_DIEPINT12_XFERCOMPL                      (0x00000001UL)
#define USBFS_DIEPINT12_EPDISBLD_POS                   (1U)
#define USBFS_DIEPINT12_EPDISBLD                       (0x00000002UL)
#define USBFS_DIEPINT12_AHBERR_POS                     (2U)
#define USBFS_DIEPINT12_AHBERR                         (0x00000004UL)
#define USBFS_DIEPINT12_TIMEOUT_POS                    (3U)
#define USBFS_DIEPINT12_TIMEOUT                        (0x00000008UL)
#define USBFS_DIEPINT12_INTKNTXFEMP_POS                (4U)
#define USBFS_DIEPINT12_INTKNTXFEMP                    (0x00000010UL)
#define USBFS_DIEPINT12_INTKNEPMIS_POS                 (5U)
#define USBFS_DIEPINT12_INTKNEPMIS                     (0x00000020UL)
#define USBFS_DIEPINT12_INEPNAKEFF_POS                 (6U)
#define USBFS_DIEPINT12_INEPNAKEFF                     (0x00000040UL)
#define USBFS_DIEPINT12_TXFEMP_POS                     (7U)
#define USBFS_DIEPINT12_TXFEMP                         (0x00000080UL)
#define USBFS_DIEPINT12_TXFIFOUNDRN_POS                (8U)
#define USBFS_DIEPINT12_TXFIFOUNDRN                    (0x00000100UL)
#define USBFS_DIEPINT12_BNAINTR_POS                    (9U)
#define USBFS_DIEPINT12_BNAINTR                        (0x00000200UL)
#define USBFS_DIEPINT12_PKTDRPSTS_POS                  (11U)
#define USBFS_DIEPINT12_PKTDRPSTS                      (0x00000800UL)
#define USBFS_DIEPINT12_BBLEERR_POS                    (12U)
#define USBFS_DIEPINT12_BBLEERR                        (0x00001000UL)
#define USBFS_DIEPINT12_NAKINTRPT_POS                  (13U)
#define USBFS_DIEPINT12_NAKINTRPT                      (0x00002000UL)
#define USBFS_DIEPINT12_NYETINTRPT_POS                 (14U)
#define USBFS_DIEPINT12_NYETINTRPT                     (0x00004000UL)

/*  Bit definition for USBFS_DIEPTSIZ12 register  */
#define USBFS_DIEPTSIZ12_XFERSIZE_POS                  (0U)
#define USBFS_DIEPTSIZ12_XFERSIZE                      (0x0007FFFFUL)
#define USBFS_DIEPTSIZ12_PKTCNT_POS                    (19U)
#define USBFS_DIEPTSIZ12_PKTCNT                        (0x1FF80000UL)
#define USBFS_DIEPTSIZ12_MC_POS                        (29U)
#define USBFS_DIEPTSIZ12_MC                            (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA12 register  */
#define USBFS_DIEPDMA12                                (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS12 register  */
#define USBFS_DTXFSTS12_INEPTXFSPCAVAIL                (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL13 register  */
#define USBFS_DIEPCTL13_MPS_POS                        (0U)
#define USBFS_DIEPCTL13_MPS                            (0x000007FFUL)
#define USBFS_DIEPCTL13_USBACTEP_POS                   (15U)
#define USBFS_DIEPCTL13_USBACTEP                       (0x00008000UL)
#define USBFS_DIEPCTL13_DPID_POS                       (16U)
#define USBFS_DIEPCTL13_DPID                           (0x00010000UL)
#define USBFS_DIEPCTL13_NAKSTS_POS                     (17U)
#define USBFS_DIEPCTL13_NAKSTS                         (0x00020000UL)
#define USBFS_DIEPCTL13_EPTYPE_POS                     (18U)
#define USBFS_DIEPCTL13_EPTYPE                         (0x000C0000UL)
#define USBFS_DIEPCTL13_EPTYPE_0                       (0x00040000UL)
#define USBFS_DIEPCTL13_EPTYPE_1                       (0x00080000UL)
#define USBFS_DIEPCTL13_STALL_POS                      (21U)
#define USBFS_DIEPCTL13_STALL                          (0x00200000UL)
#define USBFS_DIEPCTL13_TXFNUM_POS                     (22U)
#define USBFS_DIEPCTL13_TXFNUM                         (0x03C00000UL)
#define USBFS_DIEPCTL13_CNAK_POS                       (26U)
#define USBFS_DIEPCTL13_CNAK                           (0x04000000UL)
#define USBFS_DIEPCTL13_SNAK_POS                       (27U)
#define USBFS_DIEPCTL13_SNAK                           (0x08000000UL)
#define USBFS_DIEPCTL13_SETD0PID_POS                   (28U)
#define USBFS_DIEPCTL13_SETD0PID                       (0x10000000UL)
#define USBFS_DIEPCTL13_SETD1PID_POS                   (29U)
#define USBFS_DIEPCTL13_SETD1PID                       (0x20000000UL)
#define USBFS_DIEPCTL13_EPDIS_POS                      (30U)
#define USBFS_DIEPCTL13_EPDIS                          (0x40000000UL)
#define USBFS_DIEPCTL13_EPENA_POS                      (31U)
#define USBFS_DIEPCTL13_EPENA                          (0x80000000UL)

