levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DIEPINT13 register  */
#define USBFS_DIEPINT13_XFERCOMPL_POS                  (0U)
#define USBFS_DIEPINT13_XFERCOMPL                      (0x00000001UL)
#define USBFS_DIEPINT13_EPDISBLD_POS                   (1U)
#define USBFS_DIEPINT13_EPDISBLD                       (0x00000002UL)
#define USBFS_DIEPINT13_AHBERR_POS                     (2U)
#define USBFS_DIEPINT13_AHBERR                         (0x00000004UL)
#define USBFS_DIEPINT13_TIMEOUT_POS                    (3U)
#define USBFS_DIEPINT13_TIMEOUT                        (0x00000008UL)
#define USBFS_DIEPINT13_INTKNTXFEMP_POS                (4U)
#define USBFS_DIEPINT13_INTKNTXFEMP                    (0x00000010UL)
#define USBFS_DIEPINT13_INTKNEPMIS_POS                 (5U)
#define USBFS_DIEPINT13_INTKNEPMIS                     (0x00000020UL)
#define USBFS_DIEPINT13_INEPNAKEFF_POS                 (6U)
#define USBFS_DIEPINT13_INEPNAKEFF                     (0x00000040UL)
#define USBFS_DIEPINT13_TXFEMP_POS                     (7U)
#define USBFS_DIEPINT13_TXFEMP                         (0x00000080UL)
#define USBFS_DIEPINT13_TXFIFOUNDRN_POS                (8U)
#define USBFS_DIEPINT13_TXFIFOUNDRN                    (0x00000100UL)
#define USBFS_DIEPINT13_BNAINTR_POS                    (9U)
#define USBFS_DIEPINT13_BNAINTR                        (0x00000200UL)
#define USBFS_DIEPINT13_PKTDRPSTS_POS                  (11U)
#define USBFS_DIEPINT13_PKTDRPSTS                      (0x00000800UL)
#define USBFS_DIEPINT13_BBLEERR_POS                    (12U)
#define USBFS_DIEPINT13_BBLEERR                        (0x00001000UL)
#define USBFS_DIEPINT13_NAKINTRPT_POS                  (13U)
#define USBFS_DIEPINT13_NAKINTRPT                      (0x00002000UL)
#define USBFS_DIEPINT13_NYETINTRPT_POS                 (14U)
#define USBFS_DIEPINT13_NYETINTRPT                     (0x00004000UL)

/*  Bit definition for USBFS_DIEPTSIZ13 register  */
#define USBFS_DIEPTSIZ13_XFERSIZE_POS                  (0U)
#define USBFS_DIEPTSIZ13_XFERSIZE                      (0x0007FFFFUL)
#define USBFS_DIEPTSIZ13_PKTCNT_POS                    (19U)
#define USBFS_DIEPTSIZ13_PKTCNT                        (0x1FF80000UL)
#define USBFS_DIEPTSIZ13_MC_POS                        (29U)
#define USBFS_DIEPTSIZ13_MC                            (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA13 register  */
#define USBFS_DIEPDMA13                                (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS13 register  */
#define USBFS_DTXFSTS13_INEPTXFSPCAVAIL                (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL14 register  */
#define USBFS_DIEPCTL14_MPS_POS                        (0U)
#define USBFS_DIEPCTL14_MPS                            (0x000007FFUL)
#define USBFS_DIEPCTL14_USBACTEP_POS                   (15U)
#define USBFS_DIEPCTL14_USBACTEP                       (0x00008000UL)
#define USBFS_DIEPCTL14_DPID_POS                       (16U)
#define USBFS_DIEPCTL14_DPID                           (0x00010000UL)
#define USBFS_DIEPCTL14_NAKSTS_POS                     (17U)
#define USBFS_DIEPCTL14_NAKSTS                         (0x00020000UL)
#define USBFS_DIEPCTL14_EPTYPE_POS                     (18U)
#define USBFS_DIEPCTL14_EPTYPE                         (0x000C0000UL)
#define USBFS_DIEPCTL14_EPTYPE_0                       (0x00040000UL)
#define USBFS_DIEPCTL14_EPTYPE_1                       (0x00080000UL)
#define USBFS_DIEPCTL14_STALL_POS                      (21U)
#define USBFS_DIEPCTL14_STALL                          (0x00200000UL)
#define USBFS_DIEPCTL14_TXFNUM_POS                     (22U)
#define USBFS_DIEPCTL14_TXFNUM                         (0x03C00000UL)
#define USBFS_DIEPCTL14_CNAK_POS                       (26U)
#define USBFS_DIEPCTL14_CNAK                           (0x04000000UL)
#define USBFS_DIEPCTL14_SNAK_POS                       (27U)
#define USBFS_DIEPCTL14_SNAK                           (0x08000000UL)
#define USBFS_DIEPCTL14_SETD0PID_POS                   (28U)
#define USBFS_DIEPCTL14_SETD0PID                       (0x10000000UL)
#define USBFS_DIEPCTL14_SETD1PID_POS                   (29U)
#define USBFS_DIEPCTL14_SETD1PID                       (0x20000000UL)
#define USBFS_DIEPCTL14_EPDIS_POS                      (30U)
#define USBFS_DIEPCTL14_EPDIS                          (0x40000000UL)
#define USBFS_DIEPCTL14_EPENA_POS                      (31U)
#define USBFS_DIEPCTL14_EPENA                          (0x80000000UL)

/*  Bit definition for USBFS_DIEPINT14 register  */
#define USBFS_DIEPINT14_XFERCOMPL_POS                  (0U)
#define USBFS_DIEPINT14_XFERCOMPL                      (0x00000001UL)
#define USBFS_DIEPINT14_EPDISBLD_POS                   (1U)
#define USBFS_DIEPINT14_EPDISBLD                       (0x00000002UL)
#define USBFS_DIEPINT14_AHBERR_POS                     (2U)
#define USBFS_DIEPINT14_AHBERR                         (0x00000004UL)
#define USBFS_DIEPINT14_TIMEOUT_POS                    (3U)
#define USBFS_DIEPINT14_TIMEOUT                        (0x00000008UL)
#define USBFS_DIEPINT14_INTKNTXFEMP_POS                (4U)
#define USBFS_DIEPINT14_INTKNTXFEMP                    (0x00000010UL)
#define USBFS_DIEPINT14_INTKNEPMIS_POS                 (5U)
#define USBFS_DIEPINT14_INTKNEPMIS                     (0x00000020UL)
#define USBFS_DIEPINT14_INEPNAKEFF_POS                 (6U)
#define USBFS_DIEPINT14_INEPNAKEFF                     (0x00000040UL)
#define USBFS_DIEPINT14_TXFEMP_POS                     (7U)
#define USBFS_DIEPINT14_TXFEMP                         (0x00000080UL)
#define USBFS_DIEPINT14_TXFIFOUNDRN_POS                (8U)
#define USBFS_DIEPINT14_TXFIFOUNDRN                    (0x00000100UL)
#define USBFS_DIEPINT14_BNAINTR_POS                    (9U)
#define USBFS_DIEPINT14_BNAINTR                        (0x00000200UL)
#define USBFS_DIEPINT14_PKTDRPSTS_POS                  (11U)
#define USBFS_DIEPINT14_PKTDRPSTS                      (0x00000800UL)
#define USBFS_DIEPINT14_BBLEERR_POS                    (12U)
#define USBFS_DIEPINT14_BBLEERR                        (0x00001000UL)
#define USBFS_DIEPINT14_NAKINTRPT_POS                  (13U)
#define USBFS_DIEPINT14_NAKINTRPT                      (0x00002000UL)
#define USBFS_DIEPINT14_NYETINTRPT_POS                 (14U)
#define USBFS_DIEPINT14_NYETINTRPT                     (0x00004000UL)

/*  Bit definition for USBFS_DIEPTSIZ14 register  */
#define USBFS_DIEPTSIZ14_XFERSIZE_POS                  (0U)
#define USBFS_DIEPTSIZ14_XFERSIZE                      (0x0007FFFFUL)
#define USBFS_DIEPTSIZ14_PKTCNT_POS                    (19U)
#define USBFS_DIEPTSIZ14_PKTCNT                        (0x1FF80000UL)
#define USBFS_DIEPTSIZ14_MC_POS                        (29U)
#define USBFS_DIEPTSIZ14_MC                            (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA14 register  */
#define USBFS_DIEPDMA14                                (0xFFFFFFFFUL)

