levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DTXFSTS14 register  */
#define USBFS_DTXFSTS14_INEPTXFSPCAVAIL                (0x0000FFFFUL)

/*  Bit definition for USBFS_DIEPCTL15 register  */
#define USBFS_DIEPCTL15_MPS_POS                        (0U)
#define USBFS_DIEPCTL15_MPS                            (0x000007FFUL)
#define USBFS_DIEPCTL15_USBACTEP_POS                   (15U)
#define USBFS_DIEPCTL15_USBACTEP                       (0x00008000UL)
#define USBFS_DIEPCTL15_DPID_POS                       (16U)
#define USBFS_DIEPCTL15_DPID                           (0x00010000UL)
#define USBFS_DIEPCTL15_NAKSTS_POS                     (17U)
#define USBFS_DIEPCTL15_NAKSTS                         (0x00020000UL)
#define USBFS_DIEPCTL15_EPTYPE_POS                     (18U)
#define USBFS_DIEPCTL15_EPTYPE                         (0x000C0000UL)
#define USBFS_DIEPCTL15_EPTYPE_0                       (0x00040000UL)
#define USBFS_DIEPCTL15_EPTYPE_1                       (0x00080000UL)
#define USBFS_DIEPCTL15_STALL_POS                      (21U)
#define USBFS_DIEPCTL15_STALL                          (0x00200000UL)
#define USBFS_DIEPCTL15_TXFNUM_POS                     (22U)
#define USBFS_DIEPCTL15_TXFNUM                         (0x03C00000UL)
#define USBFS_DIEPCTL15_CNAK_POS                       (26U)
#define USBFS_DIEPCTL15_CNAK                           (0x04000000UL)
#define USBFS_DIEPCTL15_SNAK_POS                       (27U)
#define USBFS_DIEPCTL15_SNAK                           (0x08000000UL)
#define USBFS_DIEPCTL15_SETD0PID_POS                   (28U)
#define USBFS_DIEPCTL15_SETD0PID                       (0x10000000UL)
#define USBFS_DIEPCTL15_SETD1PID_POS                   (29U)
#define USBFS_DIEPCTL15_SETD1PID                       (0x20000000UL)
#define USBFS_DIEPCTL15_EPDIS_POS                      (30U)
#define USBFS_DIEPCTL15_EPDIS                          (0x40000000UL)
#define USBFS_DIEPCTL15_EPENA_POS                      (31U)
#define USBFS_DIEPCTL15_EPENA                          (0x80000000UL)

/*  Bit definition for USBFS_DIEPINT15 register  */
#define USBFS_DIEPINT15_XFERCOMPL_POS                  (0U)
#define USBFS_DIEPINT15_XFERCOMPL                      (0x00000001UL)
#define USBFS_DIEPINT15_EPDISBLD_POS                   (1U)
#define USBFS_DIEPINT15_EPDISBLD                       (0x00000002UL)
#define USBFS_DIEPINT15_AHBERR_POS                     (2U)
#define USBFS_DIEPINT15_AHBERR                         (0x00000004UL)
#define USBFS_DIEPINT15_TIMEOUT_POS                    (3U)
#define USBFS_DIEPINT15_TIMEOUT                        (0x00000008UL)
#define USBFS_DIEPINT15_INTKNTXFEMP_POS                (4U)
#define USBFS_DIEPINT15_INTKNTXFEMP                    (0x00000010UL)
#define USBFS_DIEPINT15_INTKNEPMIS_POS                 (5U)
#define USBFS_DIEPINT15_INTKNEPMIS                     (0x00000020UL)
#define USBFS_DIEPINT15_INEPNAKEFF_POS                 (6U)
#define USBFS_DIEPINT15_INEPNAKEFF                     (0x00000040UL)
#define USBFS_DIEPINT15_TXFEMP_POS                     (7U)
#define USBFS_DIEPINT15_TXFEMP                         (0x00000080UL)
#define USBFS_DIEPINT15_TXFIFOUNDRN_POS                (8U)
#define USBFS_DIEPINT15_TXFIFOUNDRN                    (0x00000100UL)
#define USBFS_DIEPINT15_BNAINTR_POS                    (9U)
#define USBFS_DIEPINT15_BNAINTR                        (0x00000200UL)
#define USBFS_DIEPINT15_PKTDRPSTS_POS                  (11U)
#define USBFS_DIEPINT15_PKTDRPSTS                      (0x00000800UL)
#define USBFS_DIEPINT15_BBLEERR_POS                    (12U)
#define USBFS_DIEPINT15_BBLEERR                        (0x00001000UL)
#define USBFS_DIEPINT15_NAKINTRPT_POS                  (13U)
#define USBFS_DIEPINT15_NAKINTRPT                      (0x00002000UL)
#define USBFS_DIEPINT15_NYETINTRPT_POS                 (14U)
#define USBFS_DIEPINT15_NYETINTRPT                     (0x00004000UL)

/*  Bit definition for USBFS_DIEPTSIZ15 register  */
#define USBFS_DIEPTSIZ15_XFERSIZE_POS                  (0U)
#define USBFS_DIEPTSIZ15_XFERSIZE                      (0x0007FFFFUL)
#define USBFS_DIEPTSIZ15_PKTCNT_POS                    (19U)
#define USBFS_DIEPTSIZ15_PKTCNT                        (0x1FF80000UL)
#define USBFS_DIEPTSIZ15_MC_POS                        (29U)
#define USBFS_DIEPTSIZ15_MC                            (0x60000000UL)

/*  Bit definition for USBFS_DIEPDMA15 register  */
#define USBFS_DIEPDMA15                                (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DTXFSTS15 register  */
#define USBFS_DTXFSTS15_INEPTXFSPCAVAIL                (0x0000FFFFUL)

/*  Bit definition for USBFS_DOEPCTL0 register  */
#define USBFS_DOEPCTL0_MPS_POS                         (0U)
#define USBFS_DOEPCTL0_MPS                             (0x00000003UL)
#define USBFS_DOEPCTL0_USBACTEP_POS                    (15U)
#define USBFS_DOEPCTL0_USBACTEP                        (0x00008000UL)
#define USBFS_DOEPCTL0_NAKSTS_POS                      (17U)
#define USBFS_DOEPCTL0_NAKSTS                          (0x00020000UL)
#define USBFS_DOEPCTL0_EPTYPE_POS                      (18U)
#define USBFS_DOEPCTL0_EPTYPE                          (0x000C0000UL)
#define USBFS_DOEPCTL0_EPTYPE_0                        (0x00040000UL)
#define USBFS_DOEPCTL0_EPTYPE_1                        (0x00080000UL)
#define USBFS_DOEPCTL0_SNP_POS                         (20U)
#define USBFS_DOEPCTL0_SNP                             (0x00100000UL)
#define USBFS_DOEPCTL0_STALL_POS                       (21U)
#define USBFS_DOEPCTL0_STALL                           (0x00200000UL)
#define USBFS_DOEPCTL0_CNAK_POS                        (26U)
#define USBFS_DOEPCTL0_CNAK                            (0x04000000UL)
#define USBFS_DOEPCTL0_SNAK_POS                        (27U)
#define USBFS_DOEPCTL0_SNAK                            (0x08000000UL)
#define USBFS_DOEPCTL0_EPDIS_POS                       (30U)
#define USBFS_DOEPCTL0_EPDIS                           (0x40000000UL)
#define USBFS_DOEPCTL0_EPENA_POS                       (31U)
#define USBFS_DOEPCTL0_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DOEPINT0 register  */
#define USBFS_DOEPINT0_XFERCOMPL_POS                   (0U)
#define USBFS_DOEPINT0_XFERCOMPL                       (0x00000001UL)
#define USBFS_DOEPINT0_EPDISBLD_POS                    (1U)
#define USBFS_DOEPINT0_EPDISBLD                        (0x00000002UL)
#define USBFS_DOEPINT0_AHBERR_POS                      (2U)
#define USBFS_DOEPINT0_AHBERR                          (0x00000004UL)
#define USBFS_DOEPINT0_SETUP_POS                       (3U)
#define USBFS_DOEPINT0_SETUP                           (0x00000008UL)
#define USBFS_DOEPINT0_OUTTKNEPDIS_POS                 (4U)
#define USBFS_DOEPINT0_OUTTKNEPDIS                     (0x00000010UL)
#define USBFS_DOEPINT0_STSPHSERCVD_POS                 (5U)
#define USBFS_DOEPINT0_STSPHSERCVD                     (0x00000020UL)
#define USBFS_DOEPINT0_BACK2BACKSETUP_POS              (6U)
#define USBFS_DOEPINT0_BACK2BACKSETUP                  (0x00000040UL)
#define USBFS_DOEPINT0_OUTPKTERR_POS                   (8U)
#define USBFS_DOEPINT0_OUTPKTERR                       (0x00000100UL)
#define USBFS_DOEPINT0_BNAINTR_POS                     (9U)
#define USBFS_DOEPINT0_BNAINTR                         (0x00000200UL)
#define USBFS_DOEPINT0_PKTDRPSTS_POS                   (11U)
#define USBFS_DOEPINT0_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DOEPINT0_BBLEERR_POS                     (12U)
#define USBFS_DOEPINT0_BBLEERR                         (0x00001000UL)
#define USBFS_DOEPINT0_NAKINTRPT_POS                   (13U)
#define USBFS_DOEPINT0_NAKINTRPT                       (0x00002000UL)
#define USBFS_DOEPINT0_NYETINTRPT_POS                  (14U)
#define USBFS_DOEPINT0_NYETINTRPT                      (0x00004000UL)
#define USBFS_DOEPINT0_STUPPKTRCVD_POS                 (15U)
#define USBFS_DOEPINT0_STUPPKTRCVD                     (0x00008000UL)

/*  Bit definition for USBFS_DOEPTSIZ0 register  */
#define USBFS_DOEPTSIZ0_XFERSIZE_POS                   (0U)
#define USBFS_DOEPTSIZ0_XFERSIZE                       (0x0000007FUL)
#define USBFS_DOEPTSIZ0_PKTCNT_POS                     (19U)
#define USBFS_DOEPTSIZ0_SUPCNT_POS                     (29U)
#define USBFS_DOEPTSIZ0_SUPCNT                         (0x60000000UL)

/*  Bit definition for USBFS_DOEPDMA0 register  */
#define USBFS_DOEPDMA0                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL1 register  */
#define USBFS_DOEPCTL1_MPS_POS                         (0U)
#define USBFS_DOEPCTL1_MPS                             (0x000007FFUL)
#define USBFS_DOEPCTL1_USBACTEP_POS                    (15U)
#define USBFS_DOEPCTL1_USBACTEP                        (0x00008000UL)
#define USBFS_DOEPCTL1_DPID_POS                        (16U)
#define USBFS_DOEPCTL1_DPID                            (0x00010000UL)
#define USBFS_DOEPCTL1_NAKSTS_POS                      (17U)
#define USBFS_DOEPCTL1_NAKSTS                          (0x00020000UL)
#define USBFS_DOEPCTL1_EPTYPE_POS                      (18U)
#define USBFS_DOEPCTL1_EPTYPE                          (0x000C0000UL)
#define USBFS_DOEPCTL1_EPTYPE_0                        (0x00040000UL)
#define USBFS_DOEPCTL1_EPTYPE_1                        (0x00080000UL)
#define USBFS_DOEPCTL1_SNP_POS                         (20U)
#define USBFS_DOEPCTL1_SNP                             (0x00100000UL)
#define USBFS_DOEPCTL1_STALL_POS                       (21U)
#define USBFS_DOEPCTL1_STALL                           (0x00200000UL)
#define USBFS_DOEPCTL1_CNAK_POS                        (26U)
#define USBFS_DOEPCTL1_CNAK                            (0x04000000UL)
#define USBFS_DOEPCTL1_SNAK_POS                        (27U)
#define USBFS_DOEPCTL1_SNAK                            (0x08000000UL)
#define USBFS_DOEPCTL1_SETD0PID_POS                    (28U)
#define USBFS_DOEPCTL1_SETD0PID                        (0x10000000UL)
#define USBFS_DOEPCTL1_SETD1PID_POS                    (29U)
#define USBFS_DOEPCTL1_SETD1PID                        (0x20000000UL)
#define USBFS_DOEPCTL1_EPDIS_POS                       (30U)
#define USBFS_DOEPCTL1_EPDIS                           (0x40000000UL)
#define USBFS_DOEPCTL1_EPENA_POS                       (31U)
#define USBFS_DOEPCTL1_EPENA                           (0x80000000UL)

