levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DOEPINT1 register  */
#define USBFS_DOEPINT1_XFERCOMPL_POS                   (0U)
#define USBFS_DOEPINT1_XFERCOMPL                       (0x00000001UL)
#define USBFS_DOEPINT1_EPDISBLD_POS                    (1U)
#define USBFS_DOEPINT1_EPDISBLD                        (0x00000002UL)
#define USBFS_DOEPINT1_AHBERR_POS                      (2U)
#define USBFS_DOEPINT1_AHBERR                          (0x00000004UL)
#define USBFS_DOEPINT1_SETUP_POS                       (3U)
#define USBFS_DOEPINT1_SETUP                           (0x00000008UL)
#define USBFS_DOEPINT1_OUTTKNEPDIS_POS                 (4U)
#define USBFS_DOEPINT1_OUTTKNEPDIS                     (0x00000010UL)
#define USBFS_DOEPINT1_STSPHSERCVD_POS                 (5U)
#define USBFS_DOEPINT1_STSPHSERCVD                     (0x00000020UL)
#define USBFS_DOEPINT1_BACK2BACKSETUP_POS              (6U)
#define USBFS_DOEPINT1_BACK2BACKSETUP                  (0x00000040UL)
#define USBFS_DOEPINT1_OUTPKTERR_POS                   (8U)
#define USBFS_DOEPINT1_OUTPKTERR                       (0x00000100UL)
#define USBFS_DOEPINT1_BNAINTR_POS                     (9U)
#define USBFS_DOEPINT1_BNAINTR                         (0x00000200UL)
#define USBFS_DOEPINT1_PKTDRPSTS_POS                   (11U)
#define USBFS_DOEPINT1_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DOEPINT1_BBLEERR_POS                     (12U)
#define USBFS_DOEPINT1_BBLEERR                         (0x00001000UL)
#define USBFS_DOEPINT1_NAKINTRPT_POS                   (13U)
#define USBFS_DOEPINT1_NAKINTRPT                       (0x00002000UL)
#define USBFS_DOEPINT1_NYETINTRPT_POS                  (14U)
#define USBFS_DOEPINT1_NYETINTRPT                      (0x00004000UL)
#define USBFS_DOEPINT1_STUPPKTRCVD_POS                 (15U)
#define USBFS_DOEPINT1_STUPPKTRCVD                     (0x00008000UL)

/*  Bit definition for USBFS_DOEPTSIZ1 register  */
#define USBFS_DOEPTSIZ1_XFERSIZE_POS                   (0U)
#define USBFS_DOEPTSIZ1_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DOEPTSIZ1_PKTCNT_POS                     (19U)
#define USBFS_DOEPTSIZ1_PKTCNT                         (0x1FF80000UL)
#define USBFS_DOEPTSIZ1_RXDPID_POS                     (29U)
#define USBFS_DOEPTSIZ1_RXDPID                         (0x60000000UL)
#define USBFS_DOEPTSIZ1_RXDPID_0                       (0x20000000UL)
#define USBFS_DOEPTSIZ1_RXDPID_1                       (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA1 register  */
#define USBFS_DOEPDMA1                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL2 register  */
#define USBFS_DOEPCTL2_MPS_POS                         (0U)
#define USBFS_DOEPCTL2_MPS                             (0x000007FFUL)
#define USBFS_DOEPCTL2_USBACTEP_POS                    (15U)
#define USBFS_DOEPCTL2_USBACTEP                        (0x00008000UL)
#define USBFS_DOEPCTL2_DPID_POS                        (16U)
#define USBFS_DOEPCTL2_DPID                            (0x00010000UL)
#define USBFS_DOEPCTL2_NAKSTS_POS                      (17U)
#define USBFS_DOEPCTL2_NAKSTS                          (0x00020000UL)
#define USBFS_DOEPCTL2_EPTYPE_POS                      (18U)
#define USBFS_DOEPCTL2_EPTYPE                          (0x000C0000UL)
#define USBFS_DOEPCTL2_EPTYPE_0                        (0x00040000UL)
#define USBFS_DOEPCTL2_EPTYPE_1                        (0x00080000UL)
#define USBFS_DOEPCTL2_SNP_POS                         (20U)
#define USBFS_DOEPCTL2_SNP                             (0x00100000UL)
#define USBFS_DOEPCTL2_STALL_POS                       (21U)
#define USBFS_DOEPCTL2_STALL                           (0x00200000UL)
#define USBFS_DOEPCTL2_CNAK_POS                        (26U)
#define USBFS_DOEPCTL2_CNAK                            (0x04000000UL)
#define USBFS_DOEPCTL2_SNAK_POS                        (27U)
#define USBFS_DOEPCTL2_SNAK                            (0x08000000UL)
#define USBFS_DOEPCTL2_SETD0PID_POS                    (28U)
#define USBFS_DOEPCTL2_SETD0PID                        (0x10000000UL)
#define USBFS_DOEPCTL2_SETD1PID_POS                    (29U)
#define USBFS_DOEPCTL2_SETD1PID                        (0x20000000UL)
#define USBFS_DOEPCTL2_EPDIS_POS                       (30U)
#define USBFS_DOEPCTL2_EPDIS                           (0x40000000UL)
#define USBFS_DOEPCTL2_EPENA_POS                       (31U)
#define USBFS_DOEPCTL2_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DOEPINT2 register  */
#define USBFS_DOEPINT2_XFERCOMPL_POS                   (0U)
#define USBFS_DOEPINT2_XFERCOMPL                       (0x00000001UL)
#define USBFS_DOEPINT2_EPDISBLD_POS                    (1U)
#define USBFS_DOEPINT2_EPDISBLD                        (0x00000002UL)
#define USBFS_DOEPINT2_AHBERR_POS                      (2U)
#define USBFS_DOEPINT2_AHBERR                          (0x00000004UL)
#define USBFS_DOEPINT2_SETUP_POS                       (3U)
#define USBFS_DOEPINT2_SETUP                           (0x00000008UL)
#define USBFS_DOEPINT2_OUTTKNEPDIS_POS                 (4U)
#define USBFS_DOEPINT2_OUTTKNEPDIS                     (0x00000010UL)
#define USBFS_DOEPINT2_STSPHSERCVD_POS                 (5U)
#define USBFS_DOEPINT2_STSPHSERCVD                     (0x00000020UL)
#define USBFS_DOEPINT2_BACK2BACKSETUP_POS              (6U)
#define USBFS_DOEPINT2_BACK2BACKSETUP                  (0x00000040UL)
#define USBFS_DOEPINT2_OUTPKTERR_POS                   (8U)
#define USBFS_DOEPINT2_OUTPKTERR                       (0x00000100UL)
#define USBFS_DOEPINT2_BNAINTR_POS                     (9U)
#define USBFS_DOEPINT2_BNAINTR                         (0x00000200UL)
#define USBFS_DOEPINT2_PKTDRPSTS_POS                   (11U)
#define USBFS_DOEPINT2_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DOEPINT2_BBLEERR_POS                     (12U)
#define USBFS_DOEPINT2_BBLEERR                         (0x00001000UL)
#define USBFS_DOEPINT2_NAKINTRPT_POS                   (13U)
#define USBFS_DOEPINT2_NAKINTRPT                       (0x00002000UL)
#define USBFS_DOEPINT2_NYETINTRPT_POS                  (14U)
#define USBFS_DOEPINT2_NYETINTRPT                      (0x00004000UL)
#define USBFS_DOEPINT2_STUPPKTRCVD_POS                 (15U)
#define USBFS_DOEPINT2_STUPPKTRCVD                     (0x00008000UL)

/*  Bit definition for USBFS_DOEPTSIZ2 register  */
#define USBFS_DOEPTSIZ2_XFERSIZE_POS                   (0U)
#define USBFS_DOEPTSIZ2_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DOEPTSIZ2_PKTCNT_POS                     (19U)
#define USBFS_DOEPTSIZ2_PKTCNT                         (0x1FF80000UL)
#define USBFS_DOEPTSIZ2_RXDPID_POS                     (29U)
#define USBFS_DOEPTSIZ2_RXDPID                         (0x60000000UL)
#define USBFS_DOEPTSIZ2_RXDPID_0                       (0x20000000UL)
#define USBFS_DOEPTSIZ2_RXDPID_1                       (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA2 register  */
#define USBFS_DOEPDMA2                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL3 register  */
#define USBFS_DOEPCTL3_MPS_POS                         (0U)
#define USBFS_DOEPCTL3_MPS                             (0x000007FFUL)
#define USBFS_DOEPCTL3_USBACTEP_POS                    (15U)
#define USBFS_DOEPCTL3_USBACTEP                        (0x00008000UL)
#define USBFS_DOEPCTL3_DPID_POS                        (16U)
#define USBFS_DOEPCTL3_DPID                            (0x00010000UL)
#define USBFS_DOEPCTL3_NAKSTS_POS                      (17U)
#define USBFS_DOEPCTL3_NAKSTS                          (0x00020000UL)
#define USBFS_DOEPCTL3_EPTYPE_POS                      (18U)
#define USBFS_DOEPCTL3_EPTYPE                          (0x000C0000UL)
#define USBFS_DOEPCTL3_EPTYPE_0                        (0x00040000UL)
#define USBFS_DOEPCTL3_EPTYPE_1                        (0x00080000UL)
#define USBFS_DOEPCTL3_SNP_POS                         (20U)
#define USBFS_DOEPCTL3_SNP                             (0x00100000UL)
#define USBFS_DOEPCTL3_STALL_POS                       (21U)
#define USBFS_DOEPCTL3_STALL                           (0x00200000UL)
#define USBFS_DOEPCTL3_CNAK_POS                        (26U)
#define USBFS_DOEPCTL3_CNAK                            (0x04000000UL)
#define USBFS_DOEPCTL3_SNAK_POS                        (27U)
#define USBFS_DOEPCTL3_SNAK                            (0x08000000UL)
#define USBFS_DOEPCTL3_SETD0PID_POS                    (28U)
#define USBFS_DOEPCTL3_SETD0PID                        (0x10000000UL)
#define USBFS_DOEPCTL3_SETD1PID_POS                    (29U)
#define USBFS_DOEPCTL3_SETD1PID                        (0x20000000UL)
#define USBFS_DOEPCTL3_EPDIS_POS                       (30U)
#define USBFS_DOEPCTL3_EPDIS                           (0x40000000UL)
#define USBFS_DOEPCTL3_EPENA_POS                       (31U)
#define USBFS_DOEPCTL3_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DOEPINT3 register  */
#define USBFS_DOEPINT3_XFERCOMPL_POS                   (0U)
#define USBFS_DOEPINT3_XFERCOMPL                       (0x00000001UL)
#define USBFS_DOEPINT3_EPDISBLD_POS                    (1U)
#define USBFS_DOEPINT3_EPDISBLD                        (0x00000002UL)
#define USBFS_DOEPINT3_AHBERR_POS                      (2U)
#define USBFS_DOEPINT3_AHBERR                          (0x00000004UL)
#define USBFS_DOEPINT3_SETUP_POS                       (3U)
#define USBFS_DOEPINT3_SETUP                           (0x00000008UL)
#define USBFS_DOEPINT3_OUTTKNEPDIS_POS                 (4U)
#define USBFS_DOEPINT3_OUTTKNEPDIS                     (0x00000010UL)
#define USBFS_DOEPINT3_STSPHSERCVD_POS                 (5U)
#define USBFS_DOEPINT3_STSPHSERCVD                     (0x00000020UL)
#define USBFS_DOEPINT3_BACK2BACKSETUP_POS              (6U)
#define USBFS_DOEPINT3_BACK2BACKSETUP                  (0x00000040UL)
#define USBFS_DOEPINT3_OUTPKTERR_POS                   (8U)
#define USBFS_DOEPINT3_OUTPKTERR                       (0x00000100UL)
#define USBFS_DOEPINT3_BNAINTR_POS                     (9U)
#define USBFS_DOEPINT3_BNAINTR                         (0x00000200UL)
#define USBFS_DOEPINT3_PKTDRPSTS_POS                   (11U)
#define USBFS_DOEPINT3_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DOEPINT3_BBLEERR_POS                     (12U)
#define USBFS_DOEPINT3_BBLEERR                         (0x00001000UL)
#define USBFS_DOEPINT3_NAKINTRPT_POS                   (13U)
#define USBFS_DOEPINT3_NAKINTRPT                       (0x00002000UL)
#define USBFS_DOEPINT3_NYETINTRPT_POS                  (14U)
#define USBFS_DOEPINT3_NYETINTRPT                      (0x00004000UL)
#define USBFS_DOEPINT3_STUPPKTRCVD_POS                 (15U)
#define USBFS_DOEPINT3_STUPPKTRCVD                     (0x00008000UL)

