levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DOEPTSIZ3 register  */
#define USBFS_DOEPTSIZ3_XFERSIZE_POS                   (0U)
#define USBFS_DOEPTSIZ3_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DOEPTSIZ3_PKTCNT_POS                     (19U)
#define USBFS_DOEPTSIZ3_PKTCNT                         (0x1FF80000UL)
#define USBFS_DOEPTSIZ3_RXDPID_POS                     (29U)
#define USBFS_DOEPTSIZ3_RXDPID                         (0x60000000UL)
#define USBFS_DOEPTSIZ3_RXDPID_0                       (0x20000000UL)
#define USBFS_DOEPTSIZ3_RXDPID_1                       (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA3 register  */
#define USBFS_DOEPDMA3                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL4 register  */
#define USBFS_DOEPCTL4_MPS_POS                         (0U)
#define USBFS_DOEPCTL4_MPS                             (0x000007FFUL)
#define USBFS_DOEPCTL4_USBACTEP_POS                    (15U)
#define USBFS_DOEPCTL4_USBACTEP                        (0x00008000UL)
#define USBFS_DOEPCTL4_DPID_POS                        (16U)
#define USBFS_DOEPCTL4_DPID                            (0x00010000UL)
#define USBFS_DOEPCTL4_NAKSTS_POS                      (17U)
#define USBFS_DOEPCTL4_NAKSTS                          (0x00020000UL)
#define USBFS_DOEPCTL4_EPTYPE_POS                      (18U)
#define USBFS_DOEPCTL4_EPTYPE                          (0x000C0000UL)
#define USBFS_DOEPCTL4_EPTYPE_0                        (0x00040000UL)
#define USBFS_DOEPCTL4_EPTYPE_1                        (0x00080000UL)
#define USBFS_DOEPCTL4_SNP_POS                         (20U)
#define USBFS_DOEPCTL4_SNP                             (0x00100000UL)
#define USBFS_DOEPCTL4_STALL_POS                       (21U)
#define USBFS_DOEPCTL4_STALL                           (0x00200000UL)
#define USBFS_DOEPCTL4_CNAK_POS                        (26U)
#define USBFS_DOEPCTL4_CNAK                            (0x04000000UL)
#define USBFS_DOEPCTL4_SNAK_POS                        (27U)
#define USBFS_DOEPCTL4_SNAK                            (0x08000000UL)
#define USBFS_DOEPCTL4_SETD0PID_POS                    (28U)
#define USBFS_DOEPCTL4_SETD0PID                        (0x10000000UL)
#define USBFS_DOEPCTL4_SETD1PID_POS                    (29U)
#define USBFS_DOEPCTL4_SETD1PID                        (0x20000000UL)
#define USBFS_DOEPCTL4_EPDIS_POS                       (30U)
#define USBFS_DOEPCTL4_EPDIS                           (0x40000000UL)
#define USBFS_DOEPCTL4_EPENA_POS                       (31U)
#define USBFS_DOEPCTL4_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DOEPINT4 register  */
#define USBFS_DOEPINT4_XFERCOMPL_POS                   (0U)
#define USBFS_DOEPINT4_XFERCOMPL                       (0x00000001UL)
#define USBFS_DOEPINT4_EPDISBLD_POS                    (1U)
#define USBFS_DOEPINT4_EPDISBLD                        (0x00000002UL)
#define USBFS_DOEPINT4_AHBERR_POS                      (2U)
#define USBFS_DOEPINT4_AHBERR                          (0x00000004UL)
#define USBFS_DOEPINT4_SETUP_POS                       (3U)
#define USBFS_DOEPINT4_SETUP                           (0x00000008UL)
#define USBFS_DOEPINT4_OUTTKNEPDIS_POS                 (4U)
#define USBFS_DOEPINT4_OUTTKNEPDIS                     (0x00000010UL)
#define USBFS_DOEPINT4_STSPHSERCVD_POS                 (5U)
#define USBFS_DOEPINT4_STSPHSERCVD                     (0x00000020UL)
#define USBFS_DOEPINT4_BACK2BACKSETUP_POS              (6U)
#define USBFS_DOEPINT4_BACK2BACKSETUP                  (0x00000040UL)
#define USBFS_DOEPINT4_OUTPKTERR_POS                   (8U)
#define USBFS_DOEPINT4_OUTPKTERR                       (0x00000100UL)
#define USBFS_DOEPINT4_BNAINTR_POS                     (9U)
#define USBFS_DOEPINT4_BNAINTR                         (0x00000200UL)
#define USBFS_DOEPINT4_PKTDRPSTS_POS                   (11U)
#define USBFS_DOEPINT4_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DOEPINT4_BBLEERR_POS                     (12U)
#define USBFS_DOEPINT4_BBLEERR                         (0x00001000UL)
#define USBFS_DOEPINT4_NAKINTRPT_POS                   (13U)
#define USBFS_DOEPINT4_NAKINTRPT                       (0x00002000UL)
#define USBFS_DOEPINT4_NYETINTRPT_POS                  (14U)
#define USBFS_DOEPINT4_NYETINTRPT                      (0x00004000UL)
#define USBFS_DOEPINT4_STUPPKTRCVD_POS                 (15U)
#define USBFS_DOEPINT4_STUPPKTRCVD                     (0x00008000UL)

/*  Bit definition for USBFS_DOEPTSIZ4 register  */
#define USBFS_DOEPTSIZ4_XFERSIZE_POS                   (0U)
#define USBFS_DOEPTSIZ4_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DOEPTSIZ4_PKTCNT_POS                     (19U)
#define USBFS_DOEPTSIZ4_PKTCNT                         (0x1FF80000UL)
#define USBFS_DOEPTSIZ4_RXDPID_POS                     (29U)
#define USBFS_DOEPTSIZ4_RXDPID                         (0x60000000UL)
#define USBFS_DOEPTSIZ4_RXDPID_0                       (0x20000000UL)
#define USBFS_DOEPTSIZ4_RXDPID_1                       (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA4 register  */
#define USBFS_DOEPDMA4                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL5 register  */
#define USBFS_DOEPCTL5_MPS_POS                         (0U)
#define USBFS_DOEPCTL5_MPS                             (0x000007FFUL)
#define USBFS_DOEPCTL5_USBACTEP_POS                    (15U)
#define USBFS_DOEPCTL5_USBACTEP                        (0x00008000UL)
#define USBFS_DOEPCTL5_DPID_POS                        (16U)
#define USBFS_DOEPCTL5_DPID                            (0x00010000UL)
#define USBFS_DOEPCTL5_NAKSTS_POS                      (17U)
#define USBFS_DOEPCTL5_NAKSTS                          (0x00020000UL)
#define USBFS_DOEPCTL5_EPTYPE_POS                      (18U)
#define USBFS_DOEPCTL5_EPTYPE                          (0x000C0000UL)
#define USBFS_DOEPCTL5_EPTYPE_0                        (0x00040000UL)
#define USBFS_DOEPCTL5_EPTYPE_1                        (0x00080000UL)
#define USBFS_DOEPCTL5_SNP_POS                         (20U)
#define USBFS_DOEPCTL5_SNP                             (0x00100000UL)
#define USBFS_DOEPCTL5_STALL_POS                       (21U)
#define USBFS_DOEPCTL5_STALL                           (0x00200000UL)
#define USBFS_DOEPCTL5_CNAK_POS                        (26U)
#define USBFS_DOEPCTL5_CNAK                            (0x04000000UL)
#define USBFS_DOEPCTL5_SNAK_POS                        (27U)
#define USBFS_DOEPCTL5_SNAK                            (0x08000000UL)
#define USBFS_DOEPCTL5_SETD0PID_POS                    (28U)
#define USBFS_DOEPCTL5_SETD0PID                        (0x10000000UL)
#define USBFS_DOEPCTL5_SETD1PID_POS                    (29U)
#define USBFS_DOEPCTL5_SETD1PID                        (0x20000000UL)
#define USBFS_DOEPCTL5_EPDIS_POS                       (30U)
#define USBFS_DOEPCTL5_EPDIS                           (0x40000000UL)
#define USBFS_DOEPCTL5_EPENA_POS                       (31U)
#define USBFS_DOEPCTL5_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DOEPINT5 register  */
#define USBFS_DOEPINT5_XFERCOMPL_POS                   (0U)
#define USBFS_DOEPINT5_XFERCOMPL                       (0x00000001UL)
#define USBFS_DOEPINT5_EPDISBLD_POS                    (1U)
#define USBFS_DOEPINT5_EPDISBLD                        (0x00000002UL)
#define USBFS_DOEPINT5_AHBERR_POS                      (2U)
#define USBFS_DOEPINT5_AHBERR                          (0x00000004UL)
#define USBFS_DOEPINT5_SETUP_POS                       (3U)
#define USBFS_DOEPINT5_SETUP                           (0x00000008UL)
#define USBFS_DOEPINT5_OUTTKNEPDIS_POS                 (4U)
#define USBFS_DOEPINT5_OUTTKNEPDIS                     (0x00000010UL)
#define USBFS_DOEPINT5_STSPHSERCVD_POS                 (5U)
#define USBFS_DOEPINT5_STSPHSERCVD                     (0x00000020UL)
#define USBFS_DOEPINT5_BACK2BACKSETUP_POS              (6U)
#define USBFS_DOEPINT5_BACK2BACKSETUP                  (0x00000040UL)
#define USBFS_DOEPINT5_OUTPKTERR_POS                   (8U)
#define USBFS_DOEPINT5_OUTPKTERR                       (0x00000100UL)
#define USBFS_DOEPINT5_BNAINTR_POS                     (9U)
#define USBFS_DOEPINT5_BNAINTR                         (0x00000200UL)
#define USBFS_DOEPINT5_PKTDRPSTS_POS                   (11U)
#define USBFS_DOEPINT5_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DOEPINT5_BBLEERR_POS                     (12U)
#define USBFS_DOEPINT5_BBLEERR                         (0x00001000UL)
#define USBFS_DOEPINT5_NAKINTRPT_POS                   (13U)
#define USBFS_DOEPINT5_NAKINTRPT                       (0x00002000UL)
#define USBFS_DOEPINT5_NYETINTRPT_POS                  (14U)
#define USBFS_DOEPINT5_NYETINTRPT                      (0x00004000UL)
#define USBFS_DOEPINT5_STUPPKTRCVD_POS                 (15U)
#define USBFS_DOEPINT5_STUPPKTRCVD                     (0x00008000UL)

/*  Bit definition for USBFS_DOEPTSIZ5 register  */
#define USBFS_DOEPTSIZ5_XFERSIZE_POS                   (0U)
#define USBFS_DOEPTSIZ5_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DOEPTSIZ5_PKTCNT_POS                     (19U)
#define USBFS_DOEPTSIZ5_PKTCNT                         (0x1FF80000UL)
#define USBFS_DOEPTSIZ5_RXDPID_POS                     (29U)
#define USBFS_DOEPTSIZ5_RXDPID                         (0x60000000UL)
#define USBFS_DOEPTSIZ5_RXDPID_0                       (0x20000000UL)
#define USBFS_DOEPTSIZ5_RXDPID_1                       (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA5 register  */
#define USBFS_DOEPDMA5                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL6 register  */
#define USBFS_DOEPCTL6_MPS_POS                         (0U)
#define USBFS_DOEPCTL6_MPS                             (0x000007FFUL)
#define USBFS_DOEPCTL6_USBACTEP_POS                    (15U)
#define USBFS_DOEPCTL6_USBACTEP                        (0x00008000UL)
#define USBFS_DOEPCTL6_DPID_POS                        (16U)
#define USBFS_DOEPCTL6_DPID                            (0x00010000UL)
#define USBFS_DOEPCTL6_NAKSTS_POS                      (17U)
#define USBFS_DOEPCTL6_NAKSTS                          (0x00020000UL)
#define USBFS_DOEPCTL6_EPTYPE_POS                      (18U)
#define USBFS_DOEPCTL6_EPTYPE                          (0x000C0000UL)
#define USBFS_DOEPCTL6_EPTYPE_0                        (0x00040000UL)
#define USBFS_DOEPCTL6_EPTYPE_1                        (0x00080000UL)
#define USBFS_DOEPCTL6_SNP_POS                         (20U)
#define USBFS_DOEPCTL6_SNP                             (0x00100000UL)
#define USBFS_DOEPCTL6_STALL_POS                       (21U)
#define USBFS_DOEPCTL6_STALL                           (0x00200000UL)
#define USBFS_DOEPCTL6_CNAK_POS                        (26U)
#define USBFS_DOEPCTL6_CNAK                            (0x04000000UL)
#define USBFS_DOEPCTL6_SNAK_POS                        (27U)
#define USBFS_DOEPCTL6_SNAK                            (0x08000000UL)
#define USBFS_DOEPCTL6_SETD0PID_POS                    (28U)
#define USBFS_DOEPCTL6_SETD0PID                        (0x10000000UL)
#define USBFS_DOEPCTL6_SETD1PID_POS                    (29U)
#define USBFS_DOEPCTL6_SETD1PID                        (0x20000000UL)
#define USBFS_DOEPCTL6_EPDIS_POS                       (30U)
#define USBFS_DOEPCTL6_EPDIS                           (0x40000000UL)
#define USBFS_DOEPCTL6_EPENA_POS                       (31U)
#define USBFS_DOEPCTL6_EPENA                           (0x80000000UL)

