levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DOEPINT6 register  */
#define USBFS_DOEPINT6_XFERCOMPL_POS                   (0U)
#define USBFS_DOEPINT6_XFERCOMPL                       (0x00000001UL)
#define USBFS_DOEPINT6_EPDISBLD_POS                    (1U)
#define USBFS_DOEPINT6_EPDISBLD                        (0x00000002UL)
#define USBFS_DOEPINT6_AHBERR_POS                      (2U)
#define USBFS_DOEPINT6_AHBERR                          (0x00000004UL)
#define USBFS_DOEPINT6_SETUP_POS                       (3U)
#define USBFS_DOEPINT6_SETUP                           (0x00000008UL)
#define USBFS_DOEPINT6_OUTTKNEPDIS_POS                 (4U)
#define USBFS_DOEPINT6_OUTTKNEPDIS                     (0x00000010UL)
#define USBFS_DOEPINT6_STSPHSERCVD_POS                 (5U)
#define USBFS_DOEPINT6_STSPHSERCVD                     (0x00000020UL)
#define USBFS_DOEPINT6_BACK2BACKSETUP_POS              (6U)
#define USBFS_DOEPINT6_BACK2BACKSETUP                  (0x00000040UL)
#define USBFS_DOEPINT6_OUTPKTERR_POS                   (8U)
#define USBFS_DOEPINT6_OUTPKTERR                       (0x00000100UL)
#define USBFS_DOEPINT6_BNAINTR_POS                     (9U)
#define USBFS_DOEPINT6_BNAINTR                         (0x00000200UL)
#define USBFS_DOEPINT6_PKTDRPSTS_POS                   (11U)
#define USBFS_DOEPINT6_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DOEPINT6_BBLEERR_POS                     (12U)
#define USBFS_DOEPINT6_BBLEERR                         (0x00001000UL)
#define USBFS_DOEPINT6_NAKINTRPT_POS                   (13U)
#define USBFS_DOEPINT6_NAKINTRPT                       (0x00002000UL)
#define USBFS_DOEPINT6_NYETINTRPT_POS                  (14U)
#define USBFS_DOEPINT6_NYETINTRPT                      (0x00004000UL)
#define USBFS_DOEPINT6_STUPPKTRCVD_POS                 (15U)
#define USBFS_DOEPINT6_STUPPKTRCVD                     (0x00008000UL)

/*  Bit definition for USBFS_DOEPTSIZ6 register  */
#define USBFS_DOEPTSIZ6_XFERSIZE_POS                   (0U)
#define USBFS_DOEPTSIZ6_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DOEPTSIZ6_PKTCNT_POS                     (19U)
#define USBFS_DOEPTSIZ6_PKTCNT                         (0x1FF80000UL)
#define USBFS_DOEPTSIZ6_RXDPID_POS                     (29U)
#define USBFS_DOEPTSIZ6_RXDPID                         (0x60000000UL)
#define USBFS_DOEPTSIZ6_RXDPID_0                       (0x20000000UL)
#define USBFS_DOEPTSIZ6_RXDPID_1                       (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA6 register  */
#define USBFS_DOEPDMA6                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL7 register  */
#define USBFS_DOEPCTL7_MPS_POS                         (0U)
#define USBFS_DOEPCTL7_MPS                             (0x000007FFUL)
#define USBFS_DOEPCTL7_USBACTEP_POS                    (15U)
#define USBFS_DOEPCTL7_USBACTEP                        (0x00008000UL)
#define USBFS_DOEPCTL7_DPID_POS                        (16U)
#define USBFS_DOEPCTL7_DPID                            (0x00010000UL)
#define USBFS_DOEPCTL7_NAKSTS_POS                      (17U)
#define USBFS_DOEPCTL7_NAKSTS                          (0x00020000UL)
#define USBFS_DOEPCTL7_EPTYPE_POS                      (18U)
#define USBFS_DOEPCTL7_EPTYPE                          (0x000C0000UL)
#define USBFS_DOEPCTL7_EPTYPE_0                        (0x00040000UL)
#define USBFS_DOEPCTL7_EPTYPE_1                        (0x00080000UL)
#define USBFS_DOEPCTL7_SNP_POS                         (20U)
#define USBFS_DOEPCTL7_SNP                             (0x00100000UL)
#define USBFS_DOEPCTL7_STALL_POS                       (21U)
#define USBFS_DOEPCTL7_STALL                           (0x00200000UL)
#define USBFS_DOEPCTL7_CNAK_POS                        (26U)
#define USBFS_DOEPCTL7_CNAK                            (0x04000000UL)
#define USBFS_DOEPCTL7_SNAK_POS                        (27U)
#define USBFS_DOEPCTL7_SNAK                            (0x08000000UL)
#define USBFS_DOEPCTL7_SETD0PID_POS                    (28U)
#define USBFS_DOEPCTL7_SETD0PID                        (0x10000000UL)
#define USBFS_DOEPCTL7_SETD1PID_POS                    (29U)
#define USBFS_DOEPCTL7_SETD1PID                        (0x20000000UL)
#define USBFS_DOEPCTL7_EPDIS_POS                       (30U)
#define USBFS_DOEPCTL7_EPDIS                           (0x40000000UL)
#define USBFS_DOEPCTL7_EPENA_POS                       (31U)
#define USBFS_DOEPCTL7_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DOEPINT7 register  */
#define USBFS_DOEPINT7_XFERCOMPL_POS                   (0U)
#define USBFS_DOEPINT7_XFERCOMPL                       (0x00000001UL)
#define USBFS_DOEPINT7_EPDISBLD_POS                    (1U)
#define USBFS_DOEPINT7_EPDISBLD                        (0x00000002UL)
#define USBFS_DOEPINT7_AHBERR_POS                      (2U)
#define USBFS_DOEPINT7_AHBERR                          (0x00000004UL)
#define USBFS_DOEPINT7_SETUP_POS                       (3U)
#define USBFS_DOEPINT7_SETUP                           (0x00000008UL)
#define USBFS_DOEPINT7_OUTTKNEPDIS_POS                 (4U)
#define USBFS_DOEPINT7_OUTTKNEPDIS                     (0x00000010UL)
#define USBFS_DOEPINT7_STSPHSERCVD_POS                 (5U)
#define USBFS_DOEPINT7_STSPHSERCVD                     (0x00000020UL)
#define USBFS_DOEPINT7_BACK2BACKSETUP_POS              (6U)
#define USBFS_DOEPINT7_BACK2BACKSETUP                  (0x00000040UL)
#define USBFS_DOEPINT7_OUTPKTERR_POS                   (8U)
#define USBFS_DOEPINT7_OUTPKTERR                       (0x00000100UL)
#define USBFS_DOEPINT7_BNAINTR_POS                     (9U)
#define USBFS_DOEPINT7_BNAINTR                         (0x00000200UL)
#define USBFS_DOEPINT7_PKTDRPSTS_POS                   (11U)
#define USBFS_DOEPINT7_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DOEPINT7_BBLEERR_POS                     (12U)
#define USBFS_DOEPINT7_BBLEERR                         (0x00001000UL)
#define USBFS_DOEPINT7_NAKINTRPT_POS                   (13U)
#define USBFS_DOEPINT7_NAKINTRPT                       (0x00002000UL)
#define USBFS_DOEPINT7_NYETINTRPT_POS                  (14U)
#define USBFS_DOEPINT7_NYETINTRPT                      (0x00004000UL)
#define USBFS_DOEPINT7_STUPPKTRCVD_POS                 (15U)
#define USBFS_DOEPINT7_STUPPKTRCVD                     (0x00008000UL)

/*  Bit definition for USBFS_DOEPTSIZ7 register  */
#define USBFS_DOEPTSIZ7_XFERSIZE_POS                   (0U)
#define USBFS_DOEPTSIZ7_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DOEPTSIZ7_PKTCNT_POS                     (19U)
#define USBFS_DOEPTSIZ7_PKTCNT                         (0x1FF80000UL)
#define USBFS_DOEPTSIZ7_RXDPID_POS                     (29U)
#define USBFS_DOEPTSIZ7_RXDPID                         (0x60000000UL)
#define USBFS_DOEPTSIZ7_RXDPID_0                       (0x20000000UL)
#define USBFS_DOEPTSIZ7_RXDPID_1                       (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA7 register  */
#define USBFS_DOEPDMA7                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL8 register  */
#define USBFS_DOEPCTL8_MPS_POS                         (0U)
#define USBFS_DOEPCTL8_MPS                             (0x000007FFUL)
#define USBFS_DOEPCTL8_USBACTEP_POS                    (15U)
#define USBFS_DOEPCTL8_USBACTEP                        (0x00008000UL)
#define USBFS_DOEPCTL8_DPID_POS                        (16U)
#define USBFS_DOEPCTL8_DPID                            (0x00010000UL)
#define USBFS_DOEPCTL8_NAKSTS_POS                      (17U)
#define USBFS_DOEPCTL8_NAKSTS                          (0x00020000UL)
#define USBFS_DOEPCTL8_EPTYPE_POS                      (18U)
#define USBFS_DOEPCTL8_EPTYPE                          (0x000C0000UL)
#define USBFS_DOEPCTL8_EPTYPE_0                        (0x00040000UL)
#define USBFS_DOEPCTL8_EPTYPE_1                        (0x00080000UL)
#define USBFS_DOEPCTL8_SNP_POS                         (20U)
#define USBFS_DOEPCTL8_SNP                             (0x00100000UL)
#define USBFS_DOEPCTL8_STALL_POS                       (21U)
#define USBFS_DOEPCTL8_STALL                           (0x00200000UL)
#define USBFS_DOEPCTL8_CNAK_POS                        (26U)
#define USBFS_DOEPCTL8_CNAK                            (0x04000000UL)
#define USBFS_DOEPCTL8_SNAK_POS                        (27U)
#define USBFS_DOEPCTL8_SNAK                            (0x08000000UL)
#define USBFS_DOEPCTL8_SETD0PID_POS                    (28U)
#define USBFS_DOEPCTL8_SETD0PID                        (0x10000000UL)
#define USBFS_DOEPCTL8_SETD1PID_POS                    (29U)
#define USBFS_DOEPCTL8_SETD1PID                        (0x20000000UL)
#define USBFS_DOEPCTL8_EPDIS_POS                       (30U)
#define USBFS_DOEPCTL8_EPDIS                           (0x40000000UL)
#define USBFS_DOEPCTL8_EPENA_POS                       (31U)
#define USBFS_DOEPCTL8_EPENA                           (0x80000000UL)

