levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DOEPINT8 register  */
#define USBFS_DOEPINT8_XFERCOMPL_POS                   (0U)
#define USBFS_DOEPINT8_XFERCOMPL                       (0x00000001UL)
#define USBFS_DOEPINT8_EPDISBLD_POS                    (1U)
#define USBFS_DOEPINT8_EPDISBLD                        (0x00000002UL)
#define USBFS_DOEPINT8_AHBERR_POS                      (2U)
#define USBFS_DOEPINT8_AHBERR                          (0x00000004UL)
#define USBFS_DOEPINT8_SETUP_POS                       (3U)
#define USBFS_DOEPINT8_SETUP                           (0x00000008UL)
#define USBFS_DOEPINT8_OUTTKNEPDIS_POS                 (4U)
#define USBFS_DOEPINT8_OUTTKNEPDIS                     (0x00000010UL)
#define USBFS_DOEPINT8_STSPHSERCVD_POS                 (5U)
#define USBFS_DOEPINT8_STSPHSERCVD                     (0x00000020UL)
#define USBFS_DOEPINT8_BACK2BACKSETUP_POS              (6U)
#define USBFS_DOEPINT8_BACK2BACKSETUP                  (0x00000040UL)
#define USBFS_DOEPINT8_OUTPKTERR_POS                   (8U)
#define USBFS_DOEPINT8_OUTPKTERR                       (0x00000100UL)
#define USBFS_DOEPINT8_BNAINTR_POS                     (9U)
#define USBFS_DOEPINT8_BNAINTR                         (0x00000200UL)
#define USBFS_DOEPINT8_PKTDRPSTS_POS                   (11U)
#define USBFS_DOEPINT8_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DOEPINT8_BBLEERR_POS                     (12U)
#define USBFS_DOEPINT8_BBLEERR                         (0x00001000UL)
#define USBFS_DOEPINT8_NAKINTRPT_POS                   (13U)
#define USBFS_DOEPINT8_NAKINTRPT                       (0x00002000UL)
#define USBFS_DOEPINT8_NYETINTRPT_POS                  (14U)
#define USBFS_DOEPINT8_NYETINTRPT                      (0x00004000UL)
#define USBFS_DOEPINT8_STUPPKTRCVD_POS                 (15U)
#define USBFS_DOEPINT8_STUPPKTRCVD                     (0x00008000UL)

/*  Bit definition for USBFS_DOEPTSIZ8 register  */
#define USBFS_DOEPTSIZ8_XFERSIZE_POS                   (0U)
#define USBFS_DOEPTSIZ8_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DOEPTSIZ8_PKTCNT_POS                     (19U)
#define USBFS_DOEPTSIZ8_PKTCNT                         (0x1FF80000UL)
#define USBFS_DOEPTSIZ8_RXDPID_POS                     (29U)
#define USBFS_DOEPTSIZ8_RXDPID                         (0x60000000UL)
#define USBFS_DOEPTSIZ8_RXDPID_0                       (0x20000000UL)
#define USBFS_DOEPTSIZ8_RXDPID_1                       (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA8 register  */
#define USBFS_DOEPDMA8                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL9 register  */
#define USBFS_DOEPCTL9_MPS_POS                         (0U)
#define USBFS_DOEPCTL9_MPS                             (0x000007FFUL)
#define USBFS_DOEPCTL9_USBACTEP_POS                    (15U)
#define USBFS_DOEPCTL9_USBACTEP                        (0x00008000UL)
#define USBFS_DOEPCTL9_DPID_POS                        (16U)
#define USBFS_DOEPCTL9_DPID                            (0x00010000UL)
#define USBFS_DOEPCTL9_NAKSTS_POS                      (17U)
#define USBFS_DOEPCTL9_NAKSTS                          (0x00020000UL)
#define USBFS_DOEPCTL9_EPTYPE_POS                      (18U)
#define USBFS_DOEPCTL9_EPTYPE                          (0x000C0000UL)
#define USBFS_DOEPCTL9_EPTYPE_0                        (0x00040000UL)
#define USBFS_DOEPCTL9_EPTYPE_1                        (0x00080000UL)
#define USBFS_DOEPCTL9_SNP_POS                         (20U)
#define USBFS_DOEPCTL9_SNP                             (0x00100000UL)
#define USBFS_DOEPCTL9_STALL_POS                       (21U)
#define USBFS_DOEPCTL9_STALL                           (0x00200000UL)
#define USBFS_DOEPCTL9_CNAK_POS                        (26U)
#define USBFS_DOEPCTL9_CNAK                            (0x04000000UL)
#define USBFS_DOEPCTL9_SNAK_POS                        (27U)
#define USBFS_DOEPCTL9_SNAK                            (0x08000000UL)
#define USBFS_DOEPCTL9_SETD0PID_POS                    (28U)
#define USBFS_DOEPCTL9_SETD0PID                        (0x10000000UL)
#define USBFS_DOEPCTL9_SETD1PID_POS                    (29U)
#define USBFS_DOEPCTL9_SETD1PID                        (0x20000000UL)
#define USBFS_DOEPCTL9_EPDIS_POS                       (30U)
#define USBFS_DOEPCTL9_EPDIS                           (0x40000000UL)
#define USBFS_DOEPCTL9_EPENA_POS                       (31U)
#define USBFS_DOEPCTL9_EPENA                           (0x80000000UL)

/*  Bit definition for USBFS_DOEPINT9 register  */
#define USBFS_DOEPINT9_XFERCOMPL_POS                   (0U)
#define USBFS_DOEPINT9_XFERCOMPL                       (0x00000001UL)
#define USBFS_DOEPINT9_EPDISBLD_POS                    (1U)
#define USBFS_DOEPINT9_EPDISBLD                        (0x00000002UL)
#define USBFS_DOEPINT9_AHBERR_POS                      (2U)
#define USBFS_DOEPINT9_AHBERR                          (0x00000004UL)
#define USBFS_DOEPINT9_SETUP_POS                       (3U)
#define USBFS_DOEPINT9_SETUP                           (0x00000008UL)
#define USBFS_DOEPINT9_OUTTKNEPDIS_POS                 (4U)
#define USBFS_DOEPINT9_OUTTKNEPDIS                     (0x00000010UL)
#define USBFS_DOEPINT9_STSPHSERCVD_POS                 (5U)
#define USBFS_DOEPINT9_STSPHSERCVD                     (0x00000020UL)
#define USBFS_DOEPINT9_BACK2BACKSETUP_POS              (6U)
#define USBFS_DOEPINT9_BACK2BACKSETUP                  (0x00000040UL)
#define USBFS_DOEPINT9_OUTPKTERR_POS                   (8U)
#define USBFS_DOEPINT9_OUTPKTERR                       (0x00000100UL)
#define USBFS_DOEPINT9_BNAINTR_POS                     (9U)
#define USBFS_DOEPINT9_BNAINTR                         (0x00000200UL)
#define USBFS_DOEPINT9_PKTDRPSTS_POS                   (11U)
#define USBFS_DOEPINT9_PKTDRPSTS                       (0x00000800UL)
#define USBFS_DOEPINT9_BBLEERR_POS                     (12U)
#define USBFS_DOEPINT9_BBLEERR                         (0x00001000UL)
#define USBFS_DOEPINT9_NAKINTRPT_POS                   (13U)
#define USBFS_DOEPINT9_NAKINTRPT                       (0x00002000UL)
#define USBFS_DOEPINT9_NYETINTRPT_POS                  (14U)
#define USBFS_DOEPINT9_NYETINTRPT                      (0x00004000UL)
#define USBFS_DOEPINT9_STUPPKTRCVD_POS                 (15U)
#define USBFS_DOEPINT9_STUPPKTRCVD                     (0x00008000UL)

/*  Bit definition for USBFS_DOEPTSIZ9 register  */
#define USBFS_DOEPTSIZ9_XFERSIZE_POS                   (0U)
#define USBFS_DOEPTSIZ9_XFERSIZE                       (0x0007FFFFUL)
#define USBFS_DOEPTSIZ9_PKTCNT_POS                     (19U)
#define USBFS_DOEPTSIZ9_PKTCNT                         (0x1FF80000UL)
#define USBFS_DOEPTSIZ9_RXDPID_POS                     (29U)
#define USBFS_DOEPTSIZ9_RXDPID                         (0x60000000UL)
#define USBFS_DOEPTSIZ9_RXDPID_0                       (0x20000000UL)
#define USBFS_DOEPTSIZ9_RXDPID_1                       (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA9 register  */
#define USBFS_DOEPDMA9                                 (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL10 register  */
#define USBFS_DOEPCTL10_MPS_POS                        (0U)
#define USBFS_DOEPCTL10_MPS                            (0x000007FFUL)
#define USBFS_DOEPCTL10_USBACTEP_POS                   (15U)
#define USBFS_DOEPCTL10_USBACTEP                       (0x00008000UL)
#define USBFS_DOEPCTL10_DPID_POS                       (16U)
#define USBFS_DOEPCTL10_DPID                           (0x00010000UL)
#define USBFS_DOEPCTL10_NAKSTS_POS                     (17U)
#define USBFS_DOEPCTL10_NAKSTS                         (0x00020000UL)
#define USBFS_DOEPCTL10_EPTYPE_POS                     (18U)
#define USBFS_DOEPCTL10_EPTYPE                         (0x000C0000UL)
#define USBFS_DOEPCTL10_EPTYPE_0                       (0x00040000UL)
#define USBFS_DOEPCTL10_EPTYPE_1                       (0x00080000UL)
#define USBFS_DOEPCTL10_SNP_POS                        (20U)
#define USBFS_DOEPCTL10_SNP                            (0x00100000UL)
#define USBFS_DOEPCTL10_STALL_POS                      (21U)
#define USBFS_DOEPCTL10_STALL                          (0x00200000UL)
#define USBFS_DOEPCTL10_CNAK_POS                       (26U)
#define USBFS_DOEPCTL10_CNAK                           (0x04000000UL)
#define USBFS_DOEPCTL10_SNAK_POS                       (27U)
#define USBFS_DOEPCTL10_SNAK                           (0x08000000UL)
#define USBFS_DOEPCTL10_SETD0PID_POS                   (28U)
#define USBFS_DOEPCTL10_SETD0PID                       (0x10000000UL)
#define USBFS_DOEPCTL10_SETD1PID_POS                   (29U)
#define USBFS_DOEPCTL10_SETD1PID                       (0x20000000UL)
#define USBFS_DOEPCTL10_EPDIS_POS                      (30U)
#define USBFS_DOEPCTL10_EPDIS                          (0x40000000UL)
#define USBFS_DOEPCTL10_EPENA_POS                      (31U)
#define USBFS_DOEPCTL10_EPENA                          (0x80000000UL)

/*  Bit definition for USBFS_DOEPINT10 register  */
#define USBFS_DOEPINT10_XFERCOMPL_POS                  (0U)
#define USBFS_DOEPINT10_XFERCOMPL                      (0x00000001UL)
#define USBFS_DOEPINT10_EPDISBLD_POS                   (1U)
#define USBFS_DOEPINT10_EPDISBLD                       (0x00000002UL)
#define USBFS_DOEPINT10_AHBERR_POS                     (2U)
#define USBFS_DOEPINT10_AHBERR                         (0x00000004UL)
#define USBFS_DOEPINT10_SETUP_POS                      (3U)
#define USBFS_DOEPINT10_SETUP                          (0x00000008UL)
#define USBFS_DOEPINT10_OUTTKNEPDIS_POS                (4U)
#define USBFS_DOEPINT10_OUTTKNEPDIS                    (0x00000010UL)
#define USBFS_DOEPINT10_STSPHSERCVD_POS                (5U)
#define USBFS_DOEPINT10_STSPHSERCVD                    (0x00000020UL)
#define USBFS_DOEPINT10_BACK2BACKSETUP_POS             (6U)
#define USBFS_DOEPINT10_BACK2BACKSETUP                 (0x00000040UL)
#define USBFS_DOEPINT10_OUTPKTERR_POS                  (8U)
#define USBFS_DOEPINT10_OUTPKTERR                      (0x00000100UL)
#define USBFS_DOEPINT10_BNAINTR_POS                    (9U)
#define USBFS_DOEPINT10_BNAINTR                        (0x00000200UL)
#define USBFS_DOEPINT10_PKTDRPSTS_POS                  (11U)
#define USBFS_DOEPINT10_PKTDRPSTS                      (0x00000800UL)
#define USBFS_DOEPINT10_BBLEERR_POS                    (12U)
#define USBFS_DOEPINT10_BBLEERR                        (0x00001000UL)
#define USBFS_DOEPINT10_NAKINTRPT_POS                  (13U)
#define USBFS_DOEPINT10_NAKINTRPT                      (0x00002000UL)
#define USBFS_DOEPINT10_NYETINTRPT_POS                 (14U)
#define USBFS_DOEPINT10_NYETINTRPT                     (0x00004000UL)
#define USBFS_DOEPINT10_STUPPKTRCVD_POS                (15U)
#define USBFS_DOEPINT10_STUPPKTRCVD                    (0x00008000UL)

