levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DOEPTSIZ10 register  */
#define USBFS_DOEPTSIZ10_XFERSIZE_POS                  (0U)
#define USBFS_DOEPTSIZ10_XFERSIZE                      (0x0007FFFFUL)
#define USBFS_DOEPTSIZ10_PKTCNT_POS                    (19U)
#define USBFS_DOEPTSIZ10_PKTCNT                        (0x1FF80000UL)
#define USBFS_DOEPTSIZ10_RXDPID_POS                    (29U)
#define USBFS_DOEPTSIZ10_RXDPID                        (0x60000000UL)
#define USBFS_DOEPTSIZ10_RXDPID_0                      (0x20000000UL)
#define USBFS_DOEPTSIZ10_RXDPID_1                      (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA10 register  */
#define USBFS_DOEPDMA10                                (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL11 register  */
#define USBFS_DOEPCTL11_MPS_POS                        (0U)
#define USBFS_DOEPCTL11_MPS                            (0x000007FFUL)
#define USBFS_DOEPCTL11_USBACTEP_POS                   (15U)
#define USBFS_DOEPCTL11_USBACTEP                       (0x00008000UL)
#define USBFS_DOEPCTL11_DPID_POS                       (16U)
#define USBFS_DOEPCTL11_DPID                           (0x00010000UL)
#define USBFS_DOEPCTL11_NAKSTS_POS                     (17U)
#define USBFS_DOEPCTL11_NAKSTS                         (0x00020000UL)
#define USBFS_DOEPCTL11_EPTYPE_POS                     (18U)
#define USBFS_DOEPCTL11_EPTYPE                         (0x000C0000UL)
#define USBFS_DOEPCTL11_EPTYPE_0                       (0x00040000UL)
#define USBFS_DOEPCTL11_EPTYPE_1                       (0x00080000UL)
#define USBFS_DOEPCTL11_SNP_POS                        (20U)
#define USBFS_DOEPCTL11_SNP                            (0x00100000UL)
#define USBFS_DOEPCTL11_STALL_POS                      (21U)
#define USBFS_DOEPCTL11_STALL                          (0x00200000UL)
#define USBFS_DOEPCTL11_CNAK_POS                       (26U)
#define USBFS_DOEPCTL11_CNAK                           (0x04000000UL)
#define USBFS_DOEPCTL11_SNAK_POS                       (27U)
#define USBFS_DOEPCTL11_SNAK                           (0x08000000UL)
#define USBFS_DOEPCTL11_SETD0PID_POS                   (28U)
#define USBFS_DOEPCTL11_SETD0PID                       (0x10000000UL)
#define USBFS_DOEPCTL11_SETD1PID_POS                   (29U)
#define USBFS_DOEPCTL11_SETD1PID                       (0x20000000UL)
#define USBFS_DOEPCTL11_EPDIS_POS                      (30U)
#define USBFS_DOEPCTL11_EPDIS                          (0x40000000UL)
#define USBFS_DOEPCTL11_EPENA_POS                      (31U)
#define USBFS_DOEPCTL11_EPENA                          (0x80000000UL)

/*  Bit definition for USBFS_DOEPINT11 register  */
#define USBFS_DOEPINT11_XFERCOMPL_POS                  (0U)
#define USBFS_DOEPINT11_XFERCOMPL                      (0x00000001UL)
#define USBFS_DOEPINT11_EPDISBLD_POS                   (1U)
#define USBFS_DOEPINT11_EPDISBLD                       (0x00000002UL)
#define USBFS_DOEPINT11_AHBERR_POS                     (2U)
#define USBFS_DOEPINT11_AHBERR                         (0x00000004UL)
#define USBFS_DOEPINT11_SETUP_POS                      (3U)
#define USBFS_DOEPINT11_SETUP                          (0x00000008UL)
#define USBFS_DOEPINT11_OUTTKNEPDIS_POS                (4U)
#define USBFS_DOEPINT11_OUTTKNEPDIS                    (0x00000010UL)
#define USBFS_DOEPINT11_STSPHSERCVD_POS                (5U)
#define USBFS_DOEPINT11_STSPHSERCVD                    (0x00000020UL)
#define USBFS_DOEPINT11_BACK2BACKSETUP_POS             (6U)
#define USBFS_DOEPINT11_BACK2BACKSETUP                 (0x00000040UL)
#define USBFS_DOEPINT11_OUTPKTERR_POS                  (8U)
#define USBFS_DOEPINT11_OUTPKTERR                      (0x00000100UL)
#define USBFS_DOEPINT11_BNAINTR_POS                    (9U)
#define USBFS_DOEPINT11_BNAINTR                        (0x00000200UL)
#define USBFS_DOEPINT11_PKTDRPSTS_POS                  (11U)
#define USBFS_DOEPINT11_PKTDRPSTS                      (0x00000800UL)
#define USBFS_DOEPINT11_BBLEERR_POS                    (12U)
#define USBFS_DOEPINT11_BBLEERR                        (0x00001000UL)
#define USBFS_DOEPINT11_NAKINTRPT_POS                  (13U)
#define USBFS_DOEPINT11_NAKINTRPT                      (0x00002000UL)
#define USBFS_DOEPINT11_NYETINTRPT_POS                 (14U)
#define USBFS_DOEPINT11_NYETINTRPT                     (0x00004000UL)
#define USBFS_DOEPINT11_STUPPKTRCVD_POS                (15U)
#define USBFS_DOEPINT11_STUPPKTRCVD                    (0x00008000UL)

/*  Bit definition for USBFS_DOEPTSIZ11 register  */
#define USBFS_DOEPTSIZ11_XFERSIZE_POS                  (0U)
#define USBFS_DOEPTSIZ11_XFERSIZE                      (0x0007FFFFUL)
#define USBFS_DOEPTSIZ11_PKTCNT_POS                    (19U)
#define USBFS_DOEPTSIZ11_PKTCNT                        (0x1FF80000UL)
#define USBFS_DOEPTSIZ11_RXDPID_POS                    (29U)
#define USBFS_DOEPTSIZ11_RXDPID                        (0x60000000UL)
#define USBFS_DOEPTSIZ11_RXDPID_0                      (0x20000000UL)
#define USBFS_DOEPTSIZ11_RXDPID_1                      (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA11 register  */
#define USBFS_DOEPDMA11                                (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL12 register  */
#define USBFS_DOEPCTL12_MPS_POS                        (0U)
#define USBFS_DOEPCTL12_MPS                            (0x000007FFUL)
#define USBFS_DOEPCTL12_USBACTEP_POS                   (15U)
#define USBFS_DOEPCTL12_USBACTEP                       (0x00008000UL)
#define USBFS_DOEPCTL12_DPID_POS                       (16U)
#define USBFS_DOEPCTL12_DPID                           (0x00010000UL)
#define USBFS_DOEPCTL12_NAKSTS_POS                     (17U)
#define USBFS_DOEPCTL12_NAKSTS                         (0x00020000UL)
#define USBFS_DOEPCTL12_EPTYPE_POS                     (18U)
#define USBFS_DOEPCTL12_EPTYPE                         (0x000C0000UL)
#define USBFS_DOEPCTL12_EPTYPE_0                       (0x00040000UL)
#define USBFS_DOEPCTL12_EPTYPE_1                       (0x00080000UL)
#define USBFS_DOEPCTL12_SNP_POS                        (20U)
#define USBFS_DOEPCTL12_SNP                            (0x00100000UL)
#define USBFS_DOEPCTL12_STALL_POS                      (21U)
#define USBFS_DOEPCTL12_STALL                          (0x00200000UL)
#define USBFS_DOEPCTL12_CNAK_POS                       (26U)
#define USBFS_DOEPCTL12_CNAK                           (0x04000000UL)
#define USBFS_DOEPCTL12_SNAK_POS                       (27U)
#define USBFS_DOEPCTL12_SNAK                           (0x08000000UL)
#define USBFS_DOEPCTL12_SETD0PID_POS                   (28U)
#define USBFS_DOEPCTL12_SETD0PID                       (0x10000000UL)
#define USBFS_DOEPCTL12_SETD1PID_POS                   (29U)
#define USBFS_DOEPCTL12_SETD1PID                       (0x20000000UL)
#define USBFS_DOEPCTL12_EPDIS_POS                      (30U)
#define USBFS_DOEPCTL12_EPDIS                          (0x40000000UL)
#define USBFS_DOEPCTL12_EPENA_POS                      (31U)
#define USBFS_DOEPCTL12_EPENA                          (0x80000000UL)

