levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DOEPINT12 register  */
#define USBFS_DOEPINT12_XFERCOMPL_POS                  (0U)
#define USBFS_DOEPINT12_XFERCOMPL                      (0x00000001UL)
#define USBFS_DOEPINT12_EPDISBLD_POS                   (1U)
#define USBFS_DOEPINT12_EPDISBLD                       (0x00000002UL)
#define USBFS_DOEPINT12_AHBERR_POS                     (2U)
#define USBFS_DOEPINT12_AHBERR                         (0x00000004UL)
#define USBFS_DOEPINT12_SETUP_POS                      (3U)
#define USBFS_DOEPINT12_SETUP                          (0x00000008UL)
#define USBFS_DOEPINT12_OUTTKNEPDIS_POS                (4U)
#define USBFS_DOEPINT12_OUTTKNEPDIS                    (0x00000010UL)
#define USBFS_DOEPINT12_STSPHSERCVD_POS                (5U)
#define USBFS_DOEPINT12_STSPHSERCVD                    (0x00000020UL)
#define USBFS_DOEPINT12_BACK2BACKSETUP_POS             (6U)
#define USBFS_DOEPINT12_BACK2BACKSETUP                 (0x00000040UL)
#define USBFS_DOEPINT12_OUTPKTERR_POS                  (8U)
#define USBFS_DOEPINT12_OUTPKTERR                      (0x00000100UL)
#define USBFS_DOEPINT12_BNAINTR_POS                    (9U)
#define USBFS_DOEPINT12_BNAINTR                        (0x00000200UL)
#define USBFS_DOEPINT12_PKTDRPSTS_POS                  (11U)
#define USBFS_DOEPINT12_PKTDRPSTS                      (0x00000800UL)
#define USBFS_DOEPINT12_BBLEERR_POS                    (12U)
#define USBFS_DOEPINT12_BBLEERR                        (0x00001000UL)
#define USBFS_DOEPINT12_NAKINTRPT_POS                  (13U)
#define USBFS_DOEPINT12_NAKINTRPT                      (0x00002000UL)
#define USBFS_DOEPINT12_NYETINTRPT_POS                 (14U)
#define USBFS_DOEPINT12_NYETINTRPT                     (0x00004000UL)
#define USBFS_DOEPINT12_STUPPKTRCVD_POS                (15U)
#define USBFS_DOEPINT12_STUPPKTRCVD                    (0x00008000UL)

/*  Bit definition for USBFS_DOEPTSIZ12 register  */
#define USBFS_DOEPTSIZ12_XFERSIZE_POS                  (0U)
#define USBFS_DOEPTSIZ12_XFERSIZE                      (0x0007FFFFUL)
#define USBFS_DOEPTSIZ12_PKTCNT_POS                    (19U)
#define USBFS_DOEPTSIZ12_PKTCNT                        (0x1FF80000UL)
#define USBFS_DOEPTSIZ12_RXDPID_POS                    (29U)
#define USBFS_DOEPTSIZ12_RXDPID                        (0x60000000UL)
#define USBFS_DOEPTSIZ12_RXDPID_0                      (0x20000000UL)
#define USBFS_DOEPTSIZ12_RXDPID_1                      (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA12 register  */
#define USBFS_DOEPDMA12                                (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL13 register  */
#define USBFS_DOEPCTL13_MPS_POS                        (0U)
#define USBFS_DOEPCTL13_MPS                            (0x000007FFUL)
#define USBFS_DOEPCTL13_USBACTEP_POS                   (15U)
#define USBFS_DOEPCTL13_USBACTEP                       (0x00008000UL)
#define USBFS_DOEPCTL13_DPID_POS                       (16U)
#define USBFS_DOEPCTL13_DPID                           (0x00010000UL)
#define USBFS_DOEPCTL13_NAKSTS_POS                     (17U)
#define USBFS_DOEPCTL13_NAKSTS                         (0x00020000UL)
#define USBFS_DOEPCTL13_EPTYPE_POS                     (18U)
#define USBFS_DOEPCTL13_EPTYPE                         (0x000C0000UL)
#define USBFS_DOEPCTL13_EPTYPE_0                       (0x00040000UL)
#define USBFS_DOEPCTL13_EPTYPE_1                       (0x00080000UL)
#define USBFS_DOEPCTL13_SNP_POS                        (20U)
#define USBFS_DOEPCTL13_SNP                            (0x00100000UL)
#define USBFS_DOEPCTL13_STALL_POS                      (21U)
#define USBFS_DOEPCTL13_STALL                          (0x00200000UL)
#define USBFS_DOEPCTL13_CNAK_POS                       (26U)
#define USBFS_DOEPCTL13_CNAK                           (0x04000000UL)
#define USBFS_DOEPCTL13_SNAK_POS                       (27U)
#define USBFS_DOEPCTL13_SNAK                           (0x08000000UL)
#define USBFS_DOEPCTL13_SETD0PID_POS                   (28U)
#define USBFS_DOEPCTL13_SETD0PID                       (0x10000000UL)
#define USBFS_DOEPCTL13_SETD1PID_POS                   (29U)
#define USBFS_DOEPCTL13_SETD1PID                       (0x20000000UL)
#define USBFS_DOEPCTL13_EPDIS_POS                      (30U)
#define USBFS_DOEPCTL13_EPDIS                          (0x40000000UL)
#define USBFS_DOEPCTL13_EPENA_POS                      (31U)
#define USBFS_DOEPCTL13_EPENA                          (0x80000000UL)

/*  Bit definition for USBFS_DOEPINT13 register  */
#define USBFS_DOEPINT13_XFERCOMPL_POS                  (0U)
#define USBFS_DOEPINT13_XFERCOMPL                      (0x00000001UL)
#define USBFS_DOEPINT13_EPDISBLD_POS                   (1U)
#define USBFS_DOEPINT13_EPDISBLD                       (0x00000002UL)
#define USBFS_DOEPINT13_AHBERR_POS                     (2U)
#define USBFS_DOEPINT13_AHBERR                         (0x00000004UL)
#define USBFS_DOEPINT13_SETUP_POS                      (3U)
#define USBFS_DOEPINT13_SETUP                          (0x00000008UL)
#define USBFS_DOEPINT13_OUTTKNEPDIS_POS                (4U)
#define USBFS_DOEPINT13_OUTTKNEPDIS                    (0x00000010UL)
#define USBFS_DOEPINT13_STSPHSERCVD_POS                (5U)
#define USBFS_DOEPINT13_STSPHSERCVD                    (0x00000020UL)
#define USBFS_DOEPINT13_BACK2BACKSETUP_POS             (6U)
#define USBFS_DOEPINT13_BACK2BACKSETUP                 (0x00000040UL)
#define USBFS_DOEPINT13_OUTPKTERR_POS                  (8U)
#define USBFS_DOEPINT13_OUTPKTERR                      (0x00000100UL)
#define USBFS_DOEPINT13_BNAINTR_POS                    (9U)
#define USBFS_DOEPINT13_BNAINTR                        (0x00000200UL)
#define USBFS_DOEPINT13_PKTDRPSTS_POS                  (11U)
#define USBFS_DOEPINT13_PKTDRPSTS                      (0x00000800UL)
#define USBFS_DOEPINT13_BBLEERR_POS                    (12U)
#define USBFS_DOEPINT13_BBLEERR                        (0x00001000UL)
#define USBFS_DOEPINT13_NAKINTRPT_POS                  (13U)
#define USBFS_DOEPINT13_NAKINTRPT                      (0x00002000UL)
#define USBFS_DOEPINT13_NYETINTRPT_POS                 (14U)
#define USBFS_DOEPINT13_NYETINTRPT                     (0x00004000UL)
#define USBFS_DOEPINT13_STUPPKTRCVD_POS                (15U)
#define USBFS_DOEPINT13_STUPPKTRCVD                    (0x00008000UL)

/*  Bit definition for USBFS_DOEPTSIZ13 register  */
#define USBFS_DOEPTSIZ13_XFERSIZE_POS                  (0U)
#define USBFS_DOEPTSIZ13_XFERSIZE                      (0x0007FFFFUL)
#define USBFS_DOEPTSIZ13_PKTCNT_POS                    (19U)
#define USBFS_DOEPTSIZ13_PKTCNT                        (0x1FF80000UL)
#define USBFS_DOEPTSIZ13_RXDPID_POS                    (29U)
#define USBFS_DOEPTSIZ13_RXDPID                        (0x60000000UL)
#define USBFS_DOEPTSIZ13_RXDPID_0                      (0x20000000UL)
#define USBFS_DOEPTSIZ13_RXDPID_1                      (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA13 register  */
#define USBFS_DOEPDMA13                                (0xFFFFFFFFUL)

