levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DOEPCTL14 register  */
#define USBFS_DOEPCTL14_MPS_POS                        (0U)
#define USBFS_DOEPCTL14_MPS                            (0x000007FFUL)
#define USBFS_DOEPCTL14_USBACTEP_POS                   (15U)
#define USBFS_DOEPCTL14_USBACTEP                       (0x00008000UL)
#define USBFS_DOEPCTL14_DPID_POS                       (16U)
#define USBFS_DOEPCTL14_DPID                           (0x00010000UL)
#define USBFS_DOEPCTL14_NAKSTS_POS                     (17U)
#define USBFS_DOEPCTL14_NAKSTS                         (0x00020000UL)
#define USBFS_DOEPCTL14_EPTYPE_POS                     (18U)
#define USBFS_DOEPCTL14_EPTYPE                         (0x000C0000UL)
#define USBFS_DOEPCTL14_EPTYPE_0                       (0x00040000UL)
#define USBFS_DOEPCTL14_EPTYPE_1                       (0x00080000UL)
#define USBFS_DOEPCTL14_SNP_POS                        (20U)
#define USBFS_DOEPCTL14_SNP                            (0x00100000UL)
#define USBFS_DOEPCTL14_STALL_POS                      (21U)
#define USBFS_DOEPCTL14_STALL                          (0x00200000UL)
#define USBFS_DOEPCTL14_CNAK_POS                       (26U)
#define USBFS_DOEPCTL14_CNAK                           (0x04000000UL)
#define USBFS_DOEPCTL14_SNAK_POS                       (27U)
#define USBFS_DOEPCTL14_SNAK                           (0x08000000UL)
#define USBFS_DOEPCTL14_SETD0PID_POS                   (28U)
#define USBFS_DOEPCTL14_SETD0PID                       (0x10000000UL)
#define USBFS_DOEPCTL14_SETD1PID_POS                   (29U)
#define USBFS_DOEPCTL14_SETD1PID                       (0x20000000UL)
#define USBFS_DOEPCTL14_EPDIS_POS                      (30U)
#define USBFS_DOEPCTL14_EPDIS                          (0x40000000UL)
#define USBFS_DOEPCTL14_EPENA_POS                      (31U)
#define USBFS_DOEPCTL14_EPENA                          (0x80000000UL)

/*  Bit definition for USBFS_DOEPINT14 register  */
#define USBFS_DOEPINT14_XFERCOMPL_POS                  (0U)
#define USBFS_DOEPINT14_XFERCOMPL                      (0x00000001UL)
#define USBFS_DOEPINT14_EPDISBLD_POS                   (1U)
#define USBFS_DOEPINT14_EPDISBLD                       (0x00000002UL)
#define USBFS_DOEPINT14_AHBERR_POS                     (2U)
#define USBFS_DOEPINT14_AHBERR                         (0x00000004UL)
#define USBFS_DOEPINT14_SETUP_POS                      (3U)
#define USBFS_DOEPINT14_SETUP                          (0x00000008UL)
#define USBFS_DOEPINT14_OUTTKNEPDIS_POS                (4U)
#define USBFS_DOEPINT14_OUTTKNEPDIS                    (0x00000010UL)
#define USBFS_DOEPINT14_STSPHSERCVD_POS                (5U)
#define USBFS_DOEPINT14_STSPHSERCVD                    (0x00000020UL)
#define USBFS_DOEPINT14_BACK2BACKSETUP_POS             (6U)
#define USBFS_DOEPINT14_BACK2BACKSETUP                 (0x00000040UL)
#define USBFS_DOEPINT14_OUTPKTERR_POS                  (8U)
#define USBFS_DOEPINT14_OUTPKTERR                      (0x00000100UL)
#define USBFS_DOEPINT14_BNAINTR_POS                    (9U)
#define USBFS_DOEPINT14_BNAINTR                        (0x00000200UL)
#define USBFS_DOEPINT14_PKTDRPSTS_POS                  (11U)
#define USBFS_DOEPINT14_PKTDRPSTS                      (0x00000800UL)
#define USBFS_DOEPINT14_BBLEERR_POS                    (12U)
#define USBFS_DOEPINT14_BBLEERR                        (0x00001000UL)
#define USBFS_DOEPINT14_NAKINTRPT_POS                  (13U)
#define USBFS_DOEPINT14_NAKINTRPT                      (0x00002000UL)
#define USBFS_DOEPINT14_NYETINTRPT_POS                 (14U)
#define USBFS_DOEPINT14_NYETINTRPT                     (0x00004000UL)
#define USBFS_DOEPINT14_STUPPKTRCVD_POS                (15U)
#define USBFS_DOEPINT14_STUPPKTRCVD                    (0x00008000UL)

/*  Bit definition for USBFS_DOEPTSIZ14 register  */
#define USBFS_DOEPTSIZ14_XFERSIZE_POS                  (0U)
#define USBFS_DOEPTSIZ14_XFERSIZE                      (0x0007FFFFUL)
#define USBFS_DOEPTSIZ14_PKTCNT_POS                    (19U)
#define USBFS_DOEPTSIZ14_PKTCNT                        (0x1FF80000UL)
#define USBFS_DOEPTSIZ14_RXDPID_POS                    (29U)
#define USBFS_DOEPTSIZ14_RXDPID                        (0x60000000UL)
#define USBFS_DOEPTSIZ14_RXDPID_0                      (0x20000000UL)
#define USBFS_DOEPTSIZ14_RXDPID_1                      (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA14 register  */
#define USBFS_DOEPDMA14                                (0xFFFFFFFFUL)

/*  Bit definition for USBFS_DOEPCTL15 register  */
#define USBFS_DOEPCTL15_MPS_POS                        (0U)
#define USBFS_DOEPCTL15_MPS                            (0x000007FFUL)
#define USBFS_DOEPCTL15_USBACTEP_POS                   (15U)
#define USBFS_DOEPCTL15_USBACTEP                       (0x00008000UL)
#define USBFS_DOEPCTL15_DPID_POS                       (16U)
#define USBFS_DOEPCTL15_DPID                           (0x00010000UL)
#define USBFS_DOEPCTL15_NAKSTS_POS                     (17U)
#define USBFS_DOEPCTL15_NAKSTS                         (0x00020000UL)
#define USBFS_DOEPCTL15_EPTYPE_POS                     (18U)
#define USBFS_DOEPCTL15_EPTYPE                         (0x000C0000UL)
#define USBFS_DOEPCTL15_EPTYPE_0                       (0x00040000UL)
#define USBFS_DOEPCTL15_EPTYPE_1                       (0x00080000UL)
#define USBFS_DOEPCTL15_SNP_POS                        (20U)
#define USBFS_DOEPCTL15_SNP                            (0x00100000UL)
#define USBFS_DOEPCTL15_STALL_POS                      (21U)
#define USBFS_DOEPCTL15_STALL                          (0x00200000UL)
#define USBFS_DOEPCTL15_CNAK_POS                       (26U)
#define USBFS_DOEPCTL15_CNAK                           (0x04000000UL)
#define USBFS_DOEPCTL15_SNAK_POS                       (27U)
#define USBFS_DOEPCTL15_SNAK                           (0x08000000UL)
#define USBFS_DOEPCTL15_SETD0PID_POS                   (28U)
#define USBFS_DOEPCTL15_SETD0PID                       (0x10000000UL)
#define USBFS_DOEPCTL15_SETD1PID_POS                   (29U)
#define USBFS_DOEPCTL15_SETD1PID                       (0x20000000UL)
#define USBFS_DOEPCTL15_EPDIS_POS                      (30U)
#define USBFS_DOEPCTL15_EPDIS                          (0x40000000UL)
#define USBFS_DOEPCTL15_EPENA_POS                      (31U)
#define USBFS_DOEPCTL15_EPENA                          (0x80000000UL)

