levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBFS_DOEPINT15 register  */
#define USBFS_DOEPINT15_XFERCOMPL_POS                  (0U)
#define USBFS_DOEPINT15_XFERCOMPL                      (0x00000001UL)
#define USBFS_DOEPINT15_EPDISBLD_POS                   (1U)
#define USBFS_DOEPINT15_EPDISBLD                       (0x00000002UL)
#define USBFS_DOEPINT15_AHBERR_POS                     (2U)
#define USBFS_DOEPINT15_AHBERR                         (0x00000004UL)
#define USBFS_DOEPINT15_SETUP_POS                      (3U)
#define USBFS_DOEPINT15_SETUP                          (0x00000008UL)
#define USBFS_DOEPINT15_OUTTKNEPDIS_POS                (4U)
#define USBFS_DOEPINT15_OUTTKNEPDIS                    (0x00000010UL)
#define USBFS_DOEPINT15_STSPHSERCVD_POS                (5U)
#define USBFS_DOEPINT15_STSPHSERCVD                    (0x00000020UL)
#define USBFS_DOEPINT15_BACK2BACKSETUP_POS             (6U)
#define USBFS_DOEPINT15_BACK2BACKSETUP                 (0x00000040UL)
#define USBFS_DOEPINT15_OUTPKTERR_POS                  (8U)
#define USBFS_DOEPINT15_OUTPKTERR                      (0x00000100UL)
#define USBFS_DOEPINT15_BNAINTR_POS                    (9U)
#define USBFS_DOEPINT15_BNAINTR                        (0x00000200UL)
#define USBFS_DOEPINT15_PKTDRPSTS_POS                  (11U)
#define USBFS_DOEPINT15_PKTDRPSTS                      (0x00000800UL)
#define USBFS_DOEPINT15_BBLEERR_POS                    (12U)
#define USBFS_DOEPINT15_BBLEERR                        (0x00001000UL)
#define USBFS_DOEPINT15_NAKINTRPT_POS                  (13U)
#define USBFS_DOEPINT15_NAKINTRPT                      (0x00002000UL)
#define USBFS_DOEPINT15_NYETINTRPT_POS                 (14U)
#define USBFS_DOEPINT15_NYETINTRPT                     (0x00004000UL)
#define USBFS_DOEPINT15_STUPPKTRCVD_POS                (15U)
#define USBFS_DOEPINT15_STUPPKTRCVD                    (0x00008000UL)

/*  Bit definition for USBFS_DOEPTSIZ15 register  */
#define USBFS_DOEPTSIZ15_XFERSIZE_POS                  (0U)
#define USBFS_DOEPTSIZ15_XFERSIZE                      (0x0007FFFFUL)
#define USBFS_DOEPTSIZ15_PKTCNT_POS                    (19U)
#define USBFS_DOEPTSIZ15_PKTCNT                        (0x1FF80000UL)
#define USBFS_DOEPTSIZ15_RXDPID_POS                    (29U)
#define USBFS_DOEPTSIZ15_RXDPID                        (0x60000000UL)
#define USBFS_DOEPTSIZ15_RXDPID_0                      (0x20000000UL)
#define USBFS_DOEPTSIZ15_RXDPID_1                      (0x40000000UL)

/*  Bit definition for USBFS_DOEPDMA15 register  */
#define USBFS_DOEPDMA15                                (0xFFFFFFFFUL)

/*  Bit definition for USBFS_PCGCCTL register  */
#define USBFS_PCGCCTL_STOPPCLK_POS                     (0U)
#define USBFS_PCGCCTL_STOPPCLK                         (0x00000001UL)
#define USBFS_PCGCCTL_GATEHCLK_POS                     (1U)
#define USBFS_PCGCCTL_GATEHCLK                         (0x00000002UL)
#define USBFS_PCGCCTL_PWRCLMP_POS                      (2U)
#define USBFS_PCGCCTL_PWRCLMP                          (0x00000004UL)
#define USBFS_PCGCCTL_RSTPDWNMODULE_POS                (3U)
#define USBFS_PCGCCTL_RSTPDWNMODULE                    (0x00000008UL)
#define USBFS_PCGCCTL_ENBL_L1GATING_POS                (5U)
#define USBFS_PCGCCTL_ENBL_L1GATING                    (0x00000020UL)
#define USBFS_PCGCCTL_PHYSLEEP_POS                     (6U)
#define USBFS_PCGCCTL_PHYSLEEP                         (0x00000040UL)
#define USBFS_PCGCCTL_L1SUSPENDED_POS                  (7U)
#define USBFS_PCGCCTL_L1SUSPENDED                      (0x00000080UL)
#define USBFS_PCGCCTL_RESETAFTERSUSP_POS               (8U)
#define USBFS_PCGCCTL_RESETAFTERSUSP                   (0x00000100UL)

/*******************************************************************************
                Bit definition for Peripheral USBHS
*******************************************************************************/
/*  Bit definition for USBHS_GOTGCTL register  */
#define USBHS_GOTGCTL_SESREQSCS_POS                    (0U)
#define USBHS_GOTGCTL_SESREQSCS                        (0x00000001UL)
#define USBHS_GOTGCTL_SESREQ_POS                       (1U)
#define USBHS_GOTGCTL_SESREQ                           (0x00000002UL)
#define USBHS_GOTGCTL_VBVALIDOVEN_POS                  (2U)
#define USBHS_GOTGCTL_VBVALIDOVEN                      (0x00000004UL)
#define USBHS_GOTGCTL_VBVALIDOVVAL_POS                 (3U)
#define USBHS_GOTGCTL_VBVALIDOVVAL                     (0x00000008UL)
#define USBHS_GOTGCTL_AVALIDOVEN_POS                   (4U)
#define USBHS_GOTGCTL_AVALIDOVEN                       (0x00000010UL)
#define USBHS_GOTGCTL_AVALIDOVVAL_POS                  (5U)
#define USBHS_GOTGCTL_AVALIDOVVAL                      (0x00000020UL)
#define USBHS_GOTGCTL_BVALIDOVEN_POS                   (6U)
#define USBHS_GOTGCTL_BVALIDOVEN                       (0x00000040UL)
#define USBHS_GOTGCTL_BVALIDOVVAL_POS                  (7U)
#define USBHS_GOTGCTL_BVALIDOVVAL                      (0x00000080UL)
#define USBHS_GOTGCTL_HSTNEGSCS_POS                    (8U)
#define USBHS_GOTGCTL_HSTNEGSCS                        (0x00000100UL)
#define USBHS_GOTGCTL_HNPREQ_POS                       (9U)
#define USBHS_GOTGCTL_HNPREQ                           (0x00000200UL)
#define USBHS_GOTGCTL_HSTSETHNPEN_POS                  (10U)
#define USBHS_GOTGCTL_HSTSETHNPEN                      (0x00000400UL)
#define USBHS_GOTGCTL_DEVHNPEN_POS                     (11U)
#define USBHS_GOTGCTL_DEVHNPEN                         (0x00000800UL)
#define USBHS_GOTGCTL_EHEN_POS                         (12U)
#define USBHS_GOTGCTL_EHEN                             (0x00001000UL)
#define USBHS_GOTGCTL_DBNCEFLTRBYPASS_POS              (15U)
#define USBHS_GOTGCTL_DBNCEFLTRBYPASS                  (0x00008000UL)
#define USBHS_GOTGCTL_CONIDSTS_POS                     (16U)
#define USBHS_GOTGCTL_CONIDSTS                         (0x00010000UL)
#define USBHS_GOTGCTL_DBNCTIME_POS                     (17U)
#define USBHS_GOTGCTL_DBNCTIME                         (0x00020000UL)
#define USBHS_GOTGCTL_ASESVLD_POS                      (18U)
#define USBHS_GOTGCTL_ASESVLD                          (0x00040000UL)
#define USBHS_GOTGCTL_BSESVLD_POS                      (19U)
#define USBHS_GOTGCTL_BSESVLD                          (0x00080000UL)
#define USBHS_GOTGCTL_OTGVER_POS                       (20U)
#define USBHS_GOTGCTL_OTGVER                           (0x00100000UL)
#define USBHS_GOTGCTL_CURMOD_POS                       (21U)
#define USBHS_GOTGCTL_CURMOD                           (0x00200000UL)
#define USBHS_GOTGCTL_TESTMODE_CORR_EUSB2_POS          (31U)
#define USBHS_GOTGCTL_TESTMODE_CORR_EUSB2              (0x80000000UL)

