levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_GOTGINT register  */
#define USBHS_GOTGINT_SESENDDET_POS                    (2U)
#define USBHS_GOTGINT_SESENDDET                        (0x00000004UL)
#define USBHS_GOTGINT_SESREQSUCSTSCHNG_POS             (8U)
#define USBHS_GOTGINT_SESREQSUCSTSCHNG                 (0x00000100UL)
#define USBHS_GOTGINT_HSTNEGSUCSTSCHNG_POS             (9U)
#define USBHS_GOTGINT_HSTNEGSUCSTSCHNG                 (0x00000200UL)
#define USBHS_GOTGINT_HSTNEGDET_POS                    (17U)
#define USBHS_GOTGINT_HSTNEGDET                        (0x00020000UL)
#define USBHS_GOTGINT_ADEVTOUTCHG_POS                  (18U)
#define USBHS_GOTGINT_ADEVTOUTCHG                      (0x00040000UL)
#define USBHS_GOTGINT_DBNCEDONE_POS                    (19U)
#define USBHS_GOTGINT_DBNCEDONE                        (0x00080000UL)

/*  Bit definition for USBHS_GAHBCFG register  */
#define USBHS_GAHBCFG_GLBLINTRMSK_POS                  (0U)
#define USBHS_GAHBCFG_GLBLINTRMSK                      (0x00000001UL)
#define USBHS_GAHBCFG_HBSTLEN_POS                      (1U)
#define USBHS_GAHBCFG_HBSTLEN                          (0x0000001EUL)
#define USBHS_GAHBCFG_HBSTLEN_0                        (0x00000002UL)
#define USBHS_GAHBCFG_HBSTLEN_1                        (0x00000004UL)
#define USBHS_GAHBCFG_HBSTLEN_2                        (0x00000008UL)
#define USBHS_GAHBCFG_HBSTLEN_3                        (0x00000010UL)
#define USBHS_GAHBCFG_DMAEN_POS                        (5U)
#define USBHS_GAHBCFG_DMAEN                            (0x00000020UL)
#define USBHS_GAHBCFG_NPTXFEMPLVL_POS                  (7U)
#define USBHS_GAHBCFG_NPTXFEMPLVL                      (0x00000080UL)
#define USBHS_GAHBCFG_PTXFEMPLVL_POS                   (8U)
#define USBHS_GAHBCFG_PTXFEMPLVL                       (0x00000100UL)
#define USBHS_GAHBCFG_REMMEMSUPP_POS                   (21U)
#define USBHS_GAHBCFG_REMMEMSUPP                       (0x00200000UL)
#define USBHS_GAHBCFG_NOTIALLDMAWRIT_POS               (22U)
#define USBHS_GAHBCFG_NOTIALLDMAWRIT                   (0x00400000UL)
#define USBHS_GAHBCFG_AHBSINGLE_POS                    (23U)
#define USBHS_GAHBCFG_AHBSINGLE                        (0x00800000UL)

/*  Bit definition for USBHS_GUSBCFG register  */
#define USBHS_GUSBCFG_TOUTCAL_POS                      (0U)
#define USBHS_GUSBCFG_TOUTCAL                          (0x00000007UL)
#define USBHS_GUSBCFG_TOUTCAL_0                        (0x00000001UL)
#define USBHS_GUSBCFG_TOUTCAL_1                        (0x00000002UL)
#define USBHS_GUSBCFG_TOUTCAL_2                        (0x00000004UL)
#define USBHS_GUSBCFG_PHYIF_POS                        (3U)
#define USBHS_GUSBCFG_PHYIF                            (0x00000008UL)
#define USBHS_GUSBCFG_ULPI_UTMI_SEL_POS                (4U)
#define USBHS_GUSBCFG_ULPI_UTMI_SEL                    (0x00000010UL)
#define USBHS_GUSBCFG_FSINTF_POS                       (5U)
#define USBHS_GUSBCFG_FSINTF                           (0x00000020UL)
#define USBHS_GUSBCFG_PHYSEL_POS                       (6U)
#define USBHS_GUSBCFG_PHYSEL                           (0x00000040UL)
#define USBHS_GUSBCFG_DDRSEL_POS                       (7U)
#define USBHS_GUSBCFG_DDRSEL                           (0x00000080UL)
#define USBHS_GUSBCFG_SRPCAP_POS                       (8U)
#define USBHS_GUSBCFG_SRPCAP                           (0x00000100UL)
#define USBHS_GUSBCFG_HNPCAP_POS                       (9U)
#define USBHS_GUSBCFG_HNPCAP                           (0x00000200UL)
#define USBHS_GUSBCFG_USBTRDTIM_POS                    (10U)
#define USBHS_GUSBCFG_USBTRDTIM                        (0x00003C00UL)
#define USBHS_GUSBCFG_USBTRDTIM_0                      (0x00000400UL)
#define USBHS_GUSBCFG_USBTRDTIM_1                      (0x00000800UL)
#define USBHS_GUSBCFG_USBTRDTIM_2                      (0x00001000UL)
#define USBHS_GUSBCFG_USBTRDTIM_3                      (0x00002000UL)
#define USBHS_GUSBCFG_ULPIFSLS_POS                     (17U)
#define USBHS_GUSBCFG_ULPIFSLS                         (0x00020000UL)
#define USBHS_GUSBCFG_ULPIAUTORES_POS                  (18U)
#define USBHS_GUSBCFG_ULPIAUTORES                      (0x00040000UL)
#define USBHS_GUSBCFG_ULPICLKSUSM_POS                  (19U)
#define USBHS_GUSBCFG_ULPICLKSUSM                      (0x00080000UL)
#define USBHS_GUSBCFG_ULPIEXTVBUSDRV_POS               (20U)
#define USBHS_GUSBCFG_ULPIEXTVBUSDRV                   (0x00100000UL)
#define USBHS_GUSBCFG_ULPIEXTVBUSINDICATOR_POS         (21U)
#define USBHS_GUSBCFG_ULPIEXTVBUSINDICATOR             (0x00200000UL)
#define USBHS_GUSBCFG_TERMSELDLPULSE_POS               (22U)
#define USBHS_GUSBCFG_TERMSELDLPULSE                   (0x00400000UL)
#define USBHS_GUSBCFG_COMPLEMENT_POS                   (23U)
#define USBHS_GUSBCFG_COMPLEMENT                       (0x00800000UL)
#define USBHS_GUSBCFG_INDICATOR_POS                    (24U)
#define USBHS_GUSBCFG_INDICATOR                        (0x01000000UL)
#define USBHS_GUSBCFG_ULPI_POS                         (25U)
#define USBHS_GUSBCFG_ULPI                             (0x02000000UL)
#define USBHS_GUSBCFG_IC_USBCAP_POS                    (26U)
#define USBHS_GUSBCFG_IC_USBCAP                        (0x04000000UL)
#define USBHS_GUSBCFG_TXENDDELAY_POS                   (28U)
#define USBHS_GUSBCFG_TXENDDELAY                       (0x10000000UL)
#define USBHS_GUSBCFG_FORCEHSTMODE_POS                 (29U)
#define USBHS_GUSBCFG_FORCEHSTMODE                     (0x20000000UL)
#define USBHS_GUSBCFG_FORCEDEVMODE_POS                 (30U)
#define USBHS_GUSBCFG_FORCEDEVMODE                     (0x40000000UL)
#define USBHS_GUSBCFG_CORRUPTTXPKT_POS                 (31U)
#define USBHS_GUSBCFG_CORRUPTTXPKT                     (0x80000000UL)

/*  Bit definition for USBHS_GRSTCTL register  */
#define USBHS_GRSTCTL_CSFTRST_POS                      (0U)
#define USBHS_GRSTCTL_CSFTRST                          (0x00000001UL)
#define USBHS_GRSTCTL_PIUFSSFTRST_POS                  (1U)
#define USBHS_GRSTCTL_PIUFSSFTRST                      (0x00000002UL)
#define USBHS_GRSTCTL_FRMCNTRRST_POS                   (2U)
#define USBHS_GRSTCTL_FRMCNTRRST                       (0x00000004UL)
#define USBHS_GRSTCTL_RXFFLSH_POS                      (4U)
#define USBHS_GRSTCTL_RXFFLSH                          (0x00000010UL)
#define USBHS_GRSTCTL_TXFFLSH_POS                      (5U)
#define USBHS_GRSTCTL_TXFFLSH                          (0x00000020UL)
#define USBHS_GRSTCTL_TXFNUM_POS                       (6U)
#define USBHS_GRSTCTL_TXFNUM                           (0x000007C0UL)
#define USBHS_GRSTCTL_TXFNUM_0                         (0x00000040UL)
#define USBHS_GRSTCTL_TXFNUM_1                         (0x00000080UL)
#define USBHS_GRSTCTL_TXFNUM_2                         (0x00000100UL)
#define USBHS_GRSTCTL_TXFNUM_3                         (0x00000200UL)
#define USBHS_GRSTCTL_TXFNUM_4                         (0x00000400UL)
#define USBHS_GRSTCTL_DMAREQ_POS                       (30U)
#define USBHS_GRSTCTL_DMAREQ                           (0x40000000UL)
#define USBHS_GRSTCTL_AHBIDLE_POS                      (31U)
#define USBHS_GRSTCTL_AHBIDLE                          (0x80000000UL)

/*  Bit definition for USBHS_GINTSTS register  */
#define USBHS_GINTSTS_CURMOD_POS                       (0U)
#define USBHS_GINTSTS_CURMOD                           (0x00000001UL)
#define USBHS_GINTSTS_MODEMIS_POS                      (1U)
#define USBHS_GINTSTS_MODEMIS                          (0x00000002UL)
#define USBHS_GINTSTS_OTGINT_POS                       (2U)
#define USBHS_GINTSTS_OTGINT                           (0x00000004UL)
#define USBHS_GINTSTS_SOF_POS                          (3U)
#define USBHS_GINTSTS_SOF                              (0x00000008UL)
#define USBHS_GINTSTS_RXFLVL_POS                       (4U)
#define USBHS_GINTSTS_RXFLVL                           (0x00000010UL)
#define USBHS_GINTSTS_NPTXFEMP_POS                     (5U)
#define USBHS_GINTSTS_NPTXFEMP                         (0x00000020UL)
#define USBHS_GINTSTS_GINNAKEFF_POS                    (6U)
#define USBHS_GINTSTS_GINNAKEFF                        (0x00000040UL)
#define USBHS_GINTSTS_GOUTNAKEFF_POS                   (7U)
#define USBHS_GINTSTS_GOUTNAKEFF                       (0x00000080UL)
#define USBHS_GINTSTS_ERLYSUSP_POS                     (10U)
#define USBHS_GINTSTS_ERLYSUSP                         (0x00000400UL)
#define USBHS_GINTSTS_USBSUSP_POS                      (11U)
#define USBHS_GINTSTS_USBSUSP                          (0x00000800UL)
#define USBHS_GINTSTS_USBRST_POS                       (12U)
#define USBHS_GINTSTS_USBRST                           (0x00001000UL)
#define USBHS_GINTSTS_ENUMDONE_POS                     (13U)
#define USBHS_GINTSTS_ENUMDONE                         (0x00002000UL)
#define USBHS_GINTSTS_ISOOUTDROP_POS                   (14U)
#define USBHS_GINTSTS_ISOOUTDROP                       (0x00004000UL)
#define USBHS_GINTSTS_EOPF_POS                         (15U)
#define USBHS_GINTSTS_EOPF                             (0x00008000UL)
#define USBHS_GINTSTS_EPMIS_POS                        (17U)
#define USBHS_GINTSTS_EPMIS                            (0x00020000UL)
#define USBHS_GINTSTS_IEPINT_POS                       (18U)
#define USBHS_GINTSTS_IEPINT                           (0x00040000UL)
#define USBHS_GINTSTS_OEPINT_POS                       (19U)
#define USBHS_GINTSTS_OEPINT                           (0x00080000UL)
#define USBHS_GINTSTS_INCOMPISOIN_POS                  (20U)
#define USBHS_GINTSTS_INCOMPISOIN                      (0x00100000UL)
#define USBHS_GINTSTS_INCOMPLP_POS                     (21U)
#define USBHS_GINTSTS_INCOMPLP                         (0x00200000UL)
#define USBHS_GINTSTS_FETSUSP_POS                      (22U)
#define USBHS_GINTSTS_FETSUSP                          (0x00400000UL)
#define USBHS_GINTSTS_RESETDET_POS                     (23U)
#define USBHS_GINTSTS_RESETDET                         (0x00800000UL)
#define USBHS_GINTSTS_PRTINT_POS                       (24U)
#define USBHS_GINTSTS_PRTINT                           (0x01000000UL)
#define USBHS_GINTSTS_HCHINT_POS                       (25U)
#define USBHS_GINTSTS_HCHINT                           (0x02000000UL)
#define USBHS_GINTSTS_PTXFEMP_POS                      (26U)
#define USBHS_GINTSTS_PTXFEMP                          (0x04000000UL)
#define USBHS_GINTSTS_LPM_INT_POS                      (27U)
#define USBHS_GINTSTS_LPM_INT                          (0x08000000UL)
#define USBHS_GINTSTS_CONIDSTSCHNG_POS                 (28U)
#define USBHS_GINTSTS_CONIDSTSCHNG                     (0x10000000UL)
#define USBHS_GINTSTS_DISCONNINT_POS                   (29U)
#define USBHS_GINTSTS_DISCONNINT                       (0x20000000UL)
#define USBHS_GINTSTS_SESSREQINT_POS                   (30U)
#define USBHS_GINTSTS_SESSREQINT                       (0x40000000UL)
#define USBHS_GINTSTS_WKUPINT_POS                      (31U)
#define USBHS_GINTSTS_WKUPINT                          (0x80000000UL)

/*  Bit definition for USBHS_GINTMSK register  */
#define USBHS_GINTMSK_MODEMISMSK_POS                   (1U)
#define USBHS_GINTMSK_MODEMISMSK                       (0x00000002UL)
#define USBHS_GINTMSK_OTGINTMSK_POS                    (2U)
#define USBHS_GINTMSK_OTGINTMSK                        (0x00000004UL)
#define USBHS_GINTMSK_SOFMSK_POS                       (3U)
#define USBHS_GINTMSK_SOFMSK                           (0x00000008UL)
#define USBHS_GINTMSK_RXFLVLMSK_POS                    (4U)
#define USBHS_GINTMSK_RXFLVLMSK                        (0x00000010UL)
#define USBHS_GINTMSK_NPTXFEMPMSK_POS                  (5U)
#define USBHS_GINTMSK_NPTXFEMPMSK                      (0x00000020UL)
#define USBHS_GINTMSK_GINNAKEFFMSK_POS                 (6U)
#define USBHS_GINTMSK_GINNAKEFFMSK                     (0x00000040UL)
#define USBHS_GINTMSK_GOUTNAKEFFMSK_POS                (7U)
#define USBHS_GINTMSK_GOUTNAKEFFMSK                    (0x00000080UL)
#define USBHS_GINTMSK_ERLYSUSPMSK_POS                  (10U)
#define USBHS_GINTMSK_ERLYSUSPMSK                      (0x00000400UL)
#define USBHS_GINTMSK_USBSUSPMSK_POS                   (11U)
#define USBHS_GINTMSK_USBSUSPMSK                       (0x00000800UL)
#define USBHS_GINTMSK_USBRSTMSK_POS                    (12U)
#define USBHS_GINTMSK_USBRSTMSK                        (0x00001000UL)
#define USBHS_GINTMSK_ENUMDONEMSK_POS                  (13U)
#define USBHS_GINTMSK_ENUMDONEMSK                      (0x00002000UL)
#define USBHS_GINTMSK_ISOOUTDROPMSK_POS                (14U)
#define USBHS_GINTMSK_ISOOUTDROPMSK                    (0x00004000UL)
#define USBHS_GINTMSK_EOPFMSK_POS                      (15U)
#define USBHS_GINTMSK_EOPFMSK                          (0x00008000UL)
#define USBHS_GINTMSK_EPMISMSK_POS                     (17U)
#define USBHS_GINTMSK_EPMISMSK                         (0x00020000UL)
#define USBHS_GINTMSK_IEPINTMSK_POS                    (18U)
#define USBHS_GINTMSK_IEPINTMSK                        (0x00040000UL)
#define USBHS_GINTMSK_OEPINTMSK_POS                    (19U)
#define USBHS_GINTMSK_OEPINTMSK                        (0x00080000UL)
#define USBHS_GINTMSK_INCOMPLPMSK_POS                  (21U)
#define USBHS_GINTMSK_INCOMPLPMSK                      (0x00200000UL)
#define USBHS_GINTMSK_FETSUSPMSK_POS                   (22U)
#define USBHS_GINTMSK_FETSUSPMSK                       (0x00400000UL)
#define USBHS_GINTMSK_RESETDETMSK_POS                  (23U)
#define USBHS_GINTMSK_RESETDETMSK                      (0x00800000UL)
#define USBHS_GINTMSK_PRTINTMSK_POS                    (24U)
#define USBHS_GINTMSK_PRTINTMSK                        (0x01000000UL)
#define USBHS_GINTMSK_HCHINTMSK_POS                    (25U)
#define USBHS_GINTMSK_HCHINTMSK                        (0x02000000UL)
#define USBHS_GINTMSK_PTXFEMPMSK_POS                   (26U)
#define USBHS_GINTMSK_PTXFEMPMSK                       (0x04000000UL)
#define USBHS_GINTMSK_LPM_INTMSK_POS                   (27U)
#define USBHS_GINTMSK_LPM_INTMSK                       (0x08000000UL)
#define USBHS_GINTMSK_CONIDSTSCHNGMSK_POS              (28U)
#define USBHS_GINTMSK_CONIDSTSCHNGMSK                  (0x10000000UL)
#define USBHS_GINTMSK_DISCONNINTMSK_POS                (29U)
#define USBHS_GINTMSK_DISCONNINTMSK                    (0x20000000UL)
#define USBHS_GINTMSK_SESSREQINTMSK_POS                (30U)
#define USBHS_GINTMSK_SESSREQINTMSK                    (0x40000000UL)
#define USBHS_GINTMSK_WKUPINTMSK_POS                   (31U)
#define USBHS_GINTMSK_WKUPINTMSK                       (0x80000000UL)

/*  Bit definition for USBHS_GRXSTSR register  */
#define USBHS_GRXSTSR_CHNUM_POS                        (0U)
#define USBHS_GRXSTSR_CHNUM                            (0x0000000FUL)
#define USBHS_GRXSTSR_CHNUM_0                          (0x00000001UL)
#define USBHS_GRXSTSR_CHNUM_1                          (0x00000002UL)
#define USBHS_GRXSTSR_CHNUM_2                          (0x00000004UL)
#define USBHS_GRXSTSR_CHNUM_3                          (0x00000008UL)
#define USBHS_GRXSTSR_BCNT_POS                         (4U)
#define USBHS_GRXSTSR_BCNT                             (0x00007FF0UL)
#define USBHS_GRXSTSR_BCNT_0                           (0x00000010UL)
#define USBHS_GRXSTSR_BCNT_1                           (0x00000020UL)
#define USBHS_GRXSTSR_BCNT_2                           (0x00000040UL)
#define USBHS_GRXSTSR_BCNT_3                           (0x00000080UL)
#define USBHS_GRXSTSR_BCNT_4                           (0x00000100UL)
#define USBHS_GRXSTSR_BCNT_5                           (0x00000200UL)
#define USBHS_GRXSTSR_BCNT_6                           (0x00000400UL)
#define USBHS_GRXSTSR_BCNT_7                           (0x00000800UL)
#define USBHS_GRXSTSR_BCNT_8                           (0x00001000UL)
#define USBHS_GRXSTSR_BCNT_9                           (0x00002000UL)
#define USBHS_GRXSTSR_BCNT_10                          (0x00004000UL)
#define USBHS_GRXSTSR_DPID_POS                         (15U)
#define USBHS_GRXSTSR_DPID                             (0x00018000UL)
#define USBHS_GRXSTSR_DPID_0                           (0x00008000UL)
#define USBHS_GRXSTSR_DPID_1                           (0x00010000UL)
#define USBHS_GRXSTSR_PKTSTS_POS                       (17U)
#define USBHS_GRXSTSR_PKTSTS                           (0x001E0000UL)
#define USBHS_GRXSTSR_PKTSTS_0                         (0x00020000UL)
#define USBHS_GRXSTSR_PKTSTS_1                         (0x00040000UL)
#define USBHS_GRXSTSR_PKTSTS_2                         (0x00080000UL)
#define USBHS_GRXSTSR_PKTSTS_3                         (0x00100000UL)
#define USBHS_GRXSTSR_FN_POS                           (21U)
#define USBHS_GRXSTSR_FN                               (0x01E00000UL)
#define USBHS_GRXSTSR_FN_0                             (0x00200000UL)
#define USBHS_GRXSTSR_FN_1                             (0x00400000UL)
#define USBHS_GRXSTSR_FN_2                             (0x00800000UL)
#define USBHS_GRXSTSR_FN_3                             (0x01000000UL)

/*  Bit definition for USBHS_GRXSTSP register  */
#define USBHS_GRXSTSP_CHNUM_POS                        (0U)
#define USBHS_GRXSTSP_CHNUM                            (0x0000000FUL)
#define USBHS_GRXSTSP_CHNUM_0                          (0x00000001UL)
#define USBHS_GRXSTSP_CHNUM_1                          (0x00000002UL)
#define USBHS_GRXSTSP_CHNUM_2                          (0x00000004UL)
#define USBHS_GRXSTSP_CHNUM_3                          (0x00000008UL)
#define USBHS_GRXSTSP_BCNT_POS                         (4U)
#define USBHS_GRXSTSP_BCNT                             (0x00007FF0UL)
#define USBHS_GRXSTSP_BCNT_0                           (0x00000010UL)
#define USBHS_GRXSTSP_BCNT_1                           (0x00000020UL)
#define USBHS_GRXSTSP_BCNT_2                           (0x00000040UL)
#define USBHS_GRXSTSP_BCNT_3                           (0x00000080UL)
#define USBHS_GRXSTSP_BCNT_4                           (0x00000100UL)
#define USBHS_GRXSTSP_BCNT_5                           (0x00000200UL)
#define USBHS_GRXSTSP_BCNT_6                           (0x00000400UL)
#define USBHS_GRXSTSP_BCNT_7                           (0x00000800UL)
#define USBHS_GRXSTSP_BCNT_8                           (0x00001000UL)
#define USBHS_GRXSTSP_BCNT_9                           (0x00002000UL)
#define USBHS_GRXSTSP_BCNT_10                          (0x00004000UL)
#define USBHS_GRXSTSP_DPID_POS                         (15U)
#define USBHS_GRXSTSP_DPID                             (0x00018000UL)
#define USBHS_GRXSTSP_DPID_0                           (0x00008000UL)
#define USBHS_GRXSTSP_DPID_1                           (0x00010000UL)
#define USBHS_GRXSTSP_PKTSTS_POS                       (17U)
#define USBHS_GRXSTSP_PKTSTS                           (0x001E0000UL)
#define USBHS_GRXSTSP_PKTSTS_0                         (0x00020000UL)
#define USBHS_GRXSTSP_PKTSTS_1                         (0x00040000UL)
#define USBHS_GRXSTSP_PKTSTS_2                         (0x00080000UL)
#define USBHS_GRXSTSP_PKTSTS_3                         (0x00100000UL)
#define USBHS_GRXSTSP_FN_POS                           (21U)
#define USBHS_GRXSTSP_FN                               (0x01E00000UL)
#define USBHS_GRXSTSP_FN_0                             (0x00200000UL)
#define USBHS_GRXSTSP_FN_1                             (0x00400000UL)
#define USBHS_GRXSTSP_FN_2                             (0x00800000UL)
#define USBHS_GRXSTSP_FN_3                             (0x01000000UL)

