levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_GRXFSIZ register  */
#define USBHS_GRXFSIZ_RXFDEP                           (0x00000FFFUL)

/*  Bit definition for USBHS_GNPTXFSIZ register  */
#define USBHS_GNPTXFSIZ_NPTXFSTADDR_POS                (0U)
#define USBHS_GNPTXFSIZ_NPTXFSTADDR                    (0x00000FFFUL)
#define USBHS_GNPTXFSIZ_NPTXFSTADDR_0                  (0x00000001UL)
#define USBHS_GNPTXFSIZ_NPTXFSTADDR_1                  (0x00000002UL)
#define USBHS_GNPTXFSIZ_NPTXFSTADDR_2                  (0x00000004UL)
#define USBHS_GNPTXFSIZ_NPTXFSTADDR_3                  (0x00000008UL)
#define USBHS_GNPTXFSIZ_NPTXFSTADDR_4                  (0x00000010UL)
#define USBHS_GNPTXFSIZ_NPTXFSTADDR_5                  (0x00000020UL)
#define USBHS_GNPTXFSIZ_NPTXFSTADDR_6                  (0x00000040UL)
#define USBHS_GNPTXFSIZ_NPTXFSTADDR_7                  (0x00000080UL)
#define USBHS_GNPTXFSIZ_NPTXFSTADDR_8                  (0x00000100UL)
#define USBHS_GNPTXFSIZ_NPTXFSTADDR_9                  (0x00000200UL)
#define USBHS_GNPTXFSIZ_NPTXFSTADDR_10                 (0x00000400UL)
#define USBHS_GNPTXFSIZ_NPTXFSTADDR_11                 (0x00000800UL)
#define USBHS_GNPTXFSIZ_NPTXFDEP_POS                   (16U)
#define USBHS_GNPTXFSIZ_NPTXFDEP                       (0x0FFF0000UL)
#define USBHS_GNPTXFSIZ_NPTXFDEP_0                     (0x00010000UL)
#define USBHS_GNPTXFSIZ_NPTXFDEP_1                     (0x00020000UL)
#define USBHS_GNPTXFSIZ_NPTXFDEP_2                     (0x00040000UL)
#define USBHS_GNPTXFSIZ_NPTXFDEP_3                     (0x00080000UL)
#define USBHS_GNPTXFSIZ_NPTXFDEP_4                     (0x00100000UL)
#define USBHS_GNPTXFSIZ_NPTXFDEP_5                     (0x00200000UL)
#define USBHS_GNPTXFSIZ_NPTXFDEP_6                     (0x00400000UL)
#define USBHS_GNPTXFSIZ_NPTXFDEP_7                     (0x00800000UL)
#define USBHS_GNPTXFSIZ_NPTXFDEP_8                     (0x01000000UL)
#define USBHS_GNPTXFSIZ_NPTXFDEP_9                     (0x02000000UL)
#define USBHS_GNPTXFSIZ_NPTXFDEP_10                    (0x04000000UL)
#define USBHS_GNPTXFSIZ_NPTXFDEP_11                    (0x08000000UL)

/*  Bit definition for USBHS_GNPTXSTS register  */
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_POS               (0U)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL                   (0x0000FFFFUL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_0                 (0x00000001UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_1                 (0x00000002UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_2                 (0x00000004UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_3                 (0x00000008UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_4                 (0x00000010UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_5                 (0x00000020UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_6                 (0x00000040UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_7                 (0x00000080UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_8                 (0x00000100UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_9                 (0x00000200UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_10                (0x00000400UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_11                (0x00000800UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_12                (0x00001000UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_13                (0x00002000UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_14                (0x00004000UL)
#define USBHS_GNPTXSTS_NPTXFSPCAVAIL_15                (0x00008000UL)
#define USBHS_GNPTXSTS_NPTXQSPCAVAIL_POS               (16U)
#define USBHS_GNPTXSTS_NPTXQSPCAVAIL                   (0x00FF0000UL)
#define USBHS_GNPTXSTS_NPTXQSPCAVAIL_0                 (0x00010000UL)
#define USBHS_GNPTXSTS_NPTXQSPCAVAIL_1                 (0x00020000UL)
#define USBHS_GNPTXSTS_NPTXQSPCAVAIL_2                 (0x00040000UL)
#define USBHS_GNPTXSTS_NPTXQSPCAVAIL_3                 (0x00080000UL)
#define USBHS_GNPTXSTS_NPTXQSPCAVAIL_4                 (0x00100000UL)
#define USBHS_GNPTXSTS_NPTXQSPCAVAIL_5                 (0x00200000UL)
#define USBHS_GNPTXSTS_NPTXQSPCAVAIL_6                 (0x00400000UL)
#define USBHS_GNPTXSTS_NPTXQSPCAVAIL_7                 (0x00800000UL)
#define USBHS_GNPTXSTS_NPTXQTOP_POS                    (24U)
#define USBHS_GNPTXSTS_NPTXQTOP                        (0x7F000000UL)
#define USBHS_GNPTXSTS_NPTXQTOP_0                      (0x01000000UL)
#define USBHS_GNPTXSTS_NPTXQTOP_1                      (0x02000000UL)
#define USBHS_GNPTXSTS_NPTXQTOP_2                      (0x04000000UL)
#define USBHS_GNPTXSTS_NPTXQTOP_3                      (0x08000000UL)
#define USBHS_GNPTXSTS_NPTXQTOP_4                      (0x10000000UL)
#define USBHS_GNPTXSTS_NPTXQTOP_5                      (0x20000000UL)
#define USBHS_GNPTXSTS_NPTXQTOP_6                      (0x40000000UL)

/*  Bit definition for USBHS_GPVNDCTL register  */
#define USBHS_GPVNDCTL_REGDATA_POS                     (0U)
#define USBHS_GPVNDCTL_REGDATA                         (0x000000FFUL)
#define USBHS_GPVNDCTL_REGDATA_0                       (0x00000001UL)
#define USBHS_GPVNDCTL_REGDATA_1                       (0x00000002UL)
#define USBHS_GPVNDCTL_REGDATA_2                       (0x00000004UL)
#define USBHS_GPVNDCTL_REGDATA_3                       (0x00000008UL)
#define USBHS_GPVNDCTL_REGDATA_4                       (0x00000010UL)
#define USBHS_GPVNDCTL_REGDATA_5                       (0x00000020UL)
#define USBHS_GPVNDCTL_REGDATA_6                       (0x00000040UL)
#define USBHS_GPVNDCTL_REGDATA_7                       (0x00000080UL)
#define USBHS_GPVNDCTL_VCTRL_POS                       (8U)
#define USBHS_GPVNDCTL_VCTRL                           (0x0000FF00UL)
#define USBHS_GPVNDCTL_VCTRL_0                         (0x00000100UL)
#define USBHS_GPVNDCTL_VCTRL_1                         (0x00000200UL)
#define USBHS_GPVNDCTL_VCTRL_2                         (0x00000400UL)
#define USBHS_GPVNDCTL_VCTRL_3                         (0x00000800UL)
#define USBHS_GPVNDCTL_VCTRL_4                         (0x00001000UL)
#define USBHS_GPVNDCTL_VCTRL_5                         (0x00002000UL)
#define USBHS_GPVNDCTL_VCTRL_6                         (0x00004000UL)
#define USBHS_GPVNDCTL_VCTRL_7                         (0x00008000UL)
#define USBHS_GPVNDCTL_REGADDR_POS                     (16U)
#define USBHS_GPVNDCTL_REGADDR                         (0x003F0000UL)
#define USBHS_GPVNDCTL_REGADDR_0                       (0x00010000UL)
#define USBHS_GPVNDCTL_REGADDR_1                       (0x00020000UL)
#define USBHS_GPVNDCTL_REGADDR_2                       (0x00040000UL)
#define USBHS_GPVNDCTL_REGADDR_3                       (0x00080000UL)
#define USBHS_GPVNDCTL_REGADDR_4                       (0x00100000UL)
#define USBHS_GPVNDCTL_REGADDR_5                       (0x00200000UL)
#define USBHS_GPVNDCTL_REGWR_POS                       (22U)
#define USBHS_GPVNDCTL_REGWR                           (0x00400000UL)
#define USBHS_GPVNDCTL_NEWREGREQ_POS                   (25U)
#define USBHS_GPVNDCTL_NEWREGREQ                       (0x02000000UL)
#define USBHS_GPVNDCTL_VSTSBSY_POS                     (26U)
#define USBHS_GPVNDCTL_VSTSBSY                         (0x04000000UL)
#define USBHS_GPVNDCTL_VSTSDONE_POS                    (27U)
#define USBHS_GPVNDCTL_VSTSDONE                        (0x08000000UL)

/*  Bit definition for USBHS_GUID register  */
#define USBHS_GUID                                     (0xFFFFFFFFUL)

/*  Bit definition for USBHS_GLPMCFG register  */
#define USBHS_GLPMCFG_LPMCAP_POS                       (0U)
#define USBHS_GLPMCFG_LPMCAP                           (0x00000001UL)
#define USBHS_GLPMCFG_APPL1RES_POS                     (1U)
#define USBHS_GLPMCFG_APPL1RES                         (0x00000002UL)
#define USBHS_GLPMCFG_HIRD_POS                         (2U)
#define USBHS_GLPMCFG_HIRD                             (0x0000003CUL)
#define USBHS_GLPMCFG_HIRD_0                           (0x00000004UL)
#define USBHS_GLPMCFG_HIRD_1                           (0x00000008UL)
#define USBHS_GLPMCFG_HIRD_2                           (0x00000010UL)
#define USBHS_GLPMCFG_HIRD_3                           (0x00000020UL)
#define USBHS_GLPMCFG_BREMOTEWAKE_POS                  (6U)
#define USBHS_GLPMCFG_BREMOTEWAKE                      (0x00000040UL)
#define USBHS_GLPMCFG_ENBLSLPM_POS                     (7U)
#define USBHS_GLPMCFG_ENBLSLPM                         (0x00000080UL)
#define USBHS_GLPMCFG_HIRD_THRES_POS                   (8U)
#define USBHS_GLPMCFG_HIRD_THRES                       (0x00001F00UL)
#define USBHS_GLPMCFG_HIRD_THRES_0                     (0x00000100UL)
#define USBHS_GLPMCFG_HIRD_THRES_1                     (0x00000200UL)
#define USBHS_GLPMCFG_HIRD_THRES_2                     (0x00000400UL)
#define USBHS_GLPMCFG_HIRD_THRES_3                     (0x00000800UL)
#define USBHS_GLPMCFG_HIRD_THRES_4                     (0x00001000UL)
#define USBHS_GLPMCFG_COREL1RES_POS                    (13U)
#define USBHS_GLPMCFG_COREL1RES                        (0x00006000UL)
#define USBHS_GLPMCFG_COREL1RES_0                      (0x00002000UL)
#define USBHS_GLPMCFG_COREL1RES_1                      (0x00004000UL)
#define USBHS_GLPMCFG_SLPSTS_POS                       (15U)
#define USBHS_GLPMCFG_SLPSTS                           (0x00008000UL)
#define USBHS_GLPMCFG_L1RESUMEOK_POS                   (16U)
#define USBHS_GLPMCFG_L1RESUMEOK                       (0x00010000UL)
#define USBHS_GLPMCFG_LPM_CHNL_INDX_POS                (17U)
#define USBHS_GLPMCFG_LPM_CHNL_INDX                    (0x001E0000UL)
#define USBHS_GLPMCFG_LPM_CHNL_INDX_0                  (0x00020000UL)
#define USBHS_GLPMCFG_LPM_CHNL_INDX_1                  (0x00040000UL)
#define USBHS_GLPMCFG_LPM_CHNL_INDX_2                  (0x00080000UL)
#define USBHS_GLPMCFG_LPM_CHNL_INDX_3                  (0x00100000UL)
#define USBHS_GLPMCFG_LPM_RETRY_CNT_POS                (21U)
#define USBHS_GLPMCFG_LPM_RETRY_CNT                    (0x00E00000UL)
#define USBHS_GLPMCFG_LPM_RETRY_CNT_0                  (0x00200000UL)
#define USBHS_GLPMCFG_LPM_RETRY_CNT_1                  (0x00400000UL)
#define USBHS_GLPMCFG_LPM_RETRY_CNT_2                  (0x00800000UL)
#define USBHS_GLPMCFG_SNDLPM_POS                       (24U)
#define USBHS_GLPMCFG_SNDLPM                           (0x01000000UL)
#define USBHS_GLPMCFG_LPM_RETRYCNT_STS_POS             (25U)
#define USBHS_GLPMCFG_LPM_RETRYCNT_STS                 (0x0E000000UL)
#define USBHS_GLPMCFG_LPM_RETRYCNT_STS_0               (0x02000000UL)
#define USBHS_GLPMCFG_LPM_RETRYCNT_STS_1               (0x04000000UL)
#define USBHS_GLPMCFG_LPM_RETRYCNT_STS_2               (0x08000000UL)
#define USBHS_GLPMCFG_LPM_ENBESL_POS                   (28U)
#define USBHS_GLPMCFG_LPM_ENBESL                       (0x10000000UL)
#define USBHS_GLPMCFG_LPM_RESTORESLPSTS_POS            (29U)
#define USBHS_GLPMCFG_LPM_RESTORESLPSTS                (0x20000000UL)

/*  Bit definition for USBHS_GDFIFOCFG register  */
#define USBHS_GDFIFOCFG_GDFIFOCFG_POS                  (0U)
#define USBHS_GDFIFOCFG_GDFIFOCFG                      (0x0000FFFFUL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_0                    (0x00000001UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_1                    (0x00000002UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_2                    (0x00000004UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_3                    (0x00000008UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_4                    (0x00000010UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_5                    (0x00000020UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_6                    (0x00000040UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_7                    (0x00000080UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_8                    (0x00000100UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_9                    (0x00000200UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_10                   (0x00000400UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_11                   (0x00000800UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_12                   (0x00001000UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_13                   (0x00002000UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_14                   (0x00004000UL)
#define USBHS_GDFIFOCFG_GDFIFOCFG_15                   (0x00008000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_POS             (16U)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR                 (0xFFFF0000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_0               (0x00010000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_1               (0x00020000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_2               (0x00040000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_3               (0x00080000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_4               (0x00100000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_5               (0x00200000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_6               (0x00400000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_7               (0x00800000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_8               (0x01000000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_9               (0x02000000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_10              (0x04000000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_11              (0x08000000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_12              (0x10000000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_13              (0x20000000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_14              (0x40000000UL)
#define USBHS_GDFIFOCFG_EPINFOBASEADDR_15              (0x80000000UL)

