levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_HPTXFSIZ register  */
#define USBHS_HPTXFSIZ_PTXFSTADDR_POS                  (0U)
#define USBHS_HPTXFSIZ_PTXFSTADDR                      (0x00001FFFUL)
#define USBHS_HPTXFSIZ_PTXFSTADDR_0                    (0x00000001UL)
#define USBHS_HPTXFSIZ_PTXFSTADDR_1                    (0x00000002UL)
#define USBHS_HPTXFSIZ_PTXFSTADDR_2                    (0x00000004UL)
#define USBHS_HPTXFSIZ_PTXFSTADDR_3                    (0x00000008UL)
#define USBHS_HPTXFSIZ_PTXFSTADDR_4                    (0x00000010UL)
#define USBHS_HPTXFSIZ_PTXFSTADDR_5                    (0x00000020UL)
#define USBHS_HPTXFSIZ_PTXFSTADDR_6                    (0x00000040UL)
#define USBHS_HPTXFSIZ_PTXFSTADDR_7                    (0x00000080UL)
#define USBHS_HPTXFSIZ_PTXFSTADDR_8                    (0x00000100UL)
#define USBHS_HPTXFSIZ_PTXFSTADDR_9                    (0x00000200UL)
#define USBHS_HPTXFSIZ_PTXFSTADDR_10                   (0x00000400UL)
#define USBHS_HPTXFSIZ_PTXFSTADDR_11                   (0x00000800UL)
#define USBHS_HPTXFSIZ_PTXFSTADDR_12                   (0x00001000UL)
#define USBHS_HPTXFSIZ_PTXFSIZE_POS                    (16U)
#define USBHS_HPTXFSIZ_PTXFSIZE                        (0x0FFF0000UL)
#define USBHS_HPTXFSIZ_PTXFSIZE_0                      (0x00010000UL)
#define USBHS_HPTXFSIZ_PTXFSIZE_1                      (0x00020000UL)
#define USBHS_HPTXFSIZ_PTXFSIZE_2                      (0x00040000UL)
#define USBHS_HPTXFSIZ_PTXFSIZE_3                      (0x00080000UL)
#define USBHS_HPTXFSIZ_PTXFSIZE_4                      (0x00100000UL)
#define USBHS_HPTXFSIZ_PTXFSIZE_5                      (0x00200000UL)
#define USBHS_HPTXFSIZ_PTXFSIZE_6                      (0x00400000UL)
#define USBHS_HPTXFSIZ_PTXFSIZE_7                      (0x00800000UL)
#define USBHS_HPTXFSIZ_PTXFSIZE_8                      (0x01000000UL)
#define USBHS_HPTXFSIZ_PTXFSIZE_9                      (0x02000000UL)
#define USBHS_HPTXFSIZ_PTXFSIZE_10                     (0x04000000UL)
#define USBHS_HPTXFSIZ_PTXFSIZE_11                     (0x08000000UL)

/*  Bit definition for USBHS_DIEPTXF1 register  */
#define USBHS_DIEPTXF1_INEPNTXFSTADDR_POS              (0U)
#define USBHS_DIEPTXF1_INEPNTXFSTADDR                  (0x00001FFFUL)
#define USBHS_DIEPTXF1_INEPNTXFSTADDR_0                (0x00000001UL)
#define USBHS_DIEPTXF1_INEPNTXFSTADDR_1                (0x00000002UL)
#define USBHS_DIEPTXF1_INEPNTXFSTADDR_2                (0x00000004UL)
#define USBHS_DIEPTXF1_INEPNTXFSTADDR_3                (0x00000008UL)
#define USBHS_DIEPTXF1_INEPNTXFSTADDR_4                (0x00000010UL)
#define USBHS_DIEPTXF1_INEPNTXFSTADDR_5                (0x00000020UL)
#define USBHS_DIEPTXF1_INEPNTXFSTADDR_6                (0x00000040UL)
#define USBHS_DIEPTXF1_INEPNTXFSTADDR_7                (0x00000080UL)
#define USBHS_DIEPTXF1_INEPNTXFSTADDR_8                (0x00000100UL)
#define USBHS_DIEPTXF1_INEPNTXFSTADDR_9                (0x00000200UL)
#define USBHS_DIEPTXF1_INEPNTXFSTADDR_10               (0x00000400UL)
#define USBHS_DIEPTXF1_INEPNTXFSTADDR_11               (0x00000800UL)
#define USBHS_DIEPTXF1_INEPNTXFSTADDR_12               (0x00001000UL)
#define USBHS_DIEPTXF1_INEPNTXFDEP_POS                 (16U)
#define USBHS_DIEPTXF1_INEPNTXFDEP                     (0x0FFF0000UL)
#define USBHS_DIEPTXF1_INEPNTXFDEP_0                   (0x00010000UL)
#define USBHS_DIEPTXF1_INEPNTXFDEP_1                   (0x00020000UL)
#define USBHS_DIEPTXF1_INEPNTXFDEP_2                   (0x00040000UL)
#define USBHS_DIEPTXF1_INEPNTXFDEP_3                   (0x00080000UL)
#define USBHS_DIEPTXF1_INEPNTXFDEP_4                   (0x00100000UL)
#define USBHS_DIEPTXF1_INEPNTXFDEP_5                   (0x00200000UL)
#define USBHS_DIEPTXF1_INEPNTXFDEP_6                   (0x00400000UL)
#define USBHS_DIEPTXF1_INEPNTXFDEP_7                   (0x00800000UL)
#define USBHS_DIEPTXF1_INEPNTXFDEP_8                   (0x01000000UL)
#define USBHS_DIEPTXF1_INEPNTXFDEP_9                   (0x02000000UL)
#define USBHS_DIEPTXF1_INEPNTXFDEP_10                  (0x04000000UL)
#define USBHS_DIEPTXF1_INEPNTXFDEP_11                  (0x08000000UL)

/*  Bit definition for USBHS_DIEPTXF2 register  */
#define USBHS_DIEPTXF2_INEPNTXFSTADDR_POS              (0U)
#define USBHS_DIEPTXF2_INEPNTXFSTADDR                  (0x00001FFFUL)
#define USBHS_DIEPTXF2_INEPNTXFSTADDR_0                (0x00000001UL)
#define USBHS_DIEPTXF2_INEPNTXFSTADDR_1                (0x00000002UL)
#define USBHS_DIEPTXF2_INEPNTXFSTADDR_2                (0x00000004UL)
#define USBHS_DIEPTXF2_INEPNTXFSTADDR_3                (0x00000008UL)
#define USBHS_DIEPTXF2_INEPNTXFSTADDR_4                (0x00000010UL)
#define USBHS_DIEPTXF2_INEPNTXFSTADDR_5                (0x00000020UL)
#define USBHS_DIEPTXF2_INEPNTXFSTADDR_6                (0x00000040UL)
#define USBHS_DIEPTXF2_INEPNTXFSTADDR_7                (0x00000080UL)
#define USBHS_DIEPTXF2_INEPNTXFSTADDR_8                (0x00000100UL)
#define USBHS_DIEPTXF2_INEPNTXFSTADDR_9                (0x00000200UL)
#define USBHS_DIEPTXF2_INEPNTXFSTADDR_10               (0x00000400UL)
#define USBHS_DIEPTXF2_INEPNTXFSTADDR_11               (0x00000800UL)
#define USBHS_DIEPTXF2_INEPNTXFSTADDR_12               (0x00001000UL)
#define USBHS_DIEPTXF2_INEPNTXFDEP_POS                 (16U)
#define USBHS_DIEPTXF2_INEPNTXFDEP                     (0x0FFF0000UL)
#define USBHS_DIEPTXF2_INEPNTXFDEP_0                   (0x00010000UL)
#define USBHS_DIEPTXF2_INEPNTXFDEP_1                   (0x00020000UL)
#define USBHS_DIEPTXF2_INEPNTXFDEP_2                   (0x00040000UL)
#define USBHS_DIEPTXF2_INEPNTXFDEP_3                   (0x00080000UL)
#define USBHS_DIEPTXF2_INEPNTXFDEP_4                   (0x00100000UL)
#define USBHS_DIEPTXF2_INEPNTXFDEP_5                   (0x00200000UL)
#define USBHS_DIEPTXF2_INEPNTXFDEP_6                   (0x00400000UL)
#define USBHS_DIEPTXF2_INEPNTXFDEP_7                   (0x00800000UL)
#define USBHS_DIEPTXF2_INEPNTXFDEP_8                   (0x01000000UL)
#define USBHS_DIEPTXF2_INEPNTXFDEP_9                   (0x02000000UL)
#define USBHS_DIEPTXF2_INEPNTXFDEP_10                  (0x04000000UL)
#define USBHS_DIEPTXF2_INEPNTXFDEP_11                  (0x08000000UL)

/*  Bit definition for USBHS_DIEPTXF3 register  */
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_POS              (0U)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR                  (0x00003FFFUL)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_0                (0x00000001UL)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_1                (0x00000002UL)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_2                (0x00000004UL)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_3                (0x00000008UL)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_4                (0x00000010UL)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_5                (0x00000020UL)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_6                (0x00000040UL)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_7                (0x00000080UL)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_8                (0x00000100UL)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_9                (0x00000200UL)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_10               (0x00000400UL)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_11               (0x00000800UL)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_12               (0x00001000UL)
#define USBHS_DIEPTXF3_INEPNTXFSTADDR_13               (0x00002000UL)
#define USBHS_DIEPTXF3_INEPNTXFDEP_POS                 (16U)
#define USBHS_DIEPTXF3_INEPNTXFDEP                     (0x0FFF0000UL)
#define USBHS_DIEPTXF3_INEPNTXFDEP_0                   (0x00010000UL)
#define USBHS_DIEPTXF3_INEPNTXFDEP_1                   (0x00020000UL)
#define USBHS_DIEPTXF3_INEPNTXFDEP_2                   (0x00040000UL)
#define USBHS_DIEPTXF3_INEPNTXFDEP_3                   (0x00080000UL)
#define USBHS_DIEPTXF3_INEPNTXFDEP_4                   (0x00100000UL)
#define USBHS_DIEPTXF3_INEPNTXFDEP_5                   (0x00200000UL)
#define USBHS_DIEPTXF3_INEPNTXFDEP_6                   (0x00400000UL)
#define USBHS_DIEPTXF3_INEPNTXFDEP_7                   (0x00800000UL)
#define USBHS_DIEPTXF3_INEPNTXFDEP_8                   (0x01000000UL)
#define USBHS_DIEPTXF3_INEPNTXFDEP_9                   (0x02000000UL)
#define USBHS_DIEPTXF3_INEPNTXFDEP_10                  (0x04000000UL)
#define USBHS_DIEPTXF3_INEPNTXFDEP_11                  (0x08000000UL)

/*  Bit definition for USBHS_DIEPTXF4 register  */
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_POS              (0U)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR                  (0x00003FFFUL)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_0                (0x00000001UL)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_1                (0x00000002UL)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_2                (0x00000004UL)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_3                (0x00000008UL)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_4                (0x00000010UL)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_5                (0x00000020UL)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_6                (0x00000040UL)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_7                (0x00000080UL)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_8                (0x00000100UL)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_9                (0x00000200UL)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_10               (0x00000400UL)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_11               (0x00000800UL)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_12               (0x00001000UL)
#define USBHS_DIEPTXF4_INEPNTXFSTADDR_13               (0x00002000UL)
#define USBHS_DIEPTXF4_INEPNTXFDEP_POS                 (16U)
#define USBHS_DIEPTXF4_INEPNTXFDEP                     (0x0FFF0000UL)
#define USBHS_DIEPTXF4_INEPNTXFDEP_0                   (0x00010000UL)
#define USBHS_DIEPTXF4_INEPNTXFDEP_1                   (0x00020000UL)
#define USBHS_DIEPTXF4_INEPNTXFDEP_2                   (0x00040000UL)
#define USBHS_DIEPTXF4_INEPNTXFDEP_3                   (0x00080000UL)
#define USBHS_DIEPTXF4_INEPNTXFDEP_4                   (0x00100000UL)
#define USBHS_DIEPTXF4_INEPNTXFDEP_5                   (0x00200000UL)
#define USBHS_DIEPTXF4_INEPNTXFDEP_6                   (0x00400000UL)
#define USBHS_DIEPTXF4_INEPNTXFDEP_7                   (0x00800000UL)
#define USBHS_DIEPTXF4_INEPNTXFDEP_8                   (0x01000000UL)
#define USBHS_DIEPTXF4_INEPNTXFDEP_9                   (0x02000000UL)
#define USBHS_DIEPTXF4_INEPNTXFDEP_10                  (0x04000000UL)
#define USBHS_DIEPTXF4_INEPNTXFDEP_11                  (0x08000000UL)

/*  Bit definition for USBHS_DIEPTXF5 register  */
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_POS              (0U)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR                  (0x00003FFFUL)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_0                (0x00000001UL)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_1                (0x00000002UL)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_2                (0x00000004UL)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_3                (0x00000008UL)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_4                (0x00000010UL)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_5                (0x00000020UL)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_6                (0x00000040UL)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_7                (0x00000080UL)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_8                (0x00000100UL)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_9                (0x00000200UL)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_10               (0x00000400UL)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_11               (0x00000800UL)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_12               (0x00001000UL)
#define USBHS_DIEPTXF5_INEPNTXFSTADDR_13               (0x00002000UL)
#define USBHS_DIEPTXF5_INEPNTXFDEP_POS                 (16U)
#define USBHS_DIEPTXF5_INEPNTXFDEP                     (0x0FFF0000UL)
#define USBHS_DIEPTXF5_INEPNTXFDEP_0                   (0x00010000UL)
#define USBHS_DIEPTXF5_INEPNTXFDEP_1                   (0x00020000UL)
#define USBHS_DIEPTXF5_INEPNTXFDEP_2                   (0x00040000UL)
#define USBHS_DIEPTXF5_INEPNTXFDEP_3                   (0x00080000UL)
#define USBHS_DIEPTXF5_INEPNTXFDEP_4                   (0x00100000UL)
#define USBHS_DIEPTXF5_INEPNTXFDEP_5                   (0x00200000UL)
#define USBHS_DIEPTXF5_INEPNTXFDEP_6                   (0x00400000UL)
#define USBHS_DIEPTXF5_INEPNTXFDEP_7                   (0x00800000UL)
#define USBHS_DIEPTXF5_INEPNTXFDEP_8                   (0x01000000UL)
#define USBHS_DIEPTXF5_INEPNTXFDEP_9                   (0x02000000UL)
#define USBHS_DIEPTXF5_INEPNTXFDEP_10                  (0x04000000UL)
#define USBHS_DIEPTXF5_INEPNTXFDEP_11                  (0x08000000UL)

