levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DIEPTXF6 register  */
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_POS              (0U)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR                  (0x00003FFFUL)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_0                (0x00000001UL)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_1                (0x00000002UL)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_2                (0x00000004UL)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_3                (0x00000008UL)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_4                (0x00000010UL)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_5                (0x00000020UL)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_6                (0x00000040UL)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_7                (0x00000080UL)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_8                (0x00000100UL)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_9                (0x00000200UL)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_10               (0x00000400UL)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_11               (0x00000800UL)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_12               (0x00001000UL)
#define USBHS_DIEPTXF6_INEPNTXFSTADDR_13               (0x00002000UL)
#define USBHS_DIEPTXF6_INEPNTXFDEP_POS                 (16U)
#define USBHS_DIEPTXF6_INEPNTXFDEP                     (0x0FFF0000UL)
#define USBHS_DIEPTXF6_INEPNTXFDEP_0                   (0x00010000UL)
#define USBHS_DIEPTXF6_INEPNTXFDEP_1                   (0x00020000UL)
#define USBHS_DIEPTXF6_INEPNTXFDEP_2                   (0x00040000UL)
#define USBHS_DIEPTXF6_INEPNTXFDEP_3                   (0x00080000UL)
#define USBHS_DIEPTXF6_INEPNTXFDEP_4                   (0x00100000UL)
#define USBHS_DIEPTXF6_INEPNTXFDEP_5                   (0x00200000UL)
#define USBHS_DIEPTXF6_INEPNTXFDEP_6                   (0x00400000UL)
#define USBHS_DIEPTXF6_INEPNTXFDEP_7                   (0x00800000UL)
#define USBHS_DIEPTXF6_INEPNTXFDEP_8                   (0x01000000UL)
#define USBHS_DIEPTXF6_INEPNTXFDEP_9                   (0x02000000UL)
#define USBHS_DIEPTXF6_INEPNTXFDEP_10                  (0x04000000UL)
#define USBHS_DIEPTXF6_INEPNTXFDEP_11                  (0x08000000UL)

/*  Bit definition for USBHS_DIEPTXF7 register  */
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_POS              (0U)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR                  (0x00007FFFUL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_0                (0x00000001UL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_1                (0x00000002UL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_2                (0x00000004UL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_3                (0x00000008UL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_4                (0x00000010UL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_5                (0x00000020UL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_6                (0x00000040UL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_7                (0x00000080UL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_8                (0x00000100UL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_9                (0x00000200UL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_10               (0x00000400UL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_11               (0x00000800UL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_12               (0x00001000UL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_13               (0x00002000UL)
#define USBHS_DIEPTXF7_INEPNTXFSTADDR_14               (0x00004000UL)
#define USBHS_DIEPTXF7_INEPNTXFDEP_POS                 (16U)
#define USBHS_DIEPTXF7_INEPNTXFDEP                     (0x0FFF0000UL)
#define USBHS_DIEPTXF7_INEPNTXFDEP_0                   (0x00010000UL)
#define USBHS_DIEPTXF7_INEPNTXFDEP_1                   (0x00020000UL)
#define USBHS_DIEPTXF7_INEPNTXFDEP_2                   (0x00040000UL)
#define USBHS_DIEPTXF7_INEPNTXFDEP_3                   (0x00080000UL)
#define USBHS_DIEPTXF7_INEPNTXFDEP_4                   (0x00100000UL)
#define USBHS_DIEPTXF7_INEPNTXFDEP_5                   (0x00200000UL)
#define USBHS_DIEPTXF7_INEPNTXFDEP_6                   (0x00400000UL)
#define USBHS_DIEPTXF7_INEPNTXFDEP_7                   (0x00800000UL)
#define USBHS_DIEPTXF7_INEPNTXFDEP_8                   (0x01000000UL)
#define USBHS_DIEPTXF7_INEPNTXFDEP_9                   (0x02000000UL)
#define USBHS_DIEPTXF7_INEPNTXFDEP_10                  (0x04000000UL)
#define USBHS_DIEPTXF7_INEPNTXFDEP_11                  (0x08000000UL)

/*  Bit definition for USBHS_DIEPTXF8 register  */
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_POS              (0U)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR                  (0x00007FFFUL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_0                (0x00000001UL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_1                (0x00000002UL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_2                (0x00000004UL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_3                (0x00000008UL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_4                (0x00000010UL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_5                (0x00000020UL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_6                (0x00000040UL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_7                (0x00000080UL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_8                (0x00000100UL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_9                (0x00000200UL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_10               (0x00000400UL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_11               (0x00000800UL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_12               (0x00001000UL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_13               (0x00002000UL)
#define USBHS_DIEPTXF8_INEPNTXFSTADDR_14               (0x00004000UL)
#define USBHS_DIEPTXF8_INEPNTXFDEP_POS                 (16U)
#define USBHS_DIEPTXF8_INEPNTXFDEP                     (0x0FFF0000UL)
#define USBHS_DIEPTXF8_INEPNTXFDEP_0                   (0x00010000UL)
#define USBHS_DIEPTXF8_INEPNTXFDEP_1                   (0x00020000UL)
#define USBHS_DIEPTXF8_INEPNTXFDEP_2                   (0x00040000UL)
#define USBHS_DIEPTXF8_INEPNTXFDEP_3                   (0x00080000UL)
#define USBHS_DIEPTXF8_INEPNTXFDEP_4                   (0x00100000UL)
#define USBHS_DIEPTXF8_INEPNTXFDEP_5                   (0x00200000UL)
#define USBHS_DIEPTXF8_INEPNTXFDEP_6                   (0x00400000UL)
#define USBHS_DIEPTXF8_INEPNTXFDEP_7                   (0x00800000UL)
#define USBHS_DIEPTXF8_INEPNTXFDEP_8                   (0x01000000UL)
#define USBHS_DIEPTXF8_INEPNTXFDEP_9                   (0x02000000UL)
#define USBHS_DIEPTXF8_INEPNTXFDEP_10                  (0x04000000UL)
#define USBHS_DIEPTXF8_INEPNTXFDEP_11                  (0x08000000UL)

/*  Bit definition for USBHS_DIEPTXF9 register  */
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_POS              (0U)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR                  (0x00007FFFUL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_0                (0x00000001UL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_1                (0x00000002UL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_2                (0x00000004UL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_3                (0x00000008UL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_4                (0x00000010UL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_5                (0x00000020UL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_6                (0x00000040UL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_7                (0x00000080UL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_8                (0x00000100UL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_9                (0x00000200UL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_10               (0x00000400UL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_11               (0x00000800UL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_12               (0x00001000UL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_13               (0x00002000UL)
#define USBHS_DIEPTXF9_INEPNTXFSTADDR_14               (0x00004000UL)
#define USBHS_DIEPTXF9_INEPNTXFDEP_POS                 (16U)
#define USBHS_DIEPTXF9_INEPNTXFDEP                     (0x0FFF0000UL)
#define USBHS_DIEPTXF9_INEPNTXFDEP_0                   (0x00010000UL)
#define USBHS_DIEPTXF9_INEPNTXFDEP_1                   (0x00020000UL)
#define USBHS_DIEPTXF9_INEPNTXFDEP_2                   (0x00040000UL)
#define USBHS_DIEPTXF9_INEPNTXFDEP_3                   (0x00080000UL)
#define USBHS_DIEPTXF9_INEPNTXFDEP_4                   (0x00100000UL)
#define USBHS_DIEPTXF9_INEPNTXFDEP_5                   (0x00200000UL)
#define USBHS_DIEPTXF9_INEPNTXFDEP_6                   (0x00400000UL)
#define USBHS_DIEPTXF9_INEPNTXFDEP_7                   (0x00800000UL)
#define USBHS_DIEPTXF9_INEPNTXFDEP_8                   (0x01000000UL)
#define USBHS_DIEPTXF9_INEPNTXFDEP_9                   (0x02000000UL)
#define USBHS_DIEPTXF9_INEPNTXFDEP_10                  (0x04000000UL)
#define USBHS_DIEPTXF9_INEPNTXFDEP_11                  (0x08000000UL)

/*  Bit definition for USBHS_DIEPTXF10 register  */
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_POS             (0U)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR                 (0x00007FFFUL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_0               (0x00000001UL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_1               (0x00000002UL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_2               (0x00000004UL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_3               (0x00000008UL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_4               (0x00000010UL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_5               (0x00000020UL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_6               (0x00000040UL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_7               (0x00000080UL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_8               (0x00000100UL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_9               (0x00000200UL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_10              (0x00000400UL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_11              (0x00000800UL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_12              (0x00001000UL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_13              (0x00002000UL)
#define USBHS_DIEPTXF10_INEPNTXFSTADDR_14              (0x00004000UL)
#define USBHS_DIEPTXF10_INEPNTXFDEP_POS                (16U)
#define USBHS_DIEPTXF10_INEPNTXFDEP                    (0x0FFF0000UL)
#define USBHS_DIEPTXF10_INEPNTXFDEP_0                  (0x00010000UL)
#define USBHS_DIEPTXF10_INEPNTXFDEP_1                  (0x00020000UL)
#define USBHS_DIEPTXF10_INEPNTXFDEP_2                  (0x00040000UL)
#define USBHS_DIEPTXF10_INEPNTXFDEP_3                  (0x00080000UL)
#define USBHS_DIEPTXF10_INEPNTXFDEP_4                  (0x00100000UL)
#define USBHS_DIEPTXF10_INEPNTXFDEP_5                  (0x00200000UL)
#define USBHS_DIEPTXF10_INEPNTXFDEP_6                  (0x00400000UL)
#define USBHS_DIEPTXF10_INEPNTXFDEP_7                  (0x00800000UL)
#define USBHS_DIEPTXF10_INEPNTXFDEP_8                  (0x01000000UL)
#define USBHS_DIEPTXF10_INEPNTXFDEP_9                  (0x02000000UL)
#define USBHS_DIEPTXF10_INEPNTXFDEP_10                 (0x04000000UL)
#define USBHS_DIEPTXF10_INEPNTXFDEP_11                 (0x08000000UL)

/*  Bit definition for USBHS_DIEPTXF11 register  */
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_POS             (0U)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR                 (0x00007FFFUL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_0               (0x00000001UL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_1               (0x00000002UL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_2               (0x00000004UL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_3               (0x00000008UL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_4               (0x00000010UL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_5               (0x00000020UL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_6               (0x00000040UL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_7               (0x00000080UL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_8               (0x00000100UL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_9               (0x00000200UL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_10              (0x00000400UL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_11              (0x00000800UL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_12              (0x00001000UL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_13              (0x00002000UL)
#define USBHS_DIEPTXF11_INEPNTXFSTADDR_14              (0x00004000UL)
#define USBHS_DIEPTXF11_INEPNTXFDEP_POS                (16U)
#define USBHS_DIEPTXF11_INEPNTXFDEP                    (0x0FFF0000UL)
#define USBHS_DIEPTXF11_INEPNTXFDEP_0                  (0x00010000UL)
#define USBHS_DIEPTXF11_INEPNTXFDEP_1                  (0x00020000UL)
#define USBHS_DIEPTXF11_INEPNTXFDEP_2                  (0x00040000UL)
#define USBHS_DIEPTXF11_INEPNTXFDEP_3                  (0x00080000UL)
#define USBHS_DIEPTXF11_INEPNTXFDEP_4                  (0x00100000UL)
#define USBHS_DIEPTXF11_INEPNTXFDEP_5                  (0x00200000UL)
#define USBHS_DIEPTXF11_INEPNTXFDEP_6                  (0x00400000UL)
#define USBHS_DIEPTXF11_INEPNTXFDEP_7                  (0x00800000UL)
#define USBHS_DIEPTXF11_INEPNTXFDEP_8                  (0x01000000UL)
#define USBHS_DIEPTXF11_INEPNTXFDEP_9                  (0x02000000UL)
#define USBHS_DIEPTXF11_INEPNTXFDEP_10                 (0x04000000UL)
#define USBHS_DIEPTXF11_INEPNTXFDEP_11                 (0x08000000UL)

