levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DIEPTXF12 register  */
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_POS             (0U)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR                 (0x00007FFFUL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_0               (0x00000001UL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_1               (0x00000002UL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_2               (0x00000004UL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_3               (0x00000008UL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_4               (0x00000010UL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_5               (0x00000020UL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_6               (0x00000040UL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_7               (0x00000080UL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_8               (0x00000100UL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_9               (0x00000200UL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_10              (0x00000400UL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_11              (0x00000800UL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_12              (0x00001000UL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_13              (0x00002000UL)
#define USBHS_DIEPTXF12_INEPNTXFSTADDR_14              (0x00004000UL)
#define USBHS_DIEPTXF12_INEPNTXFDEP_POS                (16U)
#define USBHS_DIEPTXF12_INEPNTXFDEP                    (0x0FFF0000UL)
#define USBHS_DIEPTXF12_INEPNTXFDEP_0                  (0x00010000UL)
#define USBHS_DIEPTXF12_INEPNTXFDEP_1                  (0x00020000UL)
#define USBHS_DIEPTXF12_INEPNTXFDEP_2                  (0x00040000UL)
#define USBHS_DIEPTXF12_INEPNTXFDEP_3                  (0x00080000UL)
#define USBHS_DIEPTXF12_INEPNTXFDEP_4                  (0x00100000UL)
#define USBHS_DIEPTXF12_INEPNTXFDEP_5                  (0x00200000UL)
#define USBHS_DIEPTXF12_INEPNTXFDEP_6                  (0x00400000UL)
#define USBHS_DIEPTXF12_INEPNTXFDEP_7                  (0x00800000UL)
#define USBHS_DIEPTXF12_INEPNTXFDEP_8                  (0x01000000UL)
#define USBHS_DIEPTXF12_INEPNTXFDEP_9                  (0x02000000UL)
#define USBHS_DIEPTXF12_INEPNTXFDEP_10                 (0x04000000UL)
#define USBHS_DIEPTXF12_INEPNTXFDEP_11                 (0x08000000UL)

/*  Bit definition for USBHS_DIEPTXF13 register  */
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_POS             (0U)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR                 (0x00007FFFUL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_0               (0x00000001UL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_1               (0x00000002UL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_2               (0x00000004UL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_3               (0x00000008UL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_4               (0x00000010UL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_5               (0x00000020UL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_6               (0x00000040UL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_7               (0x00000080UL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_8               (0x00000100UL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_9               (0x00000200UL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_10              (0x00000400UL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_11              (0x00000800UL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_12              (0x00001000UL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_13              (0x00002000UL)
#define USBHS_DIEPTXF13_INEPNTXFSTADDR_14              (0x00004000UL)
#define USBHS_DIEPTXF13_INEPNTXFDEP_POS                (16U)
#define USBHS_DIEPTXF13_INEPNTXFDEP                    (0x0FFF0000UL)
#define USBHS_DIEPTXF13_INEPNTXFDEP_0                  (0x00010000UL)
#define USBHS_DIEPTXF13_INEPNTXFDEP_1                  (0x00020000UL)
#define USBHS_DIEPTXF13_INEPNTXFDEP_2                  (0x00040000UL)
#define USBHS_DIEPTXF13_INEPNTXFDEP_3                  (0x00080000UL)
#define USBHS_DIEPTXF13_INEPNTXFDEP_4                  (0x00100000UL)
#define USBHS_DIEPTXF13_INEPNTXFDEP_5                  (0x00200000UL)
#define USBHS_DIEPTXF13_INEPNTXFDEP_6                  (0x00400000UL)
#define USBHS_DIEPTXF13_INEPNTXFDEP_7                  (0x00800000UL)
#define USBHS_DIEPTXF13_INEPNTXFDEP_8                  (0x01000000UL)
#define USBHS_DIEPTXF13_INEPNTXFDEP_9                  (0x02000000UL)
#define USBHS_DIEPTXF13_INEPNTXFDEP_10                 (0x04000000UL)
#define USBHS_DIEPTXF13_INEPNTXFDEP_11                 (0x08000000UL)

/*  Bit definition for USBHS_DIEPTXF14 register  */
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_POS             (0U)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR                 (0x00007FFFUL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_0               (0x00000001UL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_1               (0x00000002UL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_2               (0x00000004UL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_3               (0x00000008UL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_4               (0x00000010UL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_5               (0x00000020UL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_6               (0x00000040UL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_7               (0x00000080UL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_8               (0x00000100UL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_9               (0x00000200UL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_10              (0x00000400UL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_11              (0x00000800UL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_12              (0x00001000UL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_13              (0x00002000UL)
#define USBHS_DIEPTXF14_INEPNTXFSTADDR_14              (0x00004000UL)
#define USBHS_DIEPTXF14_INEPNTXFDEP_POS                (16U)
#define USBHS_DIEPTXF14_INEPNTXFDEP                    (0x0FFF0000UL)
#define USBHS_DIEPTXF14_INEPNTXFDEP_0                  (0x00010000UL)
#define USBHS_DIEPTXF14_INEPNTXFDEP_1                  (0x00020000UL)
#define USBHS_DIEPTXF14_INEPNTXFDEP_2                  (0x00040000UL)
#define USBHS_DIEPTXF14_INEPNTXFDEP_3                  (0x00080000UL)
#define USBHS_DIEPTXF14_INEPNTXFDEP_4                  (0x00100000UL)
#define USBHS_DIEPTXF14_INEPNTXFDEP_5                  (0x00200000UL)
#define USBHS_DIEPTXF14_INEPNTXFDEP_6                  (0x00400000UL)
#define USBHS_DIEPTXF14_INEPNTXFDEP_7                  (0x00800000UL)
#define USBHS_DIEPTXF14_INEPNTXFDEP_8                  (0x01000000UL)
#define USBHS_DIEPTXF14_INEPNTXFDEP_9                  (0x02000000UL)
#define USBHS_DIEPTXF14_INEPNTXFDEP_10                 (0x04000000UL)
#define USBHS_DIEPTXF14_INEPNTXFDEP_11                 (0x08000000UL)

