levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DIEPTXF15 register  */
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_POS             (0U)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR                 (0x0000FFFFUL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_0               (0x00000001UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_1               (0x00000002UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_2               (0x00000004UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_3               (0x00000008UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_4               (0x00000010UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_5               (0x00000020UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_6               (0x00000040UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_7               (0x00000080UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_8               (0x00000100UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_9               (0x00000200UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_10              (0x00000400UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_11              (0x00000800UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_12              (0x00001000UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_13              (0x00002000UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_14              (0x00004000UL)
#define USBHS_DIEPTXF15_INEPNTXFSTADDR_15              (0x00008000UL)
#define USBHS_DIEPTXF15_INEPNTXFDEP_POS                (16U)
#define USBHS_DIEPTXF15_INEPNTXFDEP                    (0x0FFF0000UL)
#define USBHS_DIEPTXF15_INEPNTXFDEP_0                  (0x00010000UL)
#define USBHS_DIEPTXF15_INEPNTXFDEP_1                  (0x00020000UL)
#define USBHS_DIEPTXF15_INEPNTXFDEP_2                  (0x00040000UL)
#define USBHS_DIEPTXF15_INEPNTXFDEP_3                  (0x00080000UL)
#define USBHS_DIEPTXF15_INEPNTXFDEP_4                  (0x00100000UL)
#define USBHS_DIEPTXF15_INEPNTXFDEP_5                  (0x00200000UL)
#define USBHS_DIEPTXF15_INEPNTXFDEP_6                  (0x00400000UL)
#define USBHS_DIEPTXF15_INEPNTXFDEP_7                  (0x00800000UL)
#define USBHS_DIEPTXF15_INEPNTXFDEP_8                  (0x01000000UL)
#define USBHS_DIEPTXF15_INEPNTXFDEP_9                  (0x02000000UL)
#define USBHS_DIEPTXF15_INEPNTXFDEP_10                 (0x04000000UL)
#define USBHS_DIEPTXF15_INEPNTXFDEP_11                 (0x08000000UL)

/*  Bit definition for USBHS_HCFG register  */
#define USBHS_HCFG_FSLSPCLKSEL_POS                     (0U)
#define USBHS_HCFG_FSLSPCLKSEL                         (0x00000003UL)
#define USBHS_HCFG_FSLSPCLKSEL_0                       (0x00000001UL)
#define USBHS_HCFG_FSLSPCLKSEL_1                       (0x00000002UL)
#define USBHS_HCFG_FSLSSUPP_POS                        (2U)
#define USBHS_HCFG_FSLSSUPP                            (0x00000004UL)
#define USBHS_HCFG_ENA32KHZS_POS                       (7U)
#define USBHS_HCFG_ENA32KHZS                           (0x00000080UL)
#define USBHS_HCFG_RESVALID_POS                        (8U)
#define USBHS_HCFG_RESVALID                            (0x0000FF00UL)
#define USBHS_HCFG_RESVALID_0                          (0x00000100UL)
#define USBHS_HCFG_RESVALID_1                          (0x00000200UL)
#define USBHS_HCFG_RESVALID_2                          (0x00000400UL)
#define USBHS_HCFG_RESVALID_3                          (0x00000800UL)
#define USBHS_HCFG_RESVALID_4                          (0x00001000UL)
#define USBHS_HCFG_RESVALID_5                          (0x00002000UL)
#define USBHS_HCFG_RESVALID_6                          (0x00004000UL)
#define USBHS_HCFG_RESVALID_7                          (0x00008000UL)
#define USBHS_HCFG_MODECHTIMEN_POS                     (31U)
#define USBHS_HCFG_MODECHTIMEN                         (0x80000000UL)

/*  Bit definition for USBHS_HFIR register  */
#define USBHS_HFIR_FRINT_POS                           (0U)
#define USBHS_HFIR_FRINT                               (0x0000FFFFUL)
#define USBHS_HFIR_FRINT_0                             (0x00000001UL)
#define USBHS_HFIR_FRINT_1                             (0x00000002UL)
#define USBHS_HFIR_FRINT_2                             (0x00000004UL)
#define USBHS_HFIR_FRINT_3                             (0x00000008UL)
#define USBHS_HFIR_FRINT_4                             (0x00000010UL)
#define USBHS_HFIR_FRINT_5                             (0x00000020UL)
#define USBHS_HFIR_FRINT_6                             (0x00000040UL)
#define USBHS_HFIR_FRINT_7                             (0x00000080UL)
#define USBHS_HFIR_FRINT_8                             (0x00000100UL)
#define USBHS_HFIR_FRINT_9                             (0x00000200UL)
#define USBHS_HFIR_FRINT_10                            (0x00000400UL)
#define USBHS_HFIR_FRINT_11                            (0x00000800UL)
#define USBHS_HFIR_FRINT_12                            (0x00001000UL)
#define USBHS_HFIR_FRINT_13                            (0x00002000UL)
#define USBHS_HFIR_FRINT_14                            (0x00004000UL)
#define USBHS_HFIR_FRINT_15                            (0x00008000UL)
#define USBHS_HFIR_HFIRRLDCTRL_POS                     (16U)
#define USBHS_HFIR_HFIRRLDCTRL                         (0x00010000UL)

/*  Bit definition for USBHS_HFNUM register  */
#define USBHS_HFNUM_FRNUM_POS                          (0U)
#define USBHS_HFNUM_FRNUM                              (0x0000FFFFUL)
#define USBHS_HFNUM_FRNUM_0                            (0x00000001UL)
#define USBHS_HFNUM_FRNUM_1                            (0x00000002UL)
#define USBHS_HFNUM_FRNUM_2                            (0x00000004UL)
#define USBHS_HFNUM_FRNUM_3                            (0x00000008UL)
#define USBHS_HFNUM_FRNUM_4                            (0x00000010UL)
#define USBHS_HFNUM_FRNUM_5                            (0x00000020UL)
#define USBHS_HFNUM_FRNUM_6                            (0x00000040UL)
#define USBHS_HFNUM_FRNUM_7                            (0x00000080UL)
#define USBHS_HFNUM_FRNUM_8                            (0x00000100UL)
#define USBHS_HFNUM_FRNUM_9                            (0x00000200UL)
#define USBHS_HFNUM_FRNUM_10                           (0x00000400UL)
#define USBHS_HFNUM_FRNUM_11                           (0x00000800UL)
#define USBHS_HFNUM_FRNUM_12                           (0x00001000UL)
#define USBHS_HFNUM_FRNUM_13                           (0x00002000UL)
#define USBHS_HFNUM_FRNUM_14                           (0x00004000UL)
#define USBHS_HFNUM_FRNUM_15                           (0x00008000UL)
#define USBHS_HFNUM_FRREM_POS                          (16U)
#define USBHS_HFNUM_FRREM                              (0xFFFF0000UL)
#define USBHS_HFNUM_FRREM_0                            (0x00010000UL)
#define USBHS_HFNUM_FRREM_1                            (0x00020000UL)
#define USBHS_HFNUM_FRREM_2                            (0x00040000UL)
#define USBHS_HFNUM_FRREM_3                            (0x00080000UL)
#define USBHS_HFNUM_FRREM_4                            (0x00100000UL)
#define USBHS_HFNUM_FRREM_5                            (0x00200000UL)
#define USBHS_HFNUM_FRREM_6                            (0x00400000UL)
#define USBHS_HFNUM_FRREM_7                            (0x00800000UL)
#define USBHS_HFNUM_FRREM_8                            (0x01000000UL)
#define USBHS_HFNUM_FRREM_9                            (0x02000000UL)
#define USBHS_HFNUM_FRREM_10                           (0x04000000UL)
#define USBHS_HFNUM_FRREM_11                           (0x08000000UL)
#define USBHS_HFNUM_FRREM_12                           (0x10000000UL)
#define USBHS_HFNUM_FRREM_13                           (0x20000000UL)
#define USBHS_HFNUM_FRREM_14                           (0x40000000UL)
#define USBHS_HFNUM_FRREM_15                           (0x80000000UL)

/*  Bit definition for USBHS_HPTXSTS register  */
#define USBHS_HPTXSTS_PTXFSPCAVAIL_POS                 (0U)
#define USBHS_HPTXSTS_PTXFSPCAVAIL                     (0x0000FFFFUL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_0                   (0x00000001UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_1                   (0x00000002UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_2                   (0x00000004UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_3                   (0x00000008UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_4                   (0x00000010UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_5                   (0x00000020UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_6                   (0x00000040UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_7                   (0x00000080UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_8                   (0x00000100UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_9                   (0x00000200UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_10                  (0x00000400UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_11                  (0x00000800UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_12                  (0x00001000UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_13                  (0x00002000UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_14                  (0x00004000UL)
#define USBHS_HPTXSTS_PTXFSPCAVAIL_15                  (0x00008000UL)
#define USBHS_HPTXSTS_PTXQSPCAVAIL_POS                 (16U)
#define USBHS_HPTXSTS_PTXQSPCAVAIL                     (0x00FF0000UL)
#define USBHS_HPTXSTS_PTXQSPCAVAIL_0                   (0x00010000UL)
#define USBHS_HPTXSTS_PTXQSPCAVAIL_1                   (0x00020000UL)
#define USBHS_HPTXSTS_PTXQSPCAVAIL_2                   (0x00040000UL)
#define USBHS_HPTXSTS_PTXQSPCAVAIL_3                   (0x00080000UL)
#define USBHS_HPTXSTS_PTXQSPCAVAIL_4                   (0x00100000UL)
#define USBHS_HPTXSTS_PTXQSPCAVAIL_5                   (0x00200000UL)
#define USBHS_HPTXSTS_PTXQSPCAVAIL_6                   (0x00400000UL)
#define USBHS_HPTXSTS_PTXQSPCAVAIL_7                   (0x00800000UL)
#define USBHS_HPTXSTS_PTXQTOP_POS                      (24U)
#define USBHS_HPTXSTS_PTXQTOP                          (0xFF000000UL)
#define USBHS_HPTXSTS_PTXQTOP_0                        (0x01000000UL)
#define USBHS_HPTXSTS_PTXQTOP_1                        (0x02000000UL)
#define USBHS_HPTXSTS_PTXQTOP_2                        (0x04000000UL)
#define USBHS_HPTXSTS_PTXQTOP_3                        (0x08000000UL)
#define USBHS_HPTXSTS_PTXQTOP_4                        (0x10000000UL)
#define USBHS_HPTXSTS_PTXQTOP_5                        (0x20000000UL)
#define USBHS_HPTXSTS_PTXQTOP_6                        (0x40000000UL)
#define USBHS_HPTXSTS_PTXQTOP_7                        (0x80000000UL)

/*  Bit definition for USBHS_HAINT register  */
#define USBHS_HAINT_HAINT                              (0x0000FFFFUL)

/*  Bit definition for USBHS_HAINTMSK register  */
#define USBHS_HAINTMSK_HAINTMSK                        (0x0000FFFFUL)

/*  Bit definition for USBHS_HPRT register  */
#define USBHS_HPRT_PRTCONNSTS_POS                      (0U)
#define USBHS_HPRT_PRTCONNSTS                          (0x00000001UL)
#define USBHS_HPRT_PRTCONNDET_POS                      (1U)
#define USBHS_HPRT_PRTCONNDET                          (0x00000002UL)
#define USBHS_HPRT_PRTENA_POS                          (2U)
#define USBHS_HPRT_PRTENA                              (0x00000004UL)
#define USBHS_HPRT_PRTENCHNG_POS                       (3U)
#define USBHS_HPRT_PRTENCHNG                           (0x00000008UL)
#define USBHS_HPRT_PRTOVRCURRACT_POS                   (4U)
#define USBHS_HPRT_PRTOVRCURRACT                       (0x00000010UL)
#define USBHS_HPRT_PRTOVRCURRCHNG_POS                  (5U)
#define USBHS_HPRT_PRTOVRCURRCHNG                      (0x00000020UL)
#define USBHS_HPRT_PRTRES_POS                          (6U)
#define USBHS_HPRT_PRTRES                              (0x00000040UL)
#define USBHS_HPRT_PRTSUSP_POS                         (7U)
#define USBHS_HPRT_PRTSUSP                             (0x00000080UL)
#define USBHS_HPRT_PRTRST_POS                          (8U)
#define USBHS_HPRT_PRTRST                              (0x00000100UL)
#define USBHS_HPRT_PRTLNSTS_POS                        (10U)
#define USBHS_HPRT_PRTLNSTS                            (0x00000C00UL)
#define USBHS_HPRT_PRTLNSTS_0                          (0x00000400UL)
#define USBHS_HPRT_PRTLNSTS_1                          (0x00000800UL)
#define USBHS_HPRT_PRTPWR_POS                          (12U)
#define USBHS_HPRT_PRTPWR                              (0x00001000UL)
#define USBHS_HPRT_PRTTSTCTL_POS                       (13U)
#define USBHS_HPRT_PRTTSTCTL                           (0x0001E000UL)
#define USBHS_HPRT_PRTTSTCTL_0                         (0x00002000UL)
#define USBHS_HPRT_PRTTSTCTL_1                         (0x00004000UL)
#define USBHS_HPRT_PRTTSTCTL_2                         (0x00008000UL)
#define USBHS_HPRT_PRTTSTCTL_3                         (0x00010000UL)
#define USBHS_HPRT_PRTSPD_POS                          (17U)
#define USBHS_HPRT_PRTSPD                              (0x00060000UL)
#define USBHS_HPRT_PRTSPD_0                            (0x00020000UL)
#define USBHS_HPRT_PRTSPD_1                            (0x00040000UL)

/*  Bit definition for USBHS_HCCHAR0 register  */
#define USBHS_HCCHAR0_MPS_POS                          (0U)
#define USBHS_HCCHAR0_MPS                              (0x000007FFUL)
#define USBHS_HCCHAR0_MPS_0                            (0x00000001UL)
#define USBHS_HCCHAR0_MPS_1                            (0x00000002UL)
#define USBHS_HCCHAR0_MPS_2                            (0x00000004UL)
#define USBHS_HCCHAR0_MPS_3                            (0x00000008UL)
#define USBHS_HCCHAR0_MPS_4                            (0x00000010UL)
#define USBHS_HCCHAR0_MPS_5                            (0x00000020UL)
#define USBHS_HCCHAR0_MPS_6                            (0x00000040UL)
#define USBHS_HCCHAR0_MPS_7                            (0x00000080UL)
#define USBHS_HCCHAR0_MPS_8                            (0x00000100UL)
#define USBHS_HCCHAR0_MPS_9                            (0x00000200UL)
#define USBHS_HCCHAR0_MPS_10                           (0x00000400UL)
#define USBHS_HCCHAR0_EPNUM_POS                        (11U)
#define USBHS_HCCHAR0_EPNUM                            (0x00007800UL)
#define USBHS_HCCHAR0_EPNUM_0                          (0x00000800UL)
#define USBHS_HCCHAR0_EPNUM_1                          (0x00001000UL)
#define USBHS_HCCHAR0_EPNUM_2                          (0x00002000UL)
#define USBHS_HCCHAR0_EPNUM_3                          (0x00004000UL)
#define USBHS_HCCHAR0_EPDIR_POS                        (15U)
#define USBHS_HCCHAR0_EPDIR                            (0x00008000UL)
#define USBHS_HCCHAR0_LSPDDEV_POS                      (17U)
#define USBHS_HCCHAR0_LSPDDEV                          (0x00020000UL)
#define USBHS_HCCHAR0_EPTYPE_POS                       (18U)
#define USBHS_HCCHAR0_EPTYPE                           (0x000C0000UL)
#define USBHS_HCCHAR0_EPTYPE_0                         (0x00040000UL)
#define USBHS_HCCHAR0_EPTYPE_1                         (0x00080000UL)
#define USBHS_HCCHAR0_EC_POS                           (20U)
#define USBHS_HCCHAR0_EC                               (0x00300000UL)
#define USBHS_HCCHAR0_EC_0                             (0x00100000UL)
#define USBHS_HCCHAR0_EC_1                             (0x00200000UL)
#define USBHS_HCCHAR0_DEVADDR_POS                      (22U)
#define USBHS_HCCHAR0_DEVADDR                          (0x1FC00000UL)
#define USBHS_HCCHAR0_DEVADDR_0                        (0x00400000UL)
#define USBHS_HCCHAR0_DEVADDR_1                        (0x00800000UL)
#define USBHS_HCCHAR0_DEVADDR_2                        (0x01000000UL)
#define USBHS_HCCHAR0_DEVADDR_3                        (0x02000000UL)
#define USBHS_HCCHAR0_DEVADDR_4                        (0x04000000UL)
#define USBHS_HCCHAR0_DEVADDR_5                        (0x08000000UL)
#define USBHS_HCCHAR0_DEVADDR_6                        (0x10000000UL)
#define USBHS_HCCHAR0_ODDFRM_POS                       (29U)
#define USBHS_HCCHAR0_ODDFRM                           (0x20000000UL)
#define USBHS_HCCHAR0_CHDIS_POS                        (30U)
#define USBHS_HCCHAR0_CHDIS                            (0x40000000UL)
#define USBHS_HCCHAR0_CHENA_POS                        (31U)
#define USBHS_HCCHAR0_CHENA                            (0x80000000UL)

/*  Bit definition for USBHS_HCSPLT0 register  */
#define USBHS_HCSPLT0_PRTADDR_POS                      (0U)
#define USBHS_HCSPLT0_PRTADDR                          (0x0000007FUL)
#define USBHS_HCSPLT0_PRTADDR_0                        (0x00000001UL)
#define USBHS_HCSPLT0_PRTADDR_1                        (0x00000002UL)
#define USBHS_HCSPLT0_PRTADDR_2                        (0x00000004UL)
#define USBHS_HCSPLT0_PRTADDR_3                        (0x00000008UL)
#define USBHS_HCSPLT0_PRTADDR_4                        (0x00000010UL)
#define USBHS_HCSPLT0_PRTADDR_5                        (0x00000020UL)
#define USBHS_HCSPLT0_PRTADDR_6                        (0x00000040UL)
#define USBHS_HCSPLT0_HUBADDR_POS                      (7U)
#define USBHS_HCSPLT0_HUBADDR                          (0x00003F80UL)
#define USBHS_HCSPLT0_HUBADDR_0                        (0x00000080UL)
#define USBHS_HCSPLT0_HUBADDR_1                        (0x00000100UL)
#define USBHS_HCSPLT0_HUBADDR_2                        (0x00000200UL)
#define USBHS_HCSPLT0_HUBADDR_3                        (0x00000400UL)
#define USBHS_HCSPLT0_HUBADDR_4                        (0x00000800UL)
#define USBHS_HCSPLT0_HUBADDR_5                        (0x00001000UL)
#define USBHS_HCSPLT0_HUBADDR_6                        (0x00002000UL)
#define USBHS_HCSPLT0_XACTPOS_POS                      (14U)
#define USBHS_HCSPLT0_XACTPOS                          (0x0000C000UL)
#define USBHS_HCSPLT0_XACTPOS_0                        (0x00004000UL)
#define USBHS_HCSPLT0_XACTPOS_1                        (0x00008000UL)
#define USBHS_HCSPLT0_COMPSPLT_POS                     (16U)
#define USBHS_HCSPLT0_COMPSPLT                         (0x00010000UL)
#define USBHS_HCSPLT0_SPLTENA_POS                      (31U)
#define USBHS_HCSPLT0_SPLTENA                          (0x80000000UL)

/*  Bit definition for USBHS_HCINT0 register  */
#define USBHS_HCINT0_XFERCOMPL_POS                     (0U)
#define USBHS_HCINT0_XFERCOMPL                         (0x00000001UL)
#define USBHS_HCINT0_CHHLTD_POS                        (1U)
#define USBHS_HCINT0_CHHLTD                            (0x00000002UL)
#define USBHS_HCINT0_AHBERR_POS                        (2U)
#define USBHS_HCINT0_AHBERR                            (0x00000004UL)
#define USBHS_HCINT0_STALL_POS                         (3U)
#define USBHS_HCINT0_STALL                             (0x00000008UL)
#define USBHS_HCINT0_NAK_POS                           (4U)
#define USBHS_HCINT0_NAK                               (0x00000010UL)
#define USBHS_HCINT0_ACK_POS                           (5U)
#define USBHS_HCINT0_ACK                               (0x00000020UL)
#define USBHS_HCINT0_NYET_POS                          (6U)
#define USBHS_HCINT0_NYET                              (0x00000040UL)
#define USBHS_HCINT0_XACTERR_POS                       (7U)
#define USBHS_HCINT0_XACTERR                           (0x00000080UL)
#define USBHS_HCINT0_BBLERR_POS                        (8U)
#define USBHS_HCINT0_BBLERR                            (0x00000100UL)
#define USBHS_HCINT0_FRMOVRUN_POS                      (9U)
#define USBHS_HCINT0_FRMOVRUN                          (0x00000200UL)
#define USBHS_HCINT0_DATATGLERR_POS                    (10U)
#define USBHS_HCINT0_DATATGLERR                        (0x00000400UL)

/*  Bit definition for USBHS_HCINTMSK0 register  */
#define USBHS_HCINTMSK0_XFERCOMPLMSK_POS               (0U)
#define USBHS_HCINTMSK0_XFERCOMPLMSK                   (0x00000001UL)
#define USBHS_HCINTMSK0_CHHLTDMSK_POS                  (1U)
#define USBHS_HCINTMSK0_CHHLTDMSK                      (0x00000002UL)
#define USBHS_HCINTMSK0_AHBERRMSK_POS                  (2U)
#define USBHS_HCINTMSK0_AHBERRMSK                      (0x00000004UL)
#define USBHS_HCINTMSK0_STALLMSK_POS                   (3U)
#define USBHS_HCINTMSK0_STALLMSK                       (0x00000008UL)
#define USBHS_HCINTMSK0_NAKMSK_POS                     (4U)
#define USBHS_HCINTMSK0_NAKMSK                         (0x00000010UL)
#define USBHS_HCINTMSK0_ACKMSK_POS                     (5U)
#define USBHS_HCINTMSK0_ACKMSK                         (0x00000020UL)
#define USBHS_HCINTMSK0_NYETMSK_POS                    (6U)
#define USBHS_HCINTMSK0_NYETMSK                        (0x00000040UL)
#define USBHS_HCINTMSK0_XACTERRMSK_POS                 (7U)
#define USBHS_HCINTMSK0_XACTERRMSK                     (0x00000080UL)
#define USBHS_HCINTMSK0_BBLERRMSK_POS                  (8U)
#define USBHS_HCINTMSK0_BBLERRMSK                      (0x00000100UL)
#define USBHS_HCINTMSK0_FRMOVRUNMSK_POS                (9U)
#define USBHS_HCINTMSK0_FRMOVRUNMSK                    (0x00000200UL)
#define USBHS_HCINTMSK0_DATATGLERRMSK_POS              (10U)
#define USBHS_HCINTMSK0_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBHS_HCTSIZ0 register  */
#define USBHS_HCTSIZ0_XFERSIZE_POS                     (0U)
#define USBHS_HCTSIZ0_XFERSIZE                         (0x0007FFFFUL)
#define USBHS_HCTSIZ0_XFERSIZE_0                       (0x00000001UL)
#define USBHS_HCTSIZ0_XFERSIZE_1                       (0x00000002UL)
#define USBHS_HCTSIZ0_XFERSIZE_2                       (0x00000004UL)
#define USBHS_HCTSIZ0_XFERSIZE_3                       (0x00000008UL)
#define USBHS_HCTSIZ0_XFERSIZE_4                       (0x00000010UL)
#define USBHS_HCTSIZ0_XFERSIZE_5                       (0x00000020UL)
#define USBHS_HCTSIZ0_XFERSIZE_6                       (0x00000040UL)
#define USBHS_HCTSIZ0_XFERSIZE_7                       (0x00000080UL)
#define USBHS_HCTSIZ0_XFERSIZE_8                       (0x00000100UL)
#define USBHS_HCTSIZ0_XFERSIZE_9                       (0x00000200UL)
#define USBHS_HCTSIZ0_XFERSIZE_10                      (0x00000400UL)
#define USBHS_HCTSIZ0_XFERSIZE_11                      (0x00000800UL)
#define USBHS_HCTSIZ0_XFERSIZE_12                      (0x00001000UL)
#define USBHS_HCTSIZ0_XFERSIZE_13                      (0x00002000UL)
#define USBHS_HCTSIZ0_XFERSIZE_14                      (0x00004000UL)
#define USBHS_HCTSIZ0_XFERSIZE_15                      (0x00008000UL)
#define USBHS_HCTSIZ0_XFERSIZE_16                      (0x00010000UL)
#define USBHS_HCTSIZ0_XFERSIZE_17                      (0x00020000UL)
#define USBHS_HCTSIZ0_XFERSIZE_18                      (0x00040000UL)
#define USBHS_HCTSIZ0_PKTCNT_POS                       (19U)
#define USBHS_HCTSIZ0_PKTCNT                           (0x1FF80000UL)
#define USBHS_HCTSIZ0_PKTCNT_0                         (0x00080000UL)
#define USBHS_HCTSIZ0_PKTCNT_1                         (0x00100000UL)
#define USBHS_HCTSIZ0_PKTCNT_2                         (0x00200000UL)
#define USBHS_HCTSIZ0_PKTCNT_3                         (0x00400000UL)
#define USBHS_HCTSIZ0_PKTCNT_4                         (0x00800000UL)
#define USBHS_HCTSIZ0_PKTCNT_5                         (0x01000000UL)
#define USBHS_HCTSIZ0_PKTCNT_6                         (0x02000000UL)
#define USBHS_HCTSIZ0_PKTCNT_7                         (0x04000000UL)
#define USBHS_HCTSIZ0_PKTCNT_8                         (0x08000000UL)
#define USBHS_HCTSIZ0_PKTCNT_9                         (0x10000000UL)
#define USBHS_HCTSIZ0_PID_POS                          (29U)
#define USBHS_HCTSIZ0_PID                              (0x60000000UL)
#define USBHS_HCTSIZ0_PID_0                            (0x20000000UL)
#define USBHS_HCTSIZ0_PID_1                            (0x40000000UL)
#define USBHS_HCTSIZ0_DOPNG_POS                        (31U)
#define USBHS_HCTSIZ0_DOPNG                            (0x80000000UL)

/*  Bit definition for USBHS_HCDMA0 register  */
#define USBHS_HCDMA0                                   (0xFFFFFFFFUL)

