levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_HCINTMSK1 register  */
#define USBHS_HCINTMSK1_XFERCOMPLMSK_POS               (0U)
#define USBHS_HCINTMSK1_XFERCOMPLMSK                   (0x00000001UL)
#define USBHS_HCINTMSK1_CHHLTDMSK_POS                  (1U)
#define USBHS_HCINTMSK1_CHHLTDMSK                      (0x00000002UL)
#define USBHS_HCINTMSK1_AHBERRMSK_POS                  (2U)
#define USBHS_HCINTMSK1_AHBERRMSK                      (0x00000004UL)
#define USBHS_HCINTMSK1_STALLMSK_POS                   (3U)
#define USBHS_HCINTMSK1_STALLMSK                       (0x00000008UL)
#define USBHS_HCINTMSK1_NAKMSK_POS                     (4U)
#define USBHS_HCINTMSK1_NAKMSK                         (0x00000010UL)
#define USBHS_HCINTMSK1_ACKMSK_POS                     (5U)
#define USBHS_HCINTMSK1_ACKMSK                         (0x00000020UL)
#define USBHS_HCINTMSK1_NYETMSK_POS                    (6U)
#define USBHS_HCINTMSK1_NYETMSK                        (0x00000040UL)
#define USBHS_HCINTMSK1_XACTERRMSK_POS                 (7U)
#define USBHS_HCINTMSK1_XACTERRMSK                     (0x00000080UL)
#define USBHS_HCINTMSK1_BBLERRMSK_POS                  (8U)
#define USBHS_HCINTMSK1_BBLERRMSK                      (0x00000100UL)
#define USBHS_HCINTMSK1_FRMOVRUNMSK_POS                (9U)
#define USBHS_HCINTMSK1_FRMOVRUNMSK                    (0x00000200UL)
#define USBHS_HCINTMSK1_DATATGLERRMSK_POS              (10U)
#define USBHS_HCINTMSK1_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBHS_HCTSIZ1 register  */
#define USBHS_HCTSIZ1_XFERSIZE_POS                     (0U)
#define USBHS_HCTSIZ1_XFERSIZE                         (0x0007FFFFUL)
#define USBHS_HCTSIZ1_XFERSIZE_0                       (0x00000001UL)
#define USBHS_HCTSIZ1_XFERSIZE_1                       (0x00000002UL)
#define USBHS_HCTSIZ1_XFERSIZE_2                       (0x00000004UL)
#define USBHS_HCTSIZ1_XFERSIZE_3                       (0x00000008UL)
#define USBHS_HCTSIZ1_XFERSIZE_4                       (0x00000010UL)
#define USBHS_HCTSIZ1_XFERSIZE_5                       (0x00000020UL)
#define USBHS_HCTSIZ1_XFERSIZE_6                       (0x00000040UL)
#define USBHS_HCTSIZ1_XFERSIZE_7                       (0x00000080UL)
#define USBHS_HCTSIZ1_XFERSIZE_8                       (0x00000100UL)
#define USBHS_HCTSIZ1_XFERSIZE_9                       (0x00000200UL)
#define USBHS_HCTSIZ1_XFERSIZE_10                      (0x00000400UL)
#define USBHS_HCTSIZ1_XFERSIZE_11                      (0x00000800UL)
#define USBHS_HCTSIZ1_XFERSIZE_12                      (0x00001000UL)
#define USBHS_HCTSIZ1_XFERSIZE_13                      (0x00002000UL)
#define USBHS_HCTSIZ1_XFERSIZE_14                      (0x00004000UL)
#define USBHS_HCTSIZ1_XFERSIZE_15                      (0x00008000UL)
#define USBHS_HCTSIZ1_XFERSIZE_16                      (0x00010000UL)
#define USBHS_HCTSIZ1_XFERSIZE_17                      (0x00020000UL)
#define USBHS_HCTSIZ1_XFERSIZE_18                      (0x00040000UL)
#define USBHS_HCTSIZ1_PKTCNT_POS                       (19U)
#define USBHS_HCTSIZ1_PKTCNT                           (0x1FF80000UL)
#define USBHS_HCTSIZ1_PKTCNT_0                         (0x00080000UL)
#define USBHS_HCTSIZ1_PKTCNT_1                         (0x00100000UL)
#define USBHS_HCTSIZ1_PKTCNT_2                         (0x00200000UL)
#define USBHS_HCTSIZ1_PKTCNT_3                         (0x00400000UL)
#define USBHS_HCTSIZ1_PKTCNT_4                         (0x00800000UL)
#define USBHS_HCTSIZ1_PKTCNT_5                         (0x01000000UL)
#define USBHS_HCTSIZ1_PKTCNT_6                         (0x02000000UL)
#define USBHS_HCTSIZ1_PKTCNT_7                         (0x04000000UL)
#define USBHS_HCTSIZ1_PKTCNT_8                         (0x08000000UL)
#define USBHS_HCTSIZ1_PKTCNT_9                         (0x10000000UL)
#define USBHS_HCTSIZ1_PID_POS                          (29U)
#define USBHS_HCTSIZ1_PID                              (0x60000000UL)
#define USBHS_HCTSIZ1_PID_0                            (0x20000000UL)
#define USBHS_HCTSIZ1_PID_1                            (0x40000000UL)
#define USBHS_HCTSIZ1_DOPNG_POS                        (31U)
#define USBHS_HCTSIZ1_DOPNG                            (0x80000000UL)

/*  Bit definition for USBHS_HCDMA1 register  */
#define USBHS_HCDMA1                                   (0xFFFFFFFFUL)

/*  Bit definition for USBHS_HCCHAR2 register  */
#define USBHS_HCCHAR2_MPS_POS                          (0U)
#define USBHS_HCCHAR2_MPS                              (0x000007FFUL)
#define USBHS_HCCHAR2_MPS_0                            (0x00000001UL)
#define USBHS_HCCHAR2_MPS_1                            (0x00000002UL)
#define USBHS_HCCHAR2_MPS_2                            (0x00000004UL)
#define USBHS_HCCHAR2_MPS_3                            (0x00000008UL)
#define USBHS_HCCHAR2_MPS_4                            (0x00000010UL)
#define USBHS_HCCHAR2_MPS_5                            (0x00000020UL)
#define USBHS_HCCHAR2_MPS_6                            (0x00000040UL)
#define USBHS_HCCHAR2_MPS_7                            (0x00000080UL)
#define USBHS_HCCHAR2_MPS_8                            (0x00000100UL)
#define USBHS_HCCHAR2_MPS_9                            (0x00000200UL)
#define USBHS_HCCHAR2_MPS_10                           (0x00000400UL)
#define USBHS_HCCHAR2_EPNUM_POS                        (11U)
#define USBHS_HCCHAR2_EPNUM                            (0x00007800UL)
#define USBHS_HCCHAR2_EPNUM_0                          (0x00000800UL)
#define USBHS_HCCHAR2_EPNUM_1                          (0x00001000UL)
#define USBHS_HCCHAR2_EPNUM_2                          (0x00002000UL)
#define USBHS_HCCHAR2_EPNUM_3                          (0x00004000UL)
#define USBHS_HCCHAR2_EPDIR_POS                        (15U)
#define USBHS_HCCHAR2_EPDIR                            (0x00008000UL)
#define USBHS_HCCHAR2_LSPDDEV_POS                      (17U)
#define USBHS_HCCHAR2_LSPDDEV                          (0x00020000UL)
#define USBHS_HCCHAR2_EPTYPE_POS                       (18U)
#define USBHS_HCCHAR2_EPTYPE                           (0x000C0000UL)
#define USBHS_HCCHAR2_EPTYPE_0                         (0x00040000UL)
#define USBHS_HCCHAR2_EPTYPE_1                         (0x00080000UL)
#define USBHS_HCCHAR2_EC_POS                           (20U)
#define USBHS_HCCHAR2_EC                               (0x00300000UL)
#define USBHS_HCCHAR2_EC_0                             (0x00100000UL)
#define USBHS_HCCHAR2_EC_1                             (0x00200000UL)
#define USBHS_HCCHAR2_DEVADDR_POS                      (22U)
#define USBHS_HCCHAR2_DEVADDR                          (0x1FC00000UL)
#define USBHS_HCCHAR2_DEVADDR_0                        (0x00400000UL)
#define USBHS_HCCHAR2_DEVADDR_1                        (0x00800000UL)
#define USBHS_HCCHAR2_DEVADDR_2                        (0x01000000UL)
#define USBHS_HCCHAR2_DEVADDR_3                        (0x02000000UL)
#define USBHS_HCCHAR2_DEVADDR_4                        (0x04000000UL)
#define USBHS_HCCHAR2_DEVADDR_5                        (0x08000000UL)
#define USBHS_HCCHAR2_DEVADDR_6                        (0x10000000UL)
#define USBHS_HCCHAR2_ODDFRM_POS                       (29U)
#define USBHS_HCCHAR2_ODDFRM                           (0x20000000UL)
#define USBHS_HCCHAR2_CHDIS_POS                        (30U)
#define USBHS_HCCHAR2_CHDIS                            (0x40000000UL)
#define USBHS_HCCHAR2_CHENA_POS                        (31U)
#define USBHS_HCCHAR2_CHENA                            (0x80000000UL)

