levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_HCSPLT2 register  */
#define USBHS_HCSPLT2_PRTADDR_POS                      (0U)
#define USBHS_HCSPLT2_PRTADDR                          (0x0000007FUL)
#define USBHS_HCSPLT2_PRTADDR_0                        (0x00000001UL)
#define USBHS_HCSPLT2_PRTADDR_1                        (0x00000002UL)
#define USBHS_HCSPLT2_PRTADDR_2                        (0x00000004UL)
#define USBHS_HCSPLT2_PRTADDR_3                        (0x00000008UL)
#define USBHS_HCSPLT2_PRTADDR_4                        (0x00000010UL)
#define USBHS_HCSPLT2_PRTADDR_5                        (0x00000020UL)
#define USBHS_HCSPLT2_PRTADDR_6                        (0x00000040UL)
#define USBHS_HCSPLT2_HUBADDR_POS                      (7U)
#define USBHS_HCSPLT2_HUBADDR                          (0x00003F80UL)
#define USBHS_HCSPLT2_HUBADDR_0                        (0x00000080UL)
#define USBHS_HCSPLT2_HUBADDR_1                        (0x00000100UL)
#define USBHS_HCSPLT2_HUBADDR_2                        (0x00000200UL)
#define USBHS_HCSPLT2_HUBADDR_3                        (0x00000400UL)
#define USBHS_HCSPLT2_HUBADDR_4                        (0x00000800UL)
#define USBHS_HCSPLT2_HUBADDR_5                        (0x00001000UL)
#define USBHS_HCSPLT2_HUBADDR_6                        (0x00002000UL)
#define USBHS_HCSPLT2_XACTPOS_POS                      (14U)
#define USBHS_HCSPLT2_XACTPOS                          (0x0000C000UL)
#define USBHS_HCSPLT2_XACTPOS_0                        (0x00004000UL)
#define USBHS_HCSPLT2_XACTPOS_1                        (0x00008000UL)
#define USBHS_HCSPLT2_COMPSPLT_POS                     (16U)
#define USBHS_HCSPLT2_COMPSPLT                         (0x00010000UL)
#define USBHS_HCSPLT2_SPLTENA_POS                      (31U)
#define USBHS_HCSPLT2_SPLTENA                          (0x80000000UL)

/*  Bit definition for USBHS_HCINT2 register  */
#define USBHS_HCINT2_XFERCOMPL_POS                     (0U)
#define USBHS_HCINT2_XFERCOMPL                         (0x00000001UL)
#define USBHS_HCINT2_CHHLTD_POS                        (1U)
#define USBHS_HCINT2_CHHLTD                            (0x00000002UL)
#define USBHS_HCINT2_AHBERR_POS                        (2U)
#define USBHS_HCINT2_AHBERR                            (0x00000004UL)
#define USBHS_HCINT2_STALL_POS                         (3U)
#define USBHS_HCINT2_STALL                             (0x00000008UL)
#define USBHS_HCINT2_NAK_POS                           (4U)
#define USBHS_HCINT2_NAK                               (0x00000010UL)
#define USBHS_HCINT2_ACK_POS                           (5U)
#define USBHS_HCINT2_ACK                               (0x00000020UL)
#define USBHS_HCINT2_NYET_POS                          (6U)
#define USBHS_HCINT2_NYET                              (0x00000040UL)
#define USBHS_HCINT2_XACTERR_POS                       (7U)
#define USBHS_HCINT2_XACTERR                           (0x00000080UL)
#define USBHS_HCINT2_BBLERR_POS                        (8U)
#define USBHS_HCINT2_BBLERR                            (0x00000100UL)
#define USBHS_HCINT2_FRMOVRUN_POS                      (9U)
#define USBHS_HCINT2_FRMOVRUN                          (0x00000200UL)
#define USBHS_HCINT2_DATATGLERR_POS                    (10U)
#define USBHS_HCINT2_DATATGLERR                        (0x00000400UL)

/*  Bit definition for USBHS_HCINTMSK2 register  */
#define USBHS_HCINTMSK2_XFERCOMPLMSK_POS               (0U)
#define USBHS_HCINTMSK2_XFERCOMPLMSK                   (0x00000001UL)
#define USBHS_HCINTMSK2_CHHLTDMSK_POS                  (1U)
#define USBHS_HCINTMSK2_CHHLTDMSK                      (0x00000002UL)
#define USBHS_HCINTMSK2_AHBERRMSK_POS                  (2U)
#define USBHS_HCINTMSK2_AHBERRMSK                      (0x00000004UL)
#define USBHS_HCINTMSK2_STALLMSK_POS                   (3U)
#define USBHS_HCINTMSK2_STALLMSK                       (0x00000008UL)
#define USBHS_HCINTMSK2_NAKMSK_POS                     (4U)
#define USBHS_HCINTMSK2_NAKMSK                         (0x00000010UL)
#define USBHS_HCINTMSK2_ACKMSK_POS                     (5U)
#define USBHS_HCINTMSK2_ACKMSK                         (0x00000020UL)
#define USBHS_HCINTMSK2_NYETMSK_POS                    (6U)
#define USBHS_HCINTMSK2_NYETMSK                        (0x00000040UL)
#define USBHS_HCINTMSK2_XACTERRMSK_POS                 (7U)
#define USBHS_HCINTMSK2_XACTERRMSK                     (0x00000080UL)
#define USBHS_HCINTMSK2_BBLERRMSK_POS                  (8U)
#define USBHS_HCINTMSK2_BBLERRMSK                      (0x00000100UL)
#define USBHS_HCINTMSK2_FRMOVRUNMSK_POS                (9U)
#define USBHS_HCINTMSK2_FRMOVRUNMSK                    (0x00000200UL)
#define USBHS_HCINTMSK2_DATATGLERRMSK_POS              (10U)
#define USBHS_HCINTMSK2_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBHS_HCTSIZ2 register  */
#define USBHS_HCTSIZ2_XFERSIZE_POS                     (0U)
#define USBHS_HCTSIZ2_XFERSIZE                         (0x0007FFFFUL)
#define USBHS_HCTSIZ2_XFERSIZE_0                       (0x00000001UL)
#define USBHS_HCTSIZ2_XFERSIZE_1                       (0x00000002UL)
#define USBHS_HCTSIZ2_XFERSIZE_2                       (0x00000004UL)
#define USBHS_HCTSIZ2_XFERSIZE_3                       (0x00000008UL)
#define USBHS_HCTSIZ2_XFERSIZE_4                       (0x00000010UL)
#define USBHS_HCTSIZ2_XFERSIZE_5                       (0x00000020UL)
#define USBHS_HCTSIZ2_XFERSIZE_6                       (0x00000040UL)
#define USBHS_HCTSIZ2_XFERSIZE_7                       (0x00000080UL)
#define USBHS_HCTSIZ2_XFERSIZE_8                       (0x00000100UL)
#define USBHS_HCTSIZ2_XFERSIZE_9                       (0x00000200UL)
#define USBHS_HCTSIZ2_XFERSIZE_10                      (0x00000400UL)
#define USBHS_HCTSIZ2_XFERSIZE_11                      (0x00000800UL)
#define USBHS_HCTSIZ2_XFERSIZE_12                      (0x00001000UL)
#define USBHS_HCTSIZ2_XFERSIZE_13                      (0x00002000UL)
#define USBHS_HCTSIZ2_XFERSIZE_14                      (0x00004000UL)
#define USBHS_HCTSIZ2_XFERSIZE_15                      (0x00008000UL)
#define USBHS_HCTSIZ2_XFERSIZE_16                      (0x00010000UL)
#define USBHS_HCTSIZ2_XFERSIZE_17                      (0x00020000UL)
#define USBHS_HCTSIZ2_XFERSIZE_18                      (0x00040000UL)
#define USBHS_HCTSIZ2_PKTCNT_POS                       (19U)
#define USBHS_HCTSIZ2_PKTCNT                           (0x1FF80000UL)
#define USBHS_HCTSIZ2_PKTCNT_0                         (0x00080000UL)
#define USBHS_HCTSIZ2_PKTCNT_1                         (0x00100000UL)
#define USBHS_HCTSIZ2_PKTCNT_2                         (0x00200000UL)
#define USBHS_HCTSIZ2_PKTCNT_3                         (0x00400000UL)
#define USBHS_HCTSIZ2_PKTCNT_4                         (0x00800000UL)
#define USBHS_HCTSIZ2_PKTCNT_5                         (0x01000000UL)
#define USBHS_HCTSIZ2_PKTCNT_6                         (0x02000000UL)
#define USBHS_HCTSIZ2_PKTCNT_7                         (0x04000000UL)
#define USBHS_HCTSIZ2_PKTCNT_8                         (0x08000000UL)
#define USBHS_HCTSIZ2_PKTCNT_9                         (0x10000000UL)
#define USBHS_HCTSIZ2_PID_POS                          (29U)
#define USBHS_HCTSIZ2_PID                              (0x60000000UL)
#define USBHS_HCTSIZ2_PID_0                            (0x20000000UL)
#define USBHS_HCTSIZ2_PID_1                            (0x40000000UL)
#define USBHS_HCTSIZ2_DOPNG_POS                        (31U)
#define USBHS_HCTSIZ2_DOPNG                            (0x80000000UL)

/*  Bit definition for USBHS_HCDMA2 register  */
#define USBHS_HCDMA2                                   (0xFFFFFFFFUL)

/*  Bit definition for USBHS_HCCHAR3 register  */
#define USBHS_HCCHAR3_MPS_POS                          (0U)
#define USBHS_HCCHAR3_MPS                              (0x000007FFUL)
#define USBHS_HCCHAR3_MPS_0                            (0x00000001UL)
#define USBHS_HCCHAR3_MPS_1                            (0x00000002UL)
#define USBHS_HCCHAR3_MPS_2                            (0x00000004UL)
#define USBHS_HCCHAR3_MPS_3                            (0x00000008UL)
#define USBHS_HCCHAR3_MPS_4                            (0x00000010UL)
#define USBHS_HCCHAR3_MPS_5                            (0x00000020UL)
#define USBHS_HCCHAR3_MPS_6                            (0x00000040UL)
#define USBHS_HCCHAR3_MPS_7                            (0x00000080UL)
#define USBHS_HCCHAR3_MPS_8                            (0x00000100UL)
#define USBHS_HCCHAR3_MPS_9                            (0x00000200UL)
#define USBHS_HCCHAR3_MPS_10                           (0x00000400UL)
#define USBHS_HCCHAR3_EPNUM_POS                        (11U)
#define USBHS_HCCHAR3_EPNUM                            (0x00007800UL)
#define USBHS_HCCHAR3_EPNUM_0                          (0x00000800UL)
#define USBHS_HCCHAR3_EPNUM_1                          (0x00001000UL)
#define USBHS_HCCHAR3_EPNUM_2                          (0x00002000UL)
#define USBHS_HCCHAR3_EPNUM_3                          (0x00004000UL)
#define USBHS_HCCHAR3_EPDIR_POS                        (15U)
#define USBHS_HCCHAR3_EPDIR                            (0x00008000UL)
#define USBHS_HCCHAR3_LSPDDEV_POS                      (17U)
#define USBHS_HCCHAR3_LSPDDEV                          (0x00020000UL)
#define USBHS_HCCHAR3_EPTYPE_POS                       (18U)
#define USBHS_HCCHAR3_EPTYPE                           (0x000C0000UL)
#define USBHS_HCCHAR3_EPTYPE_0                         (0x00040000UL)
#define USBHS_HCCHAR3_EPTYPE_1                         (0x00080000UL)
#define USBHS_HCCHAR3_EC_POS                           (20U)
#define USBHS_HCCHAR3_EC                               (0x00300000UL)
#define USBHS_HCCHAR3_EC_0                             (0x00100000UL)
#define USBHS_HCCHAR3_EC_1                             (0x00200000UL)
#define USBHS_HCCHAR3_DEVADDR_POS                      (22U)
#define USBHS_HCCHAR3_DEVADDR                          (0x1FC00000UL)
#define USBHS_HCCHAR3_DEVADDR_0                        (0x00400000UL)
#define USBHS_HCCHAR3_DEVADDR_1                        (0x00800000UL)
#define USBHS_HCCHAR3_DEVADDR_2                        (0x01000000UL)
#define USBHS_HCCHAR3_DEVADDR_3                        (0x02000000UL)
#define USBHS_HCCHAR3_DEVADDR_4                        (0x04000000UL)
#define USBHS_HCCHAR3_DEVADDR_5                        (0x08000000UL)
#define USBHS_HCCHAR3_DEVADDR_6                        (0x10000000UL)
#define USBHS_HCCHAR3_ODDFRM_POS                       (29U)
#define USBHS_HCCHAR3_ODDFRM                           (0x20000000UL)
#define USBHS_HCCHAR3_CHDIS_POS                        (30U)
#define USBHS_HCCHAR3_CHDIS                            (0x40000000UL)
#define USBHS_HCCHAR3_CHENA_POS                        (31U)
#define USBHS_HCCHAR3_CHENA                            (0x80000000UL)

/*  Bit definition for USBHS_HCSPLT3 register  */
#define USBHS_HCSPLT3_PRTADDR_POS                      (0U)
#define USBHS_HCSPLT3_PRTADDR                          (0x0000007FUL)
#define USBHS_HCSPLT3_PRTADDR_0                        (0x00000001UL)
#define USBHS_HCSPLT3_PRTADDR_1                        (0x00000002UL)
#define USBHS_HCSPLT3_PRTADDR_2                        (0x00000004UL)
#define USBHS_HCSPLT3_PRTADDR_3                        (0x00000008UL)
#define USBHS_HCSPLT3_PRTADDR_4                        (0x00000010UL)
#define USBHS_HCSPLT3_PRTADDR_5                        (0x00000020UL)
#define USBHS_HCSPLT3_PRTADDR_6                        (0x00000040UL)
#define USBHS_HCSPLT3_HUBADDR_POS                      (7U)
#define USBHS_HCSPLT3_HUBADDR                          (0x00003F80UL)
#define USBHS_HCSPLT3_HUBADDR_0                        (0x00000080UL)
#define USBHS_HCSPLT3_HUBADDR_1                        (0x00000100UL)
#define USBHS_HCSPLT3_HUBADDR_2                        (0x00000200UL)
#define USBHS_HCSPLT3_HUBADDR_3                        (0x00000400UL)
#define USBHS_HCSPLT3_HUBADDR_4                        (0x00000800UL)
#define USBHS_HCSPLT3_HUBADDR_5                        (0x00001000UL)
#define USBHS_HCSPLT3_HUBADDR_6                        (0x00002000UL)
#define USBHS_HCSPLT3_XACTPOS_POS                      (14U)
#define USBHS_HCSPLT3_XACTPOS                          (0x0000C000UL)
#define USBHS_HCSPLT3_XACTPOS_0                        (0x00004000UL)
#define USBHS_HCSPLT3_XACTPOS_1                        (0x00008000UL)
#define USBHS_HCSPLT3_COMPSPLT_POS                     (16U)
#define USBHS_HCSPLT3_COMPSPLT                         (0x00010000UL)
#define USBHS_HCSPLT3_SPLTENA_POS                      (31U)
#define USBHS_HCSPLT3_SPLTENA                          (0x80000000UL)

/*  Bit definition for USBHS_HCINT3 register  */
#define USBHS_HCINT3_XFERCOMPL_POS                     (0U)
#define USBHS_HCINT3_XFERCOMPL                         (0x00000001UL)
#define USBHS_HCINT3_CHHLTD_POS                        (1U)
#define USBHS_HCINT3_CHHLTD                            (0x00000002UL)
#define USBHS_HCINT3_AHBERR_POS                        (2U)
#define USBHS_HCINT3_AHBERR                            (0x00000004UL)
#define USBHS_HCINT3_STALL_POS                         (3U)
#define USBHS_HCINT3_STALL                             (0x00000008UL)
#define USBHS_HCINT3_NAK_POS                           (4U)
#define USBHS_HCINT3_NAK                               (0x00000010UL)
#define USBHS_HCINT3_ACK_POS                           (5U)
#define USBHS_HCINT3_ACK                               (0x00000020UL)
#define USBHS_HCINT3_NYET_POS                          (6U)
#define USBHS_HCINT3_NYET                              (0x00000040UL)
#define USBHS_HCINT3_XACTERR_POS                       (7U)
#define USBHS_HCINT3_XACTERR                           (0x00000080UL)
#define USBHS_HCINT3_BBLERR_POS                        (8U)
#define USBHS_HCINT3_BBLERR                            (0x00000100UL)
#define USBHS_HCINT3_FRMOVRUN_POS                      (9U)
#define USBHS_HCINT3_FRMOVRUN                          (0x00000200UL)
#define USBHS_HCINT3_DATATGLERR_POS                    (10U)
#define USBHS_HCINT3_DATATGLERR                        (0x00000400UL)

/*  Bit definition for USBHS_HCINTMSK3 register  */
#define USBHS_HCINTMSK3_XFERCOMPLMSK_POS               (0U)
#define USBHS_HCINTMSK3_XFERCOMPLMSK                   (0x00000001UL)
#define USBHS_HCINTMSK3_CHHLTDMSK_POS                  (1U)
#define USBHS_HCINTMSK3_CHHLTDMSK                      (0x00000002UL)
#define USBHS_HCINTMSK3_AHBERRMSK_POS                  (2U)
#define USBHS_HCINTMSK3_AHBERRMSK                      (0x00000004UL)
#define USBHS_HCINTMSK3_STALLMSK_POS                   (3U)
#define USBHS_HCINTMSK3_STALLMSK                       (0x00000008UL)
#define USBHS_HCINTMSK3_NAKMSK_POS                     (4U)
#define USBHS_HCINTMSK3_NAKMSK                         (0x00000010UL)
#define USBHS_HCINTMSK3_ACKMSK_POS                     (5U)
#define USBHS_HCINTMSK3_ACKMSK                         (0x00000020UL)
#define USBHS_HCINTMSK3_NYETMSK_POS                    (6U)
#define USBHS_HCINTMSK3_NYETMSK                        (0x00000040UL)
#define USBHS_HCINTMSK3_XACTERRMSK_POS                 (7U)
#define USBHS_HCINTMSK3_XACTERRMSK                     (0x00000080UL)
#define USBHS_HCINTMSK3_BBLERRMSK_POS                  (8U)
#define USBHS_HCINTMSK3_BBLERRMSK                      (0x00000100UL)
#define USBHS_HCINTMSK3_FRMOVRUNMSK_POS                (9U)
#define USBHS_HCINTMSK3_FRMOVRUNMSK                    (0x00000200UL)
#define USBHS_HCINTMSK3_DATATGLERRMSK_POS              (10U)
#define USBHS_HCINTMSK3_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBHS_HCTSIZ3 register  */
#define USBHS_HCTSIZ3_XFERSIZE_POS                     (0U)
#define USBHS_HCTSIZ3_XFERSIZE                         (0x0007FFFFUL)
#define USBHS_HCTSIZ3_XFERSIZE_0                       (0x00000001UL)
#define USBHS_HCTSIZ3_XFERSIZE_1                       (0x00000002UL)
#define USBHS_HCTSIZ3_XFERSIZE_2                       (0x00000004UL)
#define USBHS_HCTSIZ3_XFERSIZE_3                       (0x00000008UL)
#define USBHS_HCTSIZ3_XFERSIZE_4                       (0x00000010UL)
#define USBHS_HCTSIZ3_XFERSIZE_5                       (0x00000020UL)
#define USBHS_HCTSIZ3_XFERSIZE_6                       (0x00000040UL)
#define USBHS_HCTSIZ3_XFERSIZE_7                       (0x00000080UL)
#define USBHS_HCTSIZ3_XFERSIZE_8                       (0x00000100UL)
#define USBHS_HCTSIZ3_XFERSIZE_9                       (0x00000200UL)
#define USBHS_HCTSIZ3_XFERSIZE_10                      (0x00000400UL)
#define USBHS_HCTSIZ3_XFERSIZE_11                      (0x00000800UL)
#define USBHS_HCTSIZ3_XFERSIZE_12                      (0x00001000UL)
#define USBHS_HCTSIZ3_XFERSIZE_13                      (0x00002000UL)
#define USBHS_HCTSIZ3_XFERSIZE_14                      (0x00004000UL)
#define USBHS_HCTSIZ3_XFERSIZE_15                      (0x00008000UL)
#define USBHS_HCTSIZ3_XFERSIZE_16                      (0x00010000UL)
#define USBHS_HCTSIZ3_XFERSIZE_17                      (0x00020000UL)
#define USBHS_HCTSIZ3_XFERSIZE_18                      (0x00040000UL)
#define USBHS_HCTSIZ3_PKTCNT_POS                       (19U)
#define USBHS_HCTSIZ3_PKTCNT                           (0x1FF80000UL)
#define USBHS_HCTSIZ3_PKTCNT_0                         (0x00080000UL)
#define USBHS_HCTSIZ3_PKTCNT_1                         (0x00100000UL)
#define USBHS_HCTSIZ3_PKTCNT_2                         (0x00200000UL)
#define USBHS_HCTSIZ3_PKTCNT_3                         (0x00400000UL)
#define USBHS_HCTSIZ3_PKTCNT_4                         (0x00800000UL)
#define USBHS_HCTSIZ3_PKTCNT_5                         (0x01000000UL)
#define USBHS_HCTSIZ3_PKTCNT_6                         (0x02000000UL)
#define USBHS_HCTSIZ3_PKTCNT_7                         (0x04000000UL)
#define USBHS_HCTSIZ3_PKTCNT_8                         (0x08000000UL)
#define USBHS_HCTSIZ3_PKTCNT_9                         (0x10000000UL)
#define USBHS_HCTSIZ3_PID_POS                          (29U)
#define USBHS_HCTSIZ3_PID                              (0x60000000UL)
#define USBHS_HCTSIZ3_PID_0                            (0x20000000UL)
#define USBHS_HCTSIZ3_PID_1                            (0x40000000UL)
#define USBHS_HCTSIZ3_DOPNG_POS                        (31U)
#define USBHS_HCTSIZ3_DOPNG                            (0x80000000UL)

/*  Bit definition for USBHS_HCDMA3 register  */
#define USBHS_HCDMA3                                   (0xFFFFFFFFUL)

/*  Bit definition for USBHS_HCCHAR4 register  */
#define USBHS_HCCHAR4_MPS_POS                          (0U)
#define USBHS_HCCHAR4_MPS                              (0x000007FFUL)
#define USBHS_HCCHAR4_MPS_0                            (0x00000001UL)
#define USBHS_HCCHAR4_MPS_1                            (0x00000002UL)
#define USBHS_HCCHAR4_MPS_2                            (0x00000004UL)
#define USBHS_HCCHAR4_MPS_3                            (0x00000008UL)
#define USBHS_HCCHAR4_MPS_4                            (0x00000010UL)
#define USBHS_HCCHAR4_MPS_5                            (0x00000020UL)
#define USBHS_HCCHAR4_MPS_6                            (0x00000040UL)
#define USBHS_HCCHAR4_MPS_7                            (0x00000080UL)
#define USBHS_HCCHAR4_MPS_8                            (0x00000100UL)
#define USBHS_HCCHAR4_MPS_9                            (0x00000200UL)
#define USBHS_HCCHAR4_MPS_10                           (0x00000400UL)
#define USBHS_HCCHAR4_EPNUM_POS                        (11U)
#define USBHS_HCCHAR4_EPNUM                            (0x00007800UL)
#define USBHS_HCCHAR4_EPNUM_0                          (0x00000800UL)
#define USBHS_HCCHAR4_EPNUM_1                          (0x00001000UL)
#define USBHS_HCCHAR4_EPNUM_2                          (0x00002000UL)
#define USBHS_HCCHAR4_EPNUM_3                          (0x00004000UL)
#define USBHS_HCCHAR4_EPDIR_POS                        (15U)
#define USBHS_HCCHAR4_EPDIR                            (0x00008000UL)
#define USBHS_HCCHAR4_LSPDDEV_POS                      (17U)
#define USBHS_HCCHAR4_LSPDDEV                          (0x00020000UL)
#define USBHS_HCCHAR4_EPTYPE_POS                       (18U)
#define USBHS_HCCHAR4_EPTYPE                           (0x000C0000UL)
#define USBHS_HCCHAR4_EPTYPE_0                         (0x00040000UL)
#define USBHS_HCCHAR4_EPTYPE_1                         (0x00080000UL)
#define USBHS_HCCHAR4_EC_POS                           (20U)
#define USBHS_HCCHAR4_EC                               (0x00300000UL)
#define USBHS_HCCHAR4_EC_0                             (0x00100000UL)
#define USBHS_HCCHAR4_EC_1                             (0x00200000UL)
#define USBHS_HCCHAR4_DEVADDR_POS                      (22U)
#define USBHS_HCCHAR4_DEVADDR                          (0x1FC00000UL)
#define USBHS_HCCHAR4_DEVADDR_0                        (0x00400000UL)
#define USBHS_HCCHAR4_DEVADDR_1                        (0x00800000UL)
#define USBHS_HCCHAR4_DEVADDR_2                        (0x01000000UL)
#define USBHS_HCCHAR4_DEVADDR_3                        (0x02000000UL)
#define USBHS_HCCHAR4_DEVADDR_4                        (0x04000000UL)
#define USBHS_HCCHAR4_DEVADDR_5                        (0x08000000UL)
#define USBHS_HCCHAR4_DEVADDR_6                        (0x10000000UL)
#define USBHS_HCCHAR4_ODDFRM_POS                       (29U)
#define USBHS_HCCHAR4_ODDFRM                           (0x20000000UL)
#define USBHS_HCCHAR4_CHDIS_POS                        (30U)
#define USBHS_HCCHAR4_CHDIS                            (0x40000000UL)
#define USBHS_HCCHAR4_CHENA_POS                        (31U)
#define USBHS_HCCHAR4_CHENA                            (0x80000000UL)

/*  Bit definition for USBHS_HCSPLT4 register  */
#define USBHS_HCSPLT4_PRTADDR_POS                      (0U)
#define USBHS_HCSPLT4_PRTADDR                          (0x0000007FUL)
#define USBHS_HCSPLT4_PRTADDR_0                        (0x00000001UL)
#define USBHS_HCSPLT4_PRTADDR_1                        (0x00000002UL)
#define USBHS_HCSPLT4_PRTADDR_2                        (0x00000004UL)
#define USBHS_HCSPLT4_PRTADDR_3                        (0x00000008UL)
#define USBHS_HCSPLT4_PRTADDR_4                        (0x00000010UL)
#define USBHS_HCSPLT4_PRTADDR_5                        (0x00000020UL)
#define USBHS_HCSPLT4_PRTADDR_6                        (0x00000040UL)
#define USBHS_HCSPLT4_HUBADDR_POS                      (7U)
#define USBHS_HCSPLT4_HUBADDR                          (0x00003F80UL)
#define USBHS_HCSPLT4_HUBADDR_0                        (0x00000080UL)
#define USBHS_HCSPLT4_HUBADDR_1                        (0x00000100UL)
#define USBHS_HCSPLT4_HUBADDR_2                        (0x00000200UL)
#define USBHS_HCSPLT4_HUBADDR_3                        (0x00000400UL)
#define USBHS_HCSPLT4_HUBADDR_4                        (0x00000800UL)
#define USBHS_HCSPLT4_HUBADDR_5                        (0x00001000UL)
#define USBHS_HCSPLT4_HUBADDR_6                        (0x00002000UL)
#define USBHS_HCSPLT4_XACTPOS_POS                      (14U)
#define USBHS_HCSPLT4_XACTPOS                          (0x0000C000UL)
#define USBHS_HCSPLT4_XACTPOS_0                        (0x00004000UL)
#define USBHS_HCSPLT4_XACTPOS_1                        (0x00008000UL)
#define USBHS_HCSPLT4_COMPSPLT_POS                     (16U)
#define USBHS_HCSPLT4_COMPSPLT                         (0x00010000UL)
#define USBHS_HCSPLT4_SPLTENA_POS                      (31U)
#define USBHS_HCSPLT4_SPLTENA                          (0x80000000UL)

