levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_HCSPLT5 register  */
#define USBHS_HCSPLT5_PRTADDR_POS                      (0U)
#define USBHS_HCSPLT5_PRTADDR                          (0x0000007FUL)
#define USBHS_HCSPLT5_PRTADDR_0                        (0x00000001UL)
#define USBHS_HCSPLT5_PRTADDR_1                        (0x00000002UL)
#define USBHS_HCSPLT5_PRTADDR_2                        (0x00000004UL)
#define USBHS_HCSPLT5_PRTADDR_3                        (0x00000008UL)
#define USBHS_HCSPLT5_PRTADDR_4                        (0x00000010UL)
#define USBHS_HCSPLT5_PRTADDR_5                        (0x00000020UL)
#define USBHS_HCSPLT5_PRTADDR_6                        (0x00000040UL)
#define USBHS_HCSPLT5_HUBADDR_POS                      (7U)
#define USBHS_HCSPLT5_HUBADDR                          (0x00003F80UL)
#define USBHS_HCSPLT5_HUBADDR_0                        (0x00000080UL)
#define USBHS_HCSPLT5_HUBADDR_1                        (0x00000100UL)
#define USBHS_HCSPLT5_HUBADDR_2                        (0x00000200UL)
#define USBHS_HCSPLT5_HUBADDR_3                        (0x00000400UL)
#define USBHS_HCSPLT5_HUBADDR_4                        (0x00000800UL)
#define USBHS_HCSPLT5_HUBADDR_5                        (0x00001000UL)
#define USBHS_HCSPLT5_HUBADDR_6                        (0x00002000UL)
#define USBHS_HCSPLT5_XACTPOS_POS                      (14U)
#define USBHS_HCSPLT5_XACTPOS                          (0x0000C000UL)
#define USBHS_HCSPLT5_XACTPOS_0                        (0x00004000UL)
#define USBHS_HCSPLT5_XACTPOS_1                        (0x00008000UL)
#define USBHS_HCSPLT5_COMPSPLT_POS                     (16U)
#define USBHS_HCSPLT5_COMPSPLT                         (0x00010000UL)
#define USBHS_HCSPLT5_SPLTENA_POS                      (31U)
#define USBHS_HCSPLT5_SPLTENA                          (0x80000000UL)

/*  Bit definition for USBHS_HCINT5 register  */
#define USBHS_HCINT5_XFERCOMPL_POS                     (0U)
#define USBHS_HCINT5_XFERCOMPL                         (0x00000001UL)
#define USBHS_HCINT5_CHHLTD_POS                        (1U)
#define USBHS_HCINT5_CHHLTD                            (0x00000002UL)
#define USBHS_HCINT5_AHBERR_POS                        (2U)
#define USBHS_HCINT5_AHBERR                            (0x00000004UL)
#define USBHS_HCINT5_STALL_POS                         (3U)
#define USBHS_HCINT5_STALL                             (0x00000008UL)
#define USBHS_HCINT5_NAK_POS                           (4U)
#define USBHS_HCINT5_NAK                               (0x00000010UL)
#define USBHS_HCINT5_ACK_POS                           (5U)
#define USBHS_HCINT5_ACK                               (0x00000020UL)
#define USBHS_HCINT5_NYET_POS                          (6U)
#define USBHS_HCINT5_NYET                              (0x00000040UL)
#define USBHS_HCINT5_XACTERR_POS                       (7U)
#define USBHS_HCINT5_XACTERR                           (0x00000080UL)
#define USBHS_HCINT5_BBLERR_POS                        (8U)
#define USBHS_HCINT5_BBLERR                            (0x00000100UL)
#define USBHS_HCINT5_FRMOVRUN_POS                      (9U)
#define USBHS_HCINT5_FRMOVRUN                          (0x00000200UL)
#define USBHS_HCINT5_DATATGLERR_POS                    (10U)
#define USBHS_HCINT5_DATATGLERR                        (0x00000400UL)

/*  Bit definition for USBHS_HCINTMSK5 register  */
#define USBHS_HCINTMSK5_XFERCOMPLMSK_POS               (0U)
#define USBHS_HCINTMSK5_XFERCOMPLMSK                   (0x00000001UL)
#define USBHS_HCINTMSK5_CHHLTDMSK_POS                  (1U)
#define USBHS_HCINTMSK5_CHHLTDMSK                      (0x00000002UL)
#define USBHS_HCINTMSK5_AHBERRMSK_POS                  (2U)
#define USBHS_HCINTMSK5_AHBERRMSK                      (0x00000004UL)
#define USBHS_HCINTMSK5_STALLMSK_POS                   (3U)
#define USBHS_HCINTMSK5_STALLMSK                       (0x00000008UL)
#define USBHS_HCINTMSK5_NAKMSK_POS                     (4U)
#define USBHS_HCINTMSK5_NAKMSK                         (0x00000010UL)
#define USBHS_HCINTMSK5_ACKMSK_POS                     (5U)
#define USBHS_HCINTMSK5_ACKMSK                         (0x00000020UL)
#define USBHS_HCINTMSK5_NYETMSK_POS                    (6U)
#define USBHS_HCINTMSK5_NYETMSK                        (0x00000040UL)
#define USBHS_HCINTMSK5_XACTERRMSK_POS                 (7U)
#define USBHS_HCINTMSK5_XACTERRMSK                     (0x00000080UL)
#define USBHS_HCINTMSK5_BBLERRMSK_POS                  (8U)
#define USBHS_HCINTMSK5_BBLERRMSK                      (0x00000100UL)
#define USBHS_HCINTMSK5_FRMOVRUNMSK_POS                (9U)
#define USBHS_HCINTMSK5_FRMOVRUNMSK                    (0x00000200UL)
#define USBHS_HCINTMSK5_DATATGLERRMSK_POS              (10U)
#define USBHS_HCINTMSK5_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBHS_HCTSIZ5 register  */
#define USBHS_HCTSIZ5_XFERSIZE_POS                     (0U)
#define USBHS_HCTSIZ5_XFERSIZE                         (0x0007FFFFUL)
#define USBHS_HCTSIZ5_XFERSIZE_0                       (0x00000001UL)
#define USBHS_HCTSIZ5_XFERSIZE_1                       (0x00000002UL)
#define USBHS_HCTSIZ5_XFERSIZE_2                       (0x00000004UL)
#define USBHS_HCTSIZ5_XFERSIZE_3                       (0x00000008UL)
#define USBHS_HCTSIZ5_XFERSIZE_4                       (0x00000010UL)
#define USBHS_HCTSIZ5_XFERSIZE_5                       (0x00000020UL)
#define USBHS_HCTSIZ5_XFERSIZE_6                       (0x00000040UL)
#define USBHS_HCTSIZ5_XFERSIZE_7                       (0x00000080UL)
#define USBHS_HCTSIZ5_XFERSIZE_8                       (0x00000100UL)
#define USBHS_HCTSIZ5_XFERSIZE_9                       (0x00000200UL)
#define USBHS_HCTSIZ5_XFERSIZE_10                      (0x00000400UL)
#define USBHS_HCTSIZ5_XFERSIZE_11                      (0x00000800UL)
#define USBHS_HCTSIZ5_XFERSIZE_12                      (0x00001000UL)
#define USBHS_HCTSIZ5_XFERSIZE_13                      (0x00002000UL)
#define USBHS_HCTSIZ5_XFERSIZE_14                      (0x00004000UL)
#define USBHS_HCTSIZ5_XFERSIZE_15                      (0x00008000UL)
#define USBHS_HCTSIZ5_XFERSIZE_16                      (0x00010000UL)
#define USBHS_HCTSIZ5_XFERSIZE_17                      (0x00020000UL)
#define USBHS_HCTSIZ5_XFERSIZE_18                      (0x00040000UL)
#define USBHS_HCTSIZ5_PKTCNT_POS                       (19U)
#define USBHS_HCTSIZ5_PKTCNT                           (0x1FF80000UL)
#define USBHS_HCTSIZ5_PKTCNT_0                         (0x00080000UL)
#define USBHS_HCTSIZ5_PKTCNT_1                         (0x00100000UL)
#define USBHS_HCTSIZ5_PKTCNT_2                         (0x00200000UL)
#define USBHS_HCTSIZ5_PKTCNT_3                         (0x00400000UL)
#define USBHS_HCTSIZ5_PKTCNT_4                         (0x00800000UL)
#define USBHS_HCTSIZ5_PKTCNT_5                         (0x01000000UL)
#define USBHS_HCTSIZ5_PKTCNT_6                         (0x02000000UL)
#define USBHS_HCTSIZ5_PKTCNT_7                         (0x04000000UL)
#define USBHS_HCTSIZ5_PKTCNT_8                         (0x08000000UL)
#define USBHS_HCTSIZ5_PKTCNT_9                         (0x10000000UL)
#define USBHS_HCTSIZ5_PID_POS                          (29U)
#define USBHS_HCTSIZ5_PID                              (0x60000000UL)
#define USBHS_HCTSIZ5_PID_0                            (0x20000000UL)
#define USBHS_HCTSIZ5_PID_1                            (0x40000000UL)
#define USBHS_HCTSIZ5_DOPNG_POS                        (31U)
#define USBHS_HCTSIZ5_DOPNG                            (0x80000000UL)

/*  Bit definition for USBHS_HCDMA5 register  */
#define USBHS_HCDMA5                                   (0xFFFFFFFFUL)

/*  Bit definition for USBHS_HCCHAR6 register  */
#define USBHS_HCCHAR6_MPS_POS                          (0U)
#define USBHS_HCCHAR6_MPS                              (0x000007FFUL)
#define USBHS_HCCHAR6_MPS_0                            (0x00000001UL)
#define USBHS_HCCHAR6_MPS_1                            (0x00000002UL)
#define USBHS_HCCHAR6_MPS_2                            (0x00000004UL)
#define USBHS_HCCHAR6_MPS_3                            (0x00000008UL)
#define USBHS_HCCHAR6_MPS_4                            (0x00000010UL)
#define USBHS_HCCHAR6_MPS_5                            (0x00000020UL)
#define USBHS_HCCHAR6_MPS_6                            (0x00000040UL)
#define USBHS_HCCHAR6_MPS_7                            (0x00000080UL)
#define USBHS_HCCHAR6_MPS_8                            (0x00000100UL)
#define USBHS_HCCHAR6_MPS_9                            (0x00000200UL)
#define USBHS_HCCHAR6_MPS_10                           (0x00000400UL)
#define USBHS_HCCHAR6_EPNUM_POS                        (11U)
#define USBHS_HCCHAR6_EPNUM                            (0x00007800UL)
#define USBHS_HCCHAR6_EPNUM_0                          (0x00000800UL)
#define USBHS_HCCHAR6_EPNUM_1                          (0x00001000UL)
#define USBHS_HCCHAR6_EPNUM_2                          (0x00002000UL)
#define USBHS_HCCHAR6_EPNUM_3                          (0x00004000UL)
#define USBHS_HCCHAR6_EPDIR_POS                        (15U)
#define USBHS_HCCHAR6_EPDIR                            (0x00008000UL)
#define USBHS_HCCHAR6_LSPDDEV_POS                      (17U)
#define USBHS_HCCHAR6_LSPDDEV                          (0x00020000UL)
#define USBHS_HCCHAR6_EPTYPE_POS                       (18U)
#define USBHS_HCCHAR6_EPTYPE                           (0x000C0000UL)
#define USBHS_HCCHAR6_EPTYPE_0                         (0x00040000UL)
#define USBHS_HCCHAR6_EPTYPE_1                         (0x00080000UL)
#define USBHS_HCCHAR6_EC_POS                           (20U)
#define USBHS_HCCHAR6_EC                               (0x00300000UL)
#define USBHS_HCCHAR6_EC_0                             (0x00100000UL)
#define USBHS_HCCHAR6_EC_1                             (0x00200000UL)
#define USBHS_HCCHAR6_DEVADDR_POS                      (22U)
#define USBHS_HCCHAR6_DEVADDR                          (0x1FC00000UL)
#define USBHS_HCCHAR6_DEVADDR_0                        (0x00400000UL)
#define USBHS_HCCHAR6_DEVADDR_1                        (0x00800000UL)
#define USBHS_HCCHAR6_DEVADDR_2                        (0x01000000UL)
#define USBHS_HCCHAR6_DEVADDR_3                        (0x02000000UL)
#define USBHS_HCCHAR6_DEVADDR_4                        (0x04000000UL)
#define USBHS_HCCHAR6_DEVADDR_5                        (0x08000000UL)
#define USBHS_HCCHAR6_DEVADDR_6                        (0x10000000UL)
#define USBHS_HCCHAR6_ODDFRM_POS                       (29U)
#define USBHS_HCCHAR6_ODDFRM                           (0x20000000UL)
#define USBHS_HCCHAR6_CHDIS_POS                        (30U)
#define USBHS_HCCHAR6_CHDIS                            (0x40000000UL)
#define USBHS_HCCHAR6_CHENA_POS                        (31U)
#define USBHS_HCCHAR6_CHENA                            (0x80000000UL)

/*  Bit definition for USBHS_HCSPLT6 register  */
#define USBHS_HCSPLT6_PRTADDR_POS                      (0U)
#define USBHS_HCSPLT6_PRTADDR                          (0x0000007FUL)
#define USBHS_HCSPLT6_PRTADDR_0                        (0x00000001UL)
#define USBHS_HCSPLT6_PRTADDR_1                        (0x00000002UL)
#define USBHS_HCSPLT6_PRTADDR_2                        (0x00000004UL)
#define USBHS_HCSPLT6_PRTADDR_3                        (0x00000008UL)
#define USBHS_HCSPLT6_PRTADDR_4                        (0x00000010UL)
#define USBHS_HCSPLT6_PRTADDR_5                        (0x00000020UL)
#define USBHS_HCSPLT6_PRTADDR_6                        (0x00000040UL)
#define USBHS_HCSPLT6_HUBADDR_POS                      (7U)
#define USBHS_HCSPLT6_HUBADDR                          (0x00003F80UL)
#define USBHS_HCSPLT6_HUBADDR_0                        (0x00000080UL)
#define USBHS_HCSPLT6_HUBADDR_1                        (0x00000100UL)
#define USBHS_HCSPLT6_HUBADDR_2                        (0x00000200UL)
#define USBHS_HCSPLT6_HUBADDR_3                        (0x00000400UL)
#define USBHS_HCSPLT6_HUBADDR_4                        (0x00000800UL)
#define USBHS_HCSPLT6_HUBADDR_5                        (0x00001000UL)
#define USBHS_HCSPLT6_HUBADDR_6                        (0x00002000UL)
#define USBHS_HCSPLT6_XACTPOS_POS                      (14U)
#define USBHS_HCSPLT6_XACTPOS                          (0x0000C000UL)
#define USBHS_HCSPLT6_XACTPOS_0                        (0x00004000UL)
#define USBHS_HCSPLT6_XACTPOS_1                        (0x00008000UL)
#define USBHS_HCSPLT6_COMPSPLT_POS                     (16U)
#define USBHS_HCSPLT6_COMPSPLT                         (0x00010000UL)
#define USBHS_HCSPLT6_SPLTENA_POS                      (31U)
#define USBHS_HCSPLT6_SPLTENA                          (0x80000000UL)

