levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_HCINT6 register  */
#define USBHS_HCINT6_XFERCOMPL_POS                     (0U)
#define USBHS_HCINT6_XFERCOMPL                         (0x00000001UL)
#define USBHS_HCINT6_CHHLTD_POS                        (1U)
#define USBHS_HCINT6_CHHLTD                            (0x00000002UL)
#define USBHS_HCINT6_AHBERR_POS                        (2U)
#define USBHS_HCINT6_AHBERR                            (0x00000004UL)
#define USBHS_HCINT6_STALL_POS                         (3U)
#define USBHS_HCINT6_STALL                             (0x00000008UL)
#define USBHS_HCINT6_NAK_POS                           (4U)
#define USBHS_HCINT6_NAK                               (0x00000010UL)
#define USBHS_HCINT6_ACK_POS                           (5U)
#define USBHS_HCINT6_ACK                               (0x00000020UL)
#define USBHS_HCINT6_NYET_POS                          (6U)
#define USBHS_HCINT6_NYET                              (0x00000040UL)
#define USBHS_HCINT6_XACTERR_POS                       (7U)
#define USBHS_HCINT6_XACTERR                           (0x00000080UL)
#define USBHS_HCINT6_BBLERR_POS                        (8U)
#define USBHS_HCINT6_BBLERR                            (0x00000100UL)
#define USBHS_HCINT6_FRMOVRUN_POS                      (9U)
#define USBHS_HCINT6_FRMOVRUN                          (0x00000200UL)
#define USBHS_HCINT6_DATATGLERR_POS                    (10U)
#define USBHS_HCINT6_DATATGLERR                        (0x00000400UL)

/*  Bit definition for USBHS_HCINTMSK6 register  */
#define USBHS_HCINTMSK6_XFERCOMPLMSK_POS               (0U)
#define USBHS_HCINTMSK6_XFERCOMPLMSK                   (0x00000001UL)
#define USBHS_HCINTMSK6_CHHLTDMSK_POS                  (1U)
#define USBHS_HCINTMSK6_CHHLTDMSK                      (0x00000002UL)
#define USBHS_HCINTMSK6_AHBERRMSK_POS                  (2U)
#define USBHS_HCINTMSK6_AHBERRMSK                      (0x00000004UL)
#define USBHS_HCINTMSK6_STALLMSK_POS                   (3U)
#define USBHS_HCINTMSK6_STALLMSK                       (0x00000008UL)
#define USBHS_HCINTMSK6_NAKMSK_POS                     (4U)
#define USBHS_HCINTMSK6_NAKMSK                         (0x00000010UL)
#define USBHS_HCINTMSK6_ACKMSK_POS                     (5U)
#define USBHS_HCINTMSK6_ACKMSK                         (0x00000020UL)
#define USBHS_HCINTMSK6_NYETMSK_POS                    (6U)
#define USBHS_HCINTMSK6_NYETMSK                        (0x00000040UL)
#define USBHS_HCINTMSK6_XACTERRMSK_POS                 (7U)
#define USBHS_HCINTMSK6_XACTERRMSK                     (0x00000080UL)
#define USBHS_HCINTMSK6_BBLERRMSK_POS                  (8U)
#define USBHS_HCINTMSK6_BBLERRMSK                      (0x00000100UL)
#define USBHS_HCINTMSK6_FRMOVRUNMSK_POS                (9U)
#define USBHS_HCINTMSK6_FRMOVRUNMSK                    (0x00000200UL)
#define USBHS_HCINTMSK6_DATATGLERRMSK_POS              (10U)
#define USBHS_HCINTMSK6_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBHS_HCTSIZ6 register  */
#define USBHS_HCTSIZ6_XFERSIZE_POS                     (0U)
#define USBHS_HCTSIZ6_XFERSIZE                         (0x0007FFFFUL)
#define USBHS_HCTSIZ6_XFERSIZE_0                       (0x00000001UL)
#define USBHS_HCTSIZ6_XFERSIZE_1                       (0x00000002UL)
#define USBHS_HCTSIZ6_XFERSIZE_2                       (0x00000004UL)
#define USBHS_HCTSIZ6_XFERSIZE_3                       (0x00000008UL)
#define USBHS_HCTSIZ6_XFERSIZE_4                       (0x00000010UL)
#define USBHS_HCTSIZ6_XFERSIZE_5                       (0x00000020UL)
#define USBHS_HCTSIZ6_XFERSIZE_6                       (0x00000040UL)
#define USBHS_HCTSIZ6_XFERSIZE_7                       (0x00000080UL)
#define USBHS_HCTSIZ6_XFERSIZE_8                       (0x00000100UL)
#define USBHS_HCTSIZ6_XFERSIZE_9                       (0x00000200UL)
#define USBHS_HCTSIZ6_XFERSIZE_10                      (0x00000400UL)
#define USBHS_HCTSIZ6_XFERSIZE_11                      (0x00000800UL)
#define USBHS_HCTSIZ6_XFERSIZE_12                      (0x00001000UL)
#define USBHS_HCTSIZ6_XFERSIZE_13                      (0x00002000UL)
#define USBHS_HCTSIZ6_XFERSIZE_14                      (0x00004000UL)
#define USBHS_HCTSIZ6_XFERSIZE_15                      (0x00008000UL)
#define USBHS_HCTSIZ6_XFERSIZE_16                      (0x00010000UL)
#define USBHS_HCTSIZ6_XFERSIZE_17                      (0x00020000UL)
#define USBHS_HCTSIZ6_XFERSIZE_18                      (0x00040000UL)
#define USBHS_HCTSIZ6_PKTCNT_POS                       (19U)
#define USBHS_HCTSIZ6_PKTCNT                           (0x1FF80000UL)
#define USBHS_HCTSIZ6_PKTCNT_0                         (0x00080000UL)
#define USBHS_HCTSIZ6_PKTCNT_1                         (0x00100000UL)
#define USBHS_HCTSIZ6_PKTCNT_2                         (0x00200000UL)
#define USBHS_HCTSIZ6_PKTCNT_3                         (0x00400000UL)
#define USBHS_HCTSIZ6_PKTCNT_4                         (0x00800000UL)
#define USBHS_HCTSIZ6_PKTCNT_5                         (0x01000000UL)
#define USBHS_HCTSIZ6_PKTCNT_6                         (0x02000000UL)
#define USBHS_HCTSIZ6_PKTCNT_7                         (0x04000000UL)
#define USBHS_HCTSIZ6_PKTCNT_8                         (0x08000000UL)
#define USBHS_HCTSIZ6_PKTCNT_9                         (0x10000000UL)
#define USBHS_HCTSIZ6_PID_POS                          (29U)
#define USBHS_HCTSIZ6_PID                              (0x60000000UL)
#define USBHS_HCTSIZ6_PID_0                            (0x20000000UL)
#define USBHS_HCTSIZ6_PID_1                            (0x40000000UL)
#define USBHS_HCTSIZ6_DOPNG_POS                        (31U)
#define USBHS_HCTSIZ6_DOPNG                            (0x80000000UL)

/*  Bit definition for USBHS_HCDMA6 register  */
#define USBHS_HCDMA6                                   (0xFFFFFFFFUL)

/*  Bit definition for USBHS_HCCHAR7 register  */
#define USBHS_HCCHAR7_MPS_POS                          (0U)
#define USBHS_HCCHAR7_MPS                              (0x000007FFUL)
#define USBHS_HCCHAR7_MPS_0                            (0x00000001UL)
#define USBHS_HCCHAR7_MPS_1                            (0x00000002UL)
#define USBHS_HCCHAR7_MPS_2                            (0x00000004UL)
#define USBHS_HCCHAR7_MPS_3                            (0x00000008UL)
#define USBHS_HCCHAR7_MPS_4                            (0x00000010UL)
#define USBHS_HCCHAR7_MPS_5                            (0x00000020UL)
#define USBHS_HCCHAR7_MPS_6                            (0x00000040UL)
#define USBHS_HCCHAR7_MPS_7                            (0x00000080UL)
#define USBHS_HCCHAR7_MPS_8                            (0x00000100UL)
#define USBHS_HCCHAR7_MPS_9                            (0x00000200UL)
#define USBHS_HCCHAR7_MPS_10                           (0x00000400UL)
#define USBHS_HCCHAR7_EPNUM_POS                        (11U)
#define USBHS_HCCHAR7_EPNUM                            (0x00007800UL)
#define USBHS_HCCHAR7_EPNUM_0                          (0x00000800UL)
#define USBHS_HCCHAR7_EPNUM_1                          (0x00001000UL)
#define USBHS_HCCHAR7_EPNUM_2                          (0x00002000UL)
#define USBHS_HCCHAR7_EPNUM_3                          (0x00004000UL)
#define USBHS_HCCHAR7_EPDIR_POS                        (15U)
#define USBHS_HCCHAR7_EPDIR                            (0x00008000UL)
#define USBHS_HCCHAR7_LSPDDEV_POS                      (17U)
#define USBHS_HCCHAR7_LSPDDEV                          (0x00020000UL)
#define USBHS_HCCHAR7_EPTYPE_POS                       (18U)
#define USBHS_HCCHAR7_EPTYPE                           (0x000C0000UL)
#define USBHS_HCCHAR7_EPTYPE_0                         (0x00040000UL)
#define USBHS_HCCHAR7_EPTYPE_1                         (0x00080000UL)
#define USBHS_HCCHAR7_EC_POS                           (20U)
#define USBHS_HCCHAR7_EC                               (0x00300000UL)
#define USBHS_HCCHAR7_EC_0                             (0x00100000UL)
#define USBHS_HCCHAR7_EC_1                             (0x00200000UL)
#define USBHS_HCCHAR7_DEVADDR_POS                      (22U)
#define USBHS_HCCHAR7_DEVADDR                          (0x1FC00000UL)
#define USBHS_HCCHAR7_DEVADDR_0                        (0x00400000UL)
#define USBHS_HCCHAR7_DEVADDR_1                        (0x00800000UL)
#define USBHS_HCCHAR7_DEVADDR_2                        (0x01000000UL)
#define USBHS_HCCHAR7_DEVADDR_3                        (0x02000000UL)
#define USBHS_HCCHAR7_DEVADDR_4                        (0x04000000UL)
#define USBHS_HCCHAR7_DEVADDR_5                        (0x08000000UL)
#define USBHS_HCCHAR7_DEVADDR_6                        (0x10000000UL)
#define USBHS_HCCHAR7_ODDFRM_POS                       (29U)
#define USBHS_HCCHAR7_ODDFRM                           (0x20000000UL)
#define USBHS_HCCHAR7_CHDIS_POS                        (30U)
#define USBHS_HCCHAR7_CHDIS                            (0x40000000UL)
#define USBHS_HCCHAR7_CHENA_POS                        (31U)
#define USBHS_HCCHAR7_CHENA                            (0x80000000UL)

/*  Bit definition for USBHS_HCSPLT7 register  */
#define USBHS_HCSPLT7_PRTADDR_POS                      (0U)
#define USBHS_HCSPLT7_PRTADDR                          (0x0000007FUL)
#define USBHS_HCSPLT7_PRTADDR_0                        (0x00000001UL)
#define USBHS_HCSPLT7_PRTADDR_1                        (0x00000002UL)
#define USBHS_HCSPLT7_PRTADDR_2                        (0x00000004UL)
#define USBHS_HCSPLT7_PRTADDR_3                        (0x00000008UL)
#define USBHS_HCSPLT7_PRTADDR_4                        (0x00000010UL)
#define USBHS_HCSPLT7_PRTADDR_5                        (0x00000020UL)
#define USBHS_HCSPLT7_PRTADDR_6                        (0x00000040UL)
#define USBHS_HCSPLT7_HUBADDR_POS                      (7U)
#define USBHS_HCSPLT7_HUBADDR                          (0x00003F80UL)
#define USBHS_HCSPLT7_HUBADDR_0                        (0x00000080UL)
#define USBHS_HCSPLT7_HUBADDR_1                        (0x00000100UL)
#define USBHS_HCSPLT7_HUBADDR_2                        (0x00000200UL)
#define USBHS_HCSPLT7_HUBADDR_3                        (0x00000400UL)
#define USBHS_HCSPLT7_HUBADDR_4                        (0x00000800UL)
#define USBHS_HCSPLT7_HUBADDR_5                        (0x00001000UL)
#define USBHS_HCSPLT7_HUBADDR_6                        (0x00002000UL)
#define USBHS_HCSPLT7_XACTPOS_POS                      (14U)
#define USBHS_HCSPLT7_XACTPOS                          (0x0000C000UL)
#define USBHS_HCSPLT7_XACTPOS_0                        (0x00004000UL)
#define USBHS_HCSPLT7_XACTPOS_1                        (0x00008000UL)
#define USBHS_HCSPLT7_COMPSPLT_POS                     (16U)
#define USBHS_HCSPLT7_COMPSPLT                         (0x00010000UL)
#define USBHS_HCSPLT7_SPLTENA_POS                      (31U)
#define USBHS_HCSPLT7_SPLTENA                          (0x80000000UL)

/*  Bit definition for USBHS_HCINT7 register  */
#define USBHS_HCINT7_XFERCOMPL_POS                     (0U)
#define USBHS_HCINT7_XFERCOMPL                         (0x00000001UL)
#define USBHS_HCINT7_CHHLTD_POS                        (1U)
#define USBHS_HCINT7_CHHLTD                            (0x00000002UL)
#define USBHS_HCINT7_AHBERR_POS                        (2U)
#define USBHS_HCINT7_AHBERR                            (0x00000004UL)
#define USBHS_HCINT7_STALL_POS                         (3U)
#define USBHS_HCINT7_STALL                             (0x00000008UL)
#define USBHS_HCINT7_NAK_POS                           (4U)
#define USBHS_HCINT7_NAK                               (0x00000010UL)
#define USBHS_HCINT7_ACK_POS                           (5U)
#define USBHS_HCINT7_ACK                               (0x00000020UL)
#define USBHS_HCINT7_NYET_POS                          (6U)
#define USBHS_HCINT7_NYET                              (0x00000040UL)
#define USBHS_HCINT7_XACTERR_POS                       (7U)
#define USBHS_HCINT7_XACTERR                           (0x00000080UL)
#define USBHS_HCINT7_BBLERR_POS                        (8U)
#define USBHS_HCINT7_BBLERR                            (0x00000100UL)
#define USBHS_HCINT7_FRMOVRUN_POS                      (9U)
#define USBHS_HCINT7_FRMOVRUN                          (0x00000200UL)
#define USBHS_HCINT7_DATATGLERR_POS                    (10U)
#define USBHS_HCINT7_DATATGLERR                        (0x00000400UL)

/*  Bit definition for USBHS_HCINTMSK7 register  */
#define USBHS_HCINTMSK7_XFERCOMPLMSK_POS               (0U)
#define USBHS_HCINTMSK7_XFERCOMPLMSK                   (0x00000001UL)
#define USBHS_HCINTMSK7_CHHLTDMSK_POS                  (1U)
#define USBHS_HCINTMSK7_CHHLTDMSK                      (0x00000002UL)
#define USBHS_HCINTMSK7_AHBERRMSK_POS                  (2U)
#define USBHS_HCINTMSK7_AHBERRMSK                      (0x00000004UL)
#define USBHS_HCINTMSK7_STALLMSK_POS                   (3U)
#define USBHS_HCINTMSK7_STALLMSK                       (0x00000008UL)
#define USBHS_HCINTMSK7_NAKMSK_POS                     (4U)
#define USBHS_HCINTMSK7_NAKMSK                         (0x00000010UL)
#define USBHS_HCINTMSK7_ACKMSK_POS                     (5U)
#define USBHS_HCINTMSK7_ACKMSK                         (0x00000020UL)
#define USBHS_HCINTMSK7_NYETMSK_POS                    (6U)
#define USBHS_HCINTMSK7_NYETMSK                        (0x00000040UL)
#define USBHS_HCINTMSK7_XACTERRMSK_POS                 (7U)
#define USBHS_HCINTMSK7_XACTERRMSK                     (0x00000080UL)
#define USBHS_HCINTMSK7_BBLERRMSK_POS                  (8U)
#define USBHS_HCINTMSK7_BBLERRMSK                      (0x00000100UL)
#define USBHS_HCINTMSK7_FRMOVRUNMSK_POS                (9U)
#define USBHS_HCINTMSK7_FRMOVRUNMSK                    (0x00000200UL)
#define USBHS_HCINTMSK7_DATATGLERRMSK_POS              (10U)
#define USBHS_HCINTMSK7_DATATGLERRMSK                  (0x00000400UL)

/*  Bit definition for USBHS_HCTSIZ7 register  */
#define USBHS_HCTSIZ7_XFERSIZE_POS                     (0U)
#define USBHS_HCTSIZ7_XFERSIZE                         (0x0007FFFFUL)
#define USBHS_HCTSIZ7_XFERSIZE_0                       (0x00000001UL)
#define USBHS_HCTSIZ7_XFERSIZE_1                       (0x00000002UL)
#define USBHS_HCTSIZ7_XFERSIZE_2                       (0x00000004UL)
#define USBHS_HCTSIZ7_XFERSIZE_3                       (0x00000008UL)
#define USBHS_HCTSIZ7_XFERSIZE_4                       (0x00000010UL)
#define USBHS_HCTSIZ7_XFERSIZE_5                       (0x00000020UL)
#define USBHS_HCTSIZ7_XFERSIZE_6                       (0x00000040UL)
#define USBHS_HCTSIZ7_XFERSIZE_7                       (0x00000080UL)
#define USBHS_HCTSIZ7_XFERSIZE_8                       (0x00000100UL)
#define USBHS_HCTSIZ7_XFERSIZE_9                       (0x00000200UL)
#define USBHS_HCTSIZ7_XFERSIZE_10                      (0x00000400UL)
#define USBHS_HCTSIZ7_XFERSIZE_11                      (0x00000800UL)
#define USBHS_HCTSIZ7_XFERSIZE_12                      (0x00001000UL)
#define USBHS_HCTSIZ7_XFERSIZE_13                      (0x00002000UL)
#define USBHS_HCTSIZ7_XFERSIZE_14                      (0x00004000UL)
#define USBHS_HCTSIZ7_XFERSIZE_15                      (0x00008000UL)
#define USBHS_HCTSIZ7_XFERSIZE_16                      (0x00010000UL)
#define USBHS_HCTSIZ7_XFERSIZE_17                      (0x00020000UL)
#define USBHS_HCTSIZ7_XFERSIZE_18                      (0x00040000UL)
#define USBHS_HCTSIZ7_PKTCNT_POS                       (19U)
#define USBHS_HCTSIZ7_PKTCNT                           (0x1FF80000UL)
#define USBHS_HCTSIZ7_PKTCNT_0                         (0x00080000UL)
#define USBHS_HCTSIZ7_PKTCNT_1                         (0x00100000UL)
#define USBHS_HCTSIZ7_PKTCNT_2                         (0x00200000UL)
#define USBHS_HCTSIZ7_PKTCNT_3                         (0x00400000UL)
#define USBHS_HCTSIZ7_PKTCNT_4                         (0x00800000UL)
#define USBHS_HCTSIZ7_PKTCNT_5                         (0x01000000UL)
#define USBHS_HCTSIZ7_PKTCNT_6                         (0x02000000UL)
#define USBHS_HCTSIZ7_PKTCNT_7                         (0x04000000UL)
#define USBHS_HCTSIZ7_PKTCNT_8                         (0x08000000UL)
#define USBHS_HCTSIZ7_PKTCNT_9                         (0x10000000UL)
#define USBHS_HCTSIZ7_PID_POS                          (29U)
#define USBHS_HCTSIZ7_PID                              (0x60000000UL)
#define USBHS_HCTSIZ7_PID_0                            (0x20000000UL)
#define USBHS_HCTSIZ7_PID_1                            (0x40000000UL)
#define USBHS_HCTSIZ7_DOPNG_POS                        (31U)
#define USBHS_HCTSIZ7_DOPNG                            (0x80000000UL)

/*  Bit definition for USBHS_HCDMA7 register  */
#define USBHS_HCDMA7                                   (0xFFFFFFFFUL)

/*  Bit definition for USBHS_HCCHAR8 register  */
#define USBHS_HCCHAR8_MPS_POS                          (0U)
#define USBHS_HCCHAR8_MPS                              (0x000007FFUL)
#define USBHS_HCCHAR8_MPS_0                            (0x00000001UL)
#define USBHS_HCCHAR8_MPS_1                            (0x00000002UL)
#define USBHS_HCCHAR8_MPS_2                            (0x00000004UL)
#define USBHS_HCCHAR8_MPS_3                            (0x00000008UL)
#define USBHS_HCCHAR8_MPS_4                            (0x00000010UL)
#define USBHS_HCCHAR8_MPS_5                            (0x00000020UL)
#define USBHS_HCCHAR8_MPS_6                            (0x00000040UL)
#define USBHS_HCCHAR8_MPS_7                            (0x00000080UL)
#define USBHS_HCCHAR8_MPS_8                            (0x00000100UL)
#define USBHS_HCCHAR8_MPS_9                            (0x00000200UL)
#define USBHS_HCCHAR8_MPS_10                           (0x00000400UL)
#define USBHS_HCCHAR8_EPNUM_POS                        (11U)
#define USBHS_HCCHAR8_EPNUM                            (0x00007800UL)
#define USBHS_HCCHAR8_EPNUM_0                          (0x00000800UL)
#define USBHS_HCCHAR8_EPNUM_1                          (0x00001000UL)
#define USBHS_HCCHAR8_EPNUM_2                          (0x00002000UL)
#define USBHS_HCCHAR8_EPNUM_3                          (0x00004000UL)
#define USBHS_HCCHAR8_EPDIR_POS                        (15U)
#define USBHS_HCCHAR8_EPDIR                            (0x00008000UL)
#define USBHS_HCCHAR8_LSPDDEV_POS                      (17U)
#define USBHS_HCCHAR8_LSPDDEV                          (0x00020000UL)
#define USBHS_HCCHAR8_EPTYPE_POS                       (18U)
#define USBHS_HCCHAR8_EPTYPE                           (0x000C0000UL)
#define USBHS_HCCHAR8_EPTYPE_0                         (0x00040000UL)
#define USBHS_HCCHAR8_EPTYPE_1                         (0x00080000UL)
#define USBHS_HCCHAR8_EC_POS                           (20U)
#define USBHS_HCCHAR8_EC                               (0x00300000UL)
#define USBHS_HCCHAR8_EC_0                             (0x00100000UL)
#define USBHS_HCCHAR8_EC_1                             (0x00200000UL)
#define USBHS_HCCHAR8_DEVADDR_POS                      (22U)
#define USBHS_HCCHAR8_DEVADDR                          (0x1FC00000UL)
#define USBHS_HCCHAR8_DEVADDR_0                        (0x00400000UL)
#define USBHS_HCCHAR8_DEVADDR_1                        (0x00800000UL)
#define USBHS_HCCHAR8_DEVADDR_2                        (0x01000000UL)
#define USBHS_HCCHAR8_DEVADDR_3                        (0x02000000UL)
#define USBHS_HCCHAR8_DEVADDR_4                        (0x04000000UL)
#define USBHS_HCCHAR8_DEVADDR_5                        (0x08000000UL)
#define USBHS_HCCHAR8_DEVADDR_6                        (0x10000000UL)
#define USBHS_HCCHAR8_ODDFRM_POS                       (29U)
#define USBHS_HCCHAR8_ODDFRM                           (0x20000000UL)
#define USBHS_HCCHAR8_CHDIS_POS                        (30U)
#define USBHS_HCCHAR8_CHDIS                            (0x40000000UL)
#define USBHS_HCCHAR8_CHENA_POS                        (31U)
#define USBHS_HCCHAR8_CHENA                            (0x80000000UL)

/*  Bit definition for USBHS_HCSPLT8 register  */
#define USBHS_HCSPLT8_PRTADDR_POS                      (0U)
#define USBHS_HCSPLT8_PRTADDR                          (0x0000007FUL)
#define USBHS_HCSPLT8_PRTADDR_0                        (0x00000001UL)
#define USBHS_HCSPLT8_PRTADDR_1                        (0x00000002UL)
#define USBHS_HCSPLT8_PRTADDR_2                        (0x00000004UL)
#define USBHS_HCSPLT8_PRTADDR_3                        (0x00000008UL)
#define USBHS_HCSPLT8_PRTADDR_4                        (0x00000010UL)
#define USBHS_HCSPLT8_PRTADDR_5                        (0x00000020UL)
#define USBHS_HCSPLT8_PRTADDR_6                        (0x00000040UL)
#define USBHS_HCSPLT8_HUBADDR_POS                      (7U)
#define USBHS_HCSPLT8_HUBADDR                          (0x00003F80UL)
#define USBHS_HCSPLT8_HUBADDR_0                        (0x00000080UL)
#define USBHS_HCSPLT8_HUBADDR_1                        (0x00000100UL)
#define USBHS_HCSPLT8_HUBADDR_2                        (0x00000200UL)
#define USBHS_HCSPLT8_HUBADDR_3                        (0x00000400UL)
#define USBHS_HCSPLT8_HUBADDR_4                        (0x00000800UL)
#define USBHS_HCSPLT8_HUBADDR_5                        (0x00001000UL)
#define USBHS_HCSPLT8_HUBADDR_6                        (0x00002000UL)
#define USBHS_HCSPLT8_XACTPOS_POS                      (14U)
#define USBHS_HCSPLT8_XACTPOS                          (0x0000C000UL)
#define USBHS_HCSPLT8_XACTPOS_0                        (0x00004000UL)
#define USBHS_HCSPLT8_XACTPOS_1                        (0x00008000UL)
#define USBHS_HCSPLT8_COMPSPLT_POS                     (16U)
#define USBHS_HCSPLT8_COMPSPLT                         (0x00010000UL)
#define USBHS_HCSPLT8_SPLTENA_POS                      (31U)
#define USBHS_HCSPLT8_SPLTENA                          (0x80000000UL)

