levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_HCINT10 register  */
#define USBHS_HCINT10_XFERCOMPL_POS                    (0U)
#define USBHS_HCINT10_XFERCOMPL                        (0x00000001UL)
#define USBHS_HCINT10_CHHLTD_POS                       (1U)
#define USBHS_HCINT10_CHHLTD                           (0x00000002UL)
#define USBHS_HCINT10_AHBERR_POS                       (2U)
#define USBHS_HCINT10_AHBERR                           (0x00000004UL)
#define USBHS_HCINT10_STALL_POS                        (3U)
#define USBHS_HCINT10_STALL                            (0x00000008UL)
#define USBHS_HCINT10_NAK_POS                          (4U)
#define USBHS_HCINT10_NAK                              (0x00000010UL)
#define USBHS_HCINT10_ACK_POS                          (5U)
#define USBHS_HCINT10_ACK                              (0x00000020UL)
#define USBHS_HCINT10_NYET_POS                         (6U)
#define USBHS_HCINT10_NYET                             (0x00000040UL)
#define USBHS_HCINT10_XACTERR_POS                      (7U)
#define USBHS_HCINT10_XACTERR                          (0x00000080UL)
#define USBHS_HCINT10_BBLERR_POS                       (8U)
#define USBHS_HCINT10_BBLERR                           (0x00000100UL)
#define USBHS_HCINT10_FRMOVRUN_POS                     (9U)
#define USBHS_HCINT10_FRMOVRUN                         (0x00000200UL)
#define USBHS_HCINT10_DATATGLERR_POS                   (10U)
#define USBHS_HCINT10_DATATGLERR                       (0x00000400UL)

/*  Bit definition for USBHS_HCINTMSK10 register  */
#define USBHS_HCINTMSK10_XFERCOMPLMSK_POS              (0U)
#define USBHS_HCINTMSK10_XFERCOMPLMSK                  (0x00000001UL)
#define USBHS_HCINTMSK10_CHHLTDMSK_POS                 (1U)
#define USBHS_HCINTMSK10_CHHLTDMSK                     (0x00000002UL)
#define USBHS_HCINTMSK10_AHBERRMSK_POS                 (2U)
#define USBHS_HCINTMSK10_AHBERRMSK                     (0x00000004UL)
#define USBHS_HCINTMSK10_STALLMSK_POS                  (3U)
#define USBHS_HCINTMSK10_STALLMSK                      (0x00000008UL)
#define USBHS_HCINTMSK10_NAKMSK_POS                    (4U)
#define USBHS_HCINTMSK10_NAKMSK                        (0x00000010UL)
#define USBHS_HCINTMSK10_ACKMSK_POS                    (5U)
#define USBHS_HCINTMSK10_ACKMSK                        (0x00000020UL)
#define USBHS_HCINTMSK10_NYETMSK_POS                   (6U)
#define USBHS_HCINTMSK10_NYETMSK                       (0x00000040UL)
#define USBHS_HCINTMSK10_XACTERRMSK_POS                (7U)
#define USBHS_HCINTMSK10_XACTERRMSK                    (0x00000080UL)
#define USBHS_HCINTMSK10_BBLERRMSK_POS                 (8U)
#define USBHS_HCINTMSK10_BBLERRMSK                     (0x00000100UL)
#define USBHS_HCINTMSK10_FRMOVRUNMSK_POS               (9U)
#define USBHS_HCINTMSK10_FRMOVRUNMSK                   (0x00000200UL)
#define USBHS_HCINTMSK10_DATATGLERRMSK_POS             (10U)
#define USBHS_HCINTMSK10_DATATGLERRMSK                 (0x00000400UL)

/*  Bit definition for USBHS_HCTSIZ10 register  */
#define USBHS_HCTSIZ10_XFERSIZE_POS                    (0U)
#define USBHS_HCTSIZ10_XFERSIZE                        (0x0007FFFFUL)
#define USBHS_HCTSIZ10_XFERSIZE_0                      (0x00000001UL)
#define USBHS_HCTSIZ10_XFERSIZE_1                      (0x00000002UL)
#define USBHS_HCTSIZ10_XFERSIZE_2                      (0x00000004UL)
#define USBHS_HCTSIZ10_XFERSIZE_3                      (0x00000008UL)
#define USBHS_HCTSIZ10_XFERSIZE_4                      (0x00000010UL)
#define USBHS_HCTSIZ10_XFERSIZE_5                      (0x00000020UL)
#define USBHS_HCTSIZ10_XFERSIZE_6                      (0x00000040UL)
#define USBHS_HCTSIZ10_XFERSIZE_7                      (0x00000080UL)
#define USBHS_HCTSIZ10_XFERSIZE_8                      (0x00000100UL)
#define USBHS_HCTSIZ10_XFERSIZE_9                      (0x00000200UL)
#define USBHS_HCTSIZ10_XFERSIZE_10                     (0x00000400UL)
#define USBHS_HCTSIZ10_XFERSIZE_11                     (0x00000800UL)
#define USBHS_HCTSIZ10_XFERSIZE_12                     (0x00001000UL)
#define USBHS_HCTSIZ10_XFERSIZE_13                     (0x00002000UL)
#define USBHS_HCTSIZ10_XFERSIZE_14                     (0x00004000UL)
#define USBHS_HCTSIZ10_XFERSIZE_15                     (0x00008000UL)
#define USBHS_HCTSIZ10_XFERSIZE_16                     (0x00010000UL)
#define USBHS_HCTSIZ10_XFERSIZE_17                     (0x00020000UL)
#define USBHS_HCTSIZ10_XFERSIZE_18                     (0x00040000UL)
#define USBHS_HCTSIZ10_PKTCNT_POS                      (19U)
#define USBHS_HCTSIZ10_PKTCNT                          (0x1FF80000UL)
#define USBHS_HCTSIZ10_PKTCNT_0                        (0x00080000UL)
#define USBHS_HCTSIZ10_PKTCNT_1                        (0x00100000UL)
#define USBHS_HCTSIZ10_PKTCNT_2                        (0x00200000UL)
#define USBHS_HCTSIZ10_PKTCNT_3                        (0x00400000UL)
#define USBHS_HCTSIZ10_PKTCNT_4                        (0x00800000UL)
#define USBHS_HCTSIZ10_PKTCNT_5                        (0x01000000UL)
#define USBHS_HCTSIZ10_PKTCNT_6                        (0x02000000UL)
#define USBHS_HCTSIZ10_PKTCNT_7                        (0x04000000UL)
#define USBHS_HCTSIZ10_PKTCNT_8                        (0x08000000UL)
#define USBHS_HCTSIZ10_PKTCNT_9                        (0x10000000UL)
#define USBHS_HCTSIZ10_PID_POS                         (29U)
#define USBHS_HCTSIZ10_PID                             (0x60000000UL)
#define USBHS_HCTSIZ10_PID_0                           (0x20000000UL)
#define USBHS_HCTSIZ10_PID_1                           (0x40000000UL)
#define USBHS_HCTSIZ10_DOPNG_POS                       (31U)
#define USBHS_HCTSIZ10_DOPNG                           (0x80000000UL)

/*  Bit definition for USBHS_HCDMA10 register  */
#define USBHS_HCDMA10                                  (0xFFFFFFFFUL)

/*  Bit definition for USBHS_HCCHAR11 register  */
#define USBHS_HCCHAR11_MPS_POS                         (0U)
#define USBHS_HCCHAR11_MPS                             (0x000007FFUL)
#define USBHS_HCCHAR11_MPS_0                           (0x00000001UL)
#define USBHS_HCCHAR11_MPS_1                           (0x00000002UL)
#define USBHS_HCCHAR11_MPS_2                           (0x00000004UL)
#define USBHS_HCCHAR11_MPS_3                           (0x00000008UL)
#define USBHS_HCCHAR11_MPS_4                           (0x00000010UL)
#define USBHS_HCCHAR11_MPS_5                           (0x00000020UL)
#define USBHS_HCCHAR11_MPS_6                           (0x00000040UL)
#define USBHS_HCCHAR11_MPS_7                           (0x00000080UL)
#define USBHS_HCCHAR11_MPS_8                           (0x00000100UL)
#define USBHS_HCCHAR11_MPS_9                           (0x00000200UL)
#define USBHS_HCCHAR11_MPS_10                          (0x00000400UL)
#define USBHS_HCCHAR11_EPNUM_POS                       (11U)
#define USBHS_HCCHAR11_EPNUM                           (0x00007800UL)
#define USBHS_HCCHAR11_EPNUM_0                         (0x00000800UL)
#define USBHS_HCCHAR11_EPNUM_1                         (0x00001000UL)
#define USBHS_HCCHAR11_EPNUM_2                         (0x00002000UL)
#define USBHS_HCCHAR11_EPNUM_3                         (0x00004000UL)
#define USBHS_HCCHAR11_EPDIR_POS                       (15U)
#define USBHS_HCCHAR11_EPDIR                           (0x00008000UL)
#define USBHS_HCCHAR11_LSPDDEV_POS                     (17U)
#define USBHS_HCCHAR11_LSPDDEV                         (0x00020000UL)
#define USBHS_HCCHAR11_EPTYPE_POS                      (18U)
#define USBHS_HCCHAR11_EPTYPE                          (0x000C0000UL)
#define USBHS_HCCHAR11_EPTYPE_0                        (0x00040000UL)
#define USBHS_HCCHAR11_EPTYPE_1                        (0x00080000UL)
#define USBHS_HCCHAR11_EC_POS                          (20U)
#define USBHS_HCCHAR11_EC                              (0x00300000UL)
#define USBHS_HCCHAR11_EC_0                            (0x00100000UL)
#define USBHS_HCCHAR11_EC_1                            (0x00200000UL)
#define USBHS_HCCHAR11_DEVADDR_POS                     (22U)
#define USBHS_HCCHAR11_DEVADDR                         (0x1FC00000UL)
#define USBHS_HCCHAR11_DEVADDR_0                       (0x00400000UL)
#define USBHS_HCCHAR11_DEVADDR_1                       (0x00800000UL)
#define USBHS_HCCHAR11_DEVADDR_2                       (0x01000000UL)
#define USBHS_HCCHAR11_DEVADDR_3                       (0x02000000UL)
#define USBHS_HCCHAR11_DEVADDR_4                       (0x04000000UL)
#define USBHS_HCCHAR11_DEVADDR_5                       (0x08000000UL)
#define USBHS_HCCHAR11_DEVADDR_6                       (0x10000000UL)
#define USBHS_HCCHAR11_ODDFRM_POS                      (29U)
#define USBHS_HCCHAR11_ODDFRM                          (0x20000000UL)
#define USBHS_HCCHAR11_CHDIS_POS                       (30U)
#define USBHS_HCCHAR11_CHDIS                           (0x40000000UL)
#define USBHS_HCCHAR11_CHENA_POS                       (31U)
#define USBHS_HCCHAR11_CHENA                           (0x80000000UL)

/*  Bit definition for USBHS_HCSPLT11 register  */
#define USBHS_HCSPLT11_PRTADDR_POS                     (0U)
#define USBHS_HCSPLT11_PRTADDR                         (0x0000007FUL)
#define USBHS_HCSPLT11_PRTADDR_0                       (0x00000001UL)
#define USBHS_HCSPLT11_PRTADDR_1                       (0x00000002UL)
#define USBHS_HCSPLT11_PRTADDR_2                       (0x00000004UL)
#define USBHS_HCSPLT11_PRTADDR_3                       (0x00000008UL)
#define USBHS_HCSPLT11_PRTADDR_4                       (0x00000010UL)
#define USBHS_HCSPLT11_PRTADDR_5                       (0x00000020UL)
#define USBHS_HCSPLT11_PRTADDR_6                       (0x00000040UL)
#define USBHS_HCSPLT11_HUBADDR_POS                     (7U)
#define USBHS_HCSPLT11_HUBADDR                         (0x00003F80UL)
#define USBHS_HCSPLT11_HUBADDR_0                       (0x00000080UL)
#define USBHS_HCSPLT11_HUBADDR_1                       (0x00000100UL)
#define USBHS_HCSPLT11_HUBADDR_2                       (0x00000200UL)
#define USBHS_HCSPLT11_HUBADDR_3                       (0x00000400UL)
#define USBHS_HCSPLT11_HUBADDR_4                       (0x00000800UL)
#define USBHS_HCSPLT11_HUBADDR_5                       (0x00001000UL)
#define USBHS_HCSPLT11_HUBADDR_6                       (0x00002000UL)
#define USBHS_HCSPLT11_XACTPOS_POS                     (14U)
#define USBHS_HCSPLT11_XACTPOS                         (0x0000C000UL)
#define USBHS_HCSPLT11_XACTPOS_0                       (0x00004000UL)
#define USBHS_HCSPLT11_XACTPOS_1                       (0x00008000UL)
#define USBHS_HCSPLT11_COMPSPLT_POS                    (16U)
#define USBHS_HCSPLT11_COMPSPLT                        (0x00010000UL)
#define USBHS_HCSPLT11_SPLTENA_POS                     (31U)
#define USBHS_HCSPLT11_SPLTENA                         (0x80000000UL)

/*  Bit definition for USBHS_HCINT11 register  */
#define USBHS_HCINT11_XFERCOMPL_POS                    (0U)
#define USBHS_HCINT11_XFERCOMPL                        (0x00000001UL)
#define USBHS_HCINT11_CHHLTD_POS                       (1U)
#define USBHS_HCINT11_CHHLTD                           (0x00000002UL)
#define USBHS_HCINT11_AHBERR_POS                       (2U)
#define USBHS_HCINT11_AHBERR                           (0x00000004UL)
#define USBHS_HCINT11_STALL_POS                        (3U)
#define USBHS_HCINT11_STALL                            (0x00000008UL)
#define USBHS_HCINT11_NAK_POS                          (4U)
#define USBHS_HCINT11_NAK                              (0x00000010UL)
#define USBHS_HCINT11_ACK_POS                          (5U)
#define USBHS_HCINT11_ACK                              (0x00000020UL)
#define USBHS_HCINT11_NYET_POS                         (6U)
#define USBHS_HCINT11_NYET                             (0x00000040UL)
#define USBHS_HCINT11_XACTERR_POS                      (7U)
#define USBHS_HCINT11_XACTERR                          (0x00000080UL)
#define USBHS_HCINT11_BBLERR_POS                       (8U)
#define USBHS_HCINT11_BBLERR                           (0x00000100UL)
#define USBHS_HCINT11_FRMOVRUN_POS                     (9U)
#define USBHS_HCINT11_FRMOVRUN                         (0x00000200UL)
#define USBHS_HCINT11_DATATGLERR_POS                   (10U)
#define USBHS_HCINT11_DATATGLERR                       (0x00000400UL)

/*  Bit definition for USBHS_HCINTMSK11 register  */
#define USBHS_HCINTMSK11_XFERCOMPLMSK_POS              (0U)
#define USBHS_HCINTMSK11_XFERCOMPLMSK                  (0x00000001UL)
#define USBHS_HCINTMSK11_CHHLTDMSK_POS                 (1U)
#define USBHS_HCINTMSK11_CHHLTDMSK                     (0x00000002UL)
#define USBHS_HCINTMSK11_AHBERRMSK_POS                 (2U)
#define USBHS_HCINTMSK11_AHBERRMSK                     (0x00000004UL)
#define USBHS_HCINTMSK11_STALLMSK_POS                  (3U)
#define USBHS_HCINTMSK11_STALLMSK                      (0x00000008UL)
#define USBHS_HCINTMSK11_NAKMSK_POS                    (4U)
#define USBHS_HCINTMSK11_NAKMSK                        (0x00000010UL)
#define USBHS_HCINTMSK11_ACKMSK_POS                    (5U)
#define USBHS_HCINTMSK11_ACKMSK                        (0x00000020UL)
#define USBHS_HCINTMSK11_NYETMSK_POS                   (6U)
#define USBHS_HCINTMSK11_NYETMSK                       (0x00000040UL)
#define USBHS_HCINTMSK11_XACTERRMSK_POS                (7U)
#define USBHS_HCINTMSK11_XACTERRMSK                    (0x00000080UL)
#define USBHS_HCINTMSK11_BBLERRMSK_POS                 (8U)
#define USBHS_HCINTMSK11_BBLERRMSK                     (0x00000100UL)
#define USBHS_HCINTMSK11_FRMOVRUNMSK_POS               (9U)
#define USBHS_HCINTMSK11_FRMOVRUNMSK                   (0x00000200UL)
#define USBHS_HCINTMSK11_DATATGLERRMSK_POS             (10U)
#define USBHS_HCINTMSK11_DATATGLERRMSK                 (0x00000400UL)

/*  Bit definition for USBHS_HCTSIZ11 register  */
#define USBHS_HCTSIZ11_XFERSIZE_POS                    (0U)
#define USBHS_HCTSIZ11_XFERSIZE                        (0x0007FFFFUL)
#define USBHS_HCTSIZ11_XFERSIZE_0                      (0x00000001UL)
#define USBHS_HCTSIZ11_XFERSIZE_1                      (0x00000002UL)
#define USBHS_HCTSIZ11_XFERSIZE_2                      (0x00000004UL)
#define USBHS_HCTSIZ11_XFERSIZE_3                      (0x00000008UL)
#define USBHS_HCTSIZ11_XFERSIZE_4                      (0x00000010UL)
#define USBHS_HCTSIZ11_XFERSIZE_5                      (0x00000020UL)
#define USBHS_HCTSIZ11_XFERSIZE_6                      (0x00000040UL)
#define USBHS_HCTSIZ11_XFERSIZE_7                      (0x00000080UL)
#define USBHS_HCTSIZ11_XFERSIZE_8                      (0x00000100UL)
#define USBHS_HCTSIZ11_XFERSIZE_9                      (0x00000200UL)
#define USBHS_HCTSIZ11_XFERSIZE_10                     (0x00000400UL)
#define USBHS_HCTSIZ11_XFERSIZE_11                     (0x00000800UL)
#define USBHS_HCTSIZ11_XFERSIZE_12                     (0x00001000UL)
#define USBHS_HCTSIZ11_XFERSIZE_13                     (0x00002000UL)
#define USBHS_HCTSIZ11_XFERSIZE_14                     (0x00004000UL)
#define USBHS_HCTSIZ11_XFERSIZE_15                     (0x00008000UL)
#define USBHS_HCTSIZ11_XFERSIZE_16                     (0x00010000UL)
#define USBHS_HCTSIZ11_XFERSIZE_17                     (0x00020000UL)
#define USBHS_HCTSIZ11_XFERSIZE_18                     (0x00040000UL)
#define USBHS_HCTSIZ11_PKTCNT_POS                      (19U)
#define USBHS_HCTSIZ11_PKTCNT                          (0x1FF80000UL)
#define USBHS_HCTSIZ11_PKTCNT_0                        (0x00080000UL)
#define USBHS_HCTSIZ11_PKTCNT_1                        (0x00100000UL)
#define USBHS_HCTSIZ11_PKTCNT_2                        (0x00200000UL)
#define USBHS_HCTSIZ11_PKTCNT_3                        (0x00400000UL)
#define USBHS_HCTSIZ11_PKTCNT_4                        (0x00800000UL)
#define USBHS_HCTSIZ11_PKTCNT_5                        (0x01000000UL)
#define USBHS_HCTSIZ11_PKTCNT_6                        (0x02000000UL)
#define USBHS_HCTSIZ11_PKTCNT_7                        (0x04000000UL)
#define USBHS_HCTSIZ11_PKTCNT_8                        (0x08000000UL)
#define USBHS_HCTSIZ11_PKTCNT_9                        (0x10000000UL)
#define USBHS_HCTSIZ11_PID_POS                         (29U)
#define USBHS_HCTSIZ11_PID                             (0x60000000UL)
#define USBHS_HCTSIZ11_PID_0                           (0x20000000UL)
#define USBHS_HCTSIZ11_PID_1                           (0x40000000UL)
#define USBHS_HCTSIZ11_DOPNG_POS                       (31U)
#define USBHS_HCTSIZ11_DOPNG                           (0x80000000UL)

/*  Bit definition for USBHS_HCDMA11 register  */
#define USBHS_HCDMA11                                  (0xFFFFFFFFUL)

