levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_HCCHAR12 register  */
#define USBHS_HCCHAR12_MPS_POS                         (0U)
#define USBHS_HCCHAR12_MPS                             (0x000007FFUL)
#define USBHS_HCCHAR12_MPS_0                           (0x00000001UL)
#define USBHS_HCCHAR12_MPS_1                           (0x00000002UL)
#define USBHS_HCCHAR12_MPS_2                           (0x00000004UL)
#define USBHS_HCCHAR12_MPS_3                           (0x00000008UL)
#define USBHS_HCCHAR12_MPS_4                           (0x00000010UL)
#define USBHS_HCCHAR12_MPS_5                           (0x00000020UL)
#define USBHS_HCCHAR12_MPS_6                           (0x00000040UL)
#define USBHS_HCCHAR12_MPS_7                           (0x00000080UL)
#define USBHS_HCCHAR12_MPS_8                           (0x00000100UL)
#define USBHS_HCCHAR12_MPS_9                           (0x00000200UL)
#define USBHS_HCCHAR12_MPS_10                          (0x00000400UL)
#define USBHS_HCCHAR12_EPNUM_POS                       (11U)
#define USBHS_HCCHAR12_EPNUM                           (0x00007800UL)
#define USBHS_HCCHAR12_EPNUM_0                         (0x00000800UL)
#define USBHS_HCCHAR12_EPNUM_1                         (0x00001000UL)
#define USBHS_HCCHAR12_EPNUM_2                         (0x00002000UL)
#define USBHS_HCCHAR12_EPNUM_3                         (0x00004000UL)
#define USBHS_HCCHAR12_EPDIR_POS                       (15U)
#define USBHS_HCCHAR12_EPDIR                           (0x00008000UL)
#define USBHS_HCCHAR12_LSPDDEV_POS                     (17U)
#define USBHS_HCCHAR12_LSPDDEV                         (0x00020000UL)
#define USBHS_HCCHAR12_EPTYPE_POS                      (18U)
#define USBHS_HCCHAR12_EPTYPE                          (0x000C0000UL)
#define USBHS_HCCHAR12_EPTYPE_0                        (0x00040000UL)
#define USBHS_HCCHAR12_EPTYPE_1                        (0x00080000UL)
#define USBHS_HCCHAR12_EC_POS                          (20U)
#define USBHS_HCCHAR12_EC                              (0x00300000UL)
#define USBHS_HCCHAR12_EC_0                            (0x00100000UL)
#define USBHS_HCCHAR12_EC_1                            (0x00200000UL)
#define USBHS_HCCHAR12_DEVADDR_POS                     (22U)
#define USBHS_HCCHAR12_DEVADDR                         (0x1FC00000UL)
#define USBHS_HCCHAR12_DEVADDR_0                       (0x00400000UL)
#define USBHS_HCCHAR12_DEVADDR_1                       (0x00800000UL)
#define USBHS_HCCHAR12_DEVADDR_2                       (0x01000000UL)
#define USBHS_HCCHAR12_DEVADDR_3                       (0x02000000UL)
#define USBHS_HCCHAR12_DEVADDR_4                       (0x04000000UL)
#define USBHS_HCCHAR12_DEVADDR_5                       (0x08000000UL)
#define USBHS_HCCHAR12_DEVADDR_6                       (0x10000000UL)
#define USBHS_HCCHAR12_ODDFRM_POS                      (29U)
#define USBHS_HCCHAR12_ODDFRM                          (0x20000000UL)
#define USBHS_HCCHAR12_CHDIS_POS                       (30U)
#define USBHS_HCCHAR12_CHDIS                           (0x40000000UL)
#define USBHS_HCCHAR12_CHENA_POS                       (31U)
#define USBHS_HCCHAR12_CHENA                           (0x80000000UL)

/*  Bit definition for USBHS_HCSPLT12 register  */
#define USBHS_HCSPLT12_PRTADDR_POS                     (0U)
#define USBHS_HCSPLT12_PRTADDR                         (0x0000007FUL)
#define USBHS_HCSPLT12_PRTADDR_0                       (0x00000001UL)
#define USBHS_HCSPLT12_PRTADDR_1                       (0x00000002UL)
#define USBHS_HCSPLT12_PRTADDR_2                       (0x00000004UL)
#define USBHS_HCSPLT12_PRTADDR_3                       (0x00000008UL)
#define USBHS_HCSPLT12_PRTADDR_4                       (0x00000010UL)
#define USBHS_HCSPLT12_PRTADDR_5                       (0x00000020UL)
#define USBHS_HCSPLT12_PRTADDR_6                       (0x00000040UL)
#define USBHS_HCSPLT12_HUBADDR_POS                     (7U)
#define USBHS_HCSPLT12_HUBADDR                         (0x00003F80UL)
#define USBHS_HCSPLT12_HUBADDR_0                       (0x00000080UL)
#define USBHS_HCSPLT12_HUBADDR_1                       (0x00000100UL)
#define USBHS_HCSPLT12_HUBADDR_2                       (0x00000200UL)
#define USBHS_HCSPLT12_HUBADDR_3                       (0x00000400UL)
#define USBHS_HCSPLT12_HUBADDR_4                       (0x00000800UL)
#define USBHS_HCSPLT12_HUBADDR_5                       (0x00001000UL)
#define USBHS_HCSPLT12_HUBADDR_6                       (0x00002000UL)
#define USBHS_HCSPLT12_XACTPOS_POS                     (14U)
#define USBHS_HCSPLT12_XACTPOS                         (0x0000C000UL)
#define USBHS_HCSPLT12_XACTPOS_0                       (0x00004000UL)
#define USBHS_HCSPLT12_XACTPOS_1                       (0x00008000UL)
#define USBHS_HCSPLT12_COMPSPLT_POS                    (16U)
#define USBHS_HCSPLT12_COMPSPLT                        (0x00010000UL)
#define USBHS_HCSPLT12_SPLTENA_POS                     (31U)
#define USBHS_HCSPLT12_SPLTENA                         (0x80000000UL)

/*  Bit definition for USBHS_HCINT12 register  */
#define USBHS_HCINT12_XFERCOMPL_POS                    (0U)
#define USBHS_HCINT12_XFERCOMPL                        (0x00000001UL)
#define USBHS_HCINT12_CHHLTD_POS                       (1U)
#define USBHS_HCINT12_CHHLTD                           (0x00000002UL)
#define USBHS_HCINT12_AHBERR_POS                       (2U)
#define USBHS_HCINT12_AHBERR                           (0x00000004UL)
#define USBHS_HCINT12_STALL_POS                        (3U)
#define USBHS_HCINT12_STALL                            (0x00000008UL)
#define USBHS_HCINT12_NAK_POS                          (4U)
#define USBHS_HCINT12_NAK                              (0x00000010UL)
#define USBHS_HCINT12_ACK_POS                          (5U)
#define USBHS_HCINT12_ACK                              (0x00000020UL)
#define USBHS_HCINT12_NYET_POS                         (6U)
#define USBHS_HCINT12_NYET                             (0x00000040UL)
#define USBHS_HCINT12_XACTERR_POS                      (7U)
#define USBHS_HCINT12_XACTERR                          (0x00000080UL)
#define USBHS_HCINT12_BBLERR_POS                       (8U)
#define USBHS_HCINT12_BBLERR                           (0x00000100UL)
#define USBHS_HCINT12_FRMOVRUN_POS                     (9U)
#define USBHS_HCINT12_FRMOVRUN                         (0x00000200UL)
#define USBHS_HCINT12_DATATGLERR_POS                   (10U)
#define USBHS_HCINT12_DATATGLERR                       (0x00000400UL)

