levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_HCINTMSK12 register  */
#define USBHS_HCINTMSK12_XFERCOMPLMSK_POS              (0U)
#define USBHS_HCINTMSK12_XFERCOMPLMSK                  (0x00000001UL)
#define USBHS_HCINTMSK12_CHHLTDMSK_POS                 (1U)
#define USBHS_HCINTMSK12_CHHLTDMSK                     (0x00000002UL)
#define USBHS_HCINTMSK12_AHBERRMSK_POS                 (2U)
#define USBHS_HCINTMSK12_AHBERRMSK                     (0x00000004UL)
#define USBHS_HCINTMSK12_STALLMSK_POS                  (3U)
#define USBHS_HCINTMSK12_STALLMSK                      (0x00000008UL)
#define USBHS_HCINTMSK12_NAKMSK_POS                    (4U)
#define USBHS_HCINTMSK12_NAKMSK                        (0x00000010UL)
#define USBHS_HCINTMSK12_ACKMSK_POS                    (5U)
#define USBHS_HCINTMSK12_ACKMSK                        (0x00000020UL)
#define USBHS_HCINTMSK12_NYETMSK_POS                   (6U)
#define USBHS_HCINTMSK12_NYETMSK                       (0x00000040UL)
#define USBHS_HCINTMSK12_XACTERRMSK_POS                (7U)
#define USBHS_HCINTMSK12_XACTERRMSK                    (0x00000080UL)
#define USBHS_HCINTMSK12_BBLERRMSK_POS                 (8U)
#define USBHS_HCINTMSK12_BBLERRMSK                     (0x00000100UL)
#define USBHS_HCINTMSK12_FRMOVRUNMSK_POS               (9U)
#define USBHS_HCINTMSK12_FRMOVRUNMSK                   (0x00000200UL)
#define USBHS_HCINTMSK12_DATATGLERRMSK_POS             (10U)
#define USBHS_HCINTMSK12_DATATGLERRMSK                 (0x00000400UL)

/*  Bit definition for USBHS_HCTSIZ12 register  */
#define USBHS_HCTSIZ12_XFERSIZE_POS                    (0U)
#define USBHS_HCTSIZ12_XFERSIZE                        (0x0007FFFFUL)
#define USBHS_HCTSIZ12_XFERSIZE_0                      (0x00000001UL)
#define USBHS_HCTSIZ12_XFERSIZE_1                      (0x00000002UL)
#define USBHS_HCTSIZ12_XFERSIZE_2                      (0x00000004UL)
#define USBHS_HCTSIZ12_XFERSIZE_3                      (0x00000008UL)
#define USBHS_HCTSIZ12_XFERSIZE_4                      (0x00000010UL)
#define USBHS_HCTSIZ12_XFERSIZE_5                      (0x00000020UL)
#define USBHS_HCTSIZ12_XFERSIZE_6                      (0x00000040UL)
#define USBHS_HCTSIZ12_XFERSIZE_7                      (0x00000080UL)
#define USBHS_HCTSIZ12_XFERSIZE_8                      (0x00000100UL)
#define USBHS_HCTSIZ12_XFERSIZE_9                      (0x00000200UL)
#define USBHS_HCTSIZ12_XFERSIZE_10                     (0x00000400UL)
#define USBHS_HCTSIZ12_XFERSIZE_11                     (0x00000800UL)
#define USBHS_HCTSIZ12_XFERSIZE_12                     (0x00001000UL)
#define USBHS_HCTSIZ12_XFERSIZE_13                     (0x00002000UL)
#define USBHS_HCTSIZ12_XFERSIZE_14                     (0x00004000UL)
#define USBHS_HCTSIZ12_XFERSIZE_15                     (0x00008000UL)
#define USBHS_HCTSIZ12_XFERSIZE_16                     (0x00010000UL)
#define USBHS_HCTSIZ12_XFERSIZE_17                     (0x00020000UL)
#define USBHS_HCTSIZ12_XFERSIZE_18                     (0x00040000UL)
#define USBHS_HCTSIZ12_PKTCNT_POS                      (19U)
#define USBHS_HCTSIZ12_PKTCNT                          (0x1FF80000UL)
#define USBHS_HCTSIZ12_PKTCNT_0                        (0x00080000UL)
#define USBHS_HCTSIZ12_PKTCNT_1                        (0x00100000UL)
#define USBHS_HCTSIZ12_PKTCNT_2                        (0x00200000UL)
#define USBHS_HCTSIZ12_PKTCNT_3                        (0x00400000UL)
#define USBHS_HCTSIZ12_PKTCNT_4                        (0x00800000UL)
#define USBHS_HCTSIZ12_PKTCNT_5                        (0x01000000UL)
#define USBHS_HCTSIZ12_PKTCNT_6                        (0x02000000UL)
#define USBHS_HCTSIZ12_PKTCNT_7                        (0x04000000UL)
#define USBHS_HCTSIZ12_PKTCNT_8                        (0x08000000UL)
#define USBHS_HCTSIZ12_PKTCNT_9                        (0x10000000UL)
#define USBHS_HCTSIZ12_PID_POS                         (29U)
#define USBHS_HCTSIZ12_PID                             (0x60000000UL)
#define USBHS_HCTSIZ12_PID_0                           (0x20000000UL)
#define USBHS_HCTSIZ12_PID_1                           (0x40000000UL)
#define USBHS_HCTSIZ12_DOPNG_POS                       (31U)
#define USBHS_HCTSIZ12_DOPNG                           (0x80000000UL)

/*  Bit definition for USBHS_HCDMA12 register  */
#define USBHS_HCDMA12                                  (0xFFFFFFFFUL)

/*  Bit definition for USBHS_HCCHAR13 register  */
#define USBHS_HCCHAR13_MPS_POS                         (0U)
#define USBHS_HCCHAR13_MPS                             (0x000007FFUL)
#define USBHS_HCCHAR13_MPS_0                           (0x00000001UL)
#define USBHS_HCCHAR13_MPS_1                           (0x00000002UL)
#define USBHS_HCCHAR13_MPS_2                           (0x00000004UL)
#define USBHS_HCCHAR13_MPS_3                           (0x00000008UL)
#define USBHS_HCCHAR13_MPS_4                           (0x00000010UL)
#define USBHS_HCCHAR13_MPS_5                           (0x00000020UL)
#define USBHS_HCCHAR13_MPS_6                           (0x00000040UL)
#define USBHS_HCCHAR13_MPS_7                           (0x00000080UL)
#define USBHS_HCCHAR13_MPS_8                           (0x00000100UL)
#define USBHS_HCCHAR13_MPS_9                           (0x00000200UL)
#define USBHS_HCCHAR13_MPS_10                          (0x00000400UL)
#define USBHS_HCCHAR13_EPNUM_POS                       (11U)
#define USBHS_HCCHAR13_EPNUM                           (0x00007800UL)
#define USBHS_HCCHAR13_EPNUM_0                         (0x00000800UL)
#define USBHS_HCCHAR13_EPNUM_1                         (0x00001000UL)
#define USBHS_HCCHAR13_EPNUM_2                         (0x00002000UL)
#define USBHS_HCCHAR13_EPNUM_3                         (0x00004000UL)
#define USBHS_HCCHAR13_EPDIR_POS                       (15U)
#define USBHS_HCCHAR13_EPDIR                           (0x00008000UL)
#define USBHS_HCCHAR13_LSPDDEV_POS                     (17U)
#define USBHS_HCCHAR13_LSPDDEV                         (0x00020000UL)
#define USBHS_HCCHAR13_EPTYPE_POS                      (18U)
#define USBHS_HCCHAR13_EPTYPE                          (0x000C0000UL)
#define USBHS_HCCHAR13_EPTYPE_0                        (0x00040000UL)
#define USBHS_HCCHAR13_EPTYPE_1                        (0x00080000UL)
#define USBHS_HCCHAR13_EC_POS                          (20U)
#define USBHS_HCCHAR13_EC                              (0x00300000UL)
#define USBHS_HCCHAR13_EC_0                            (0x00100000UL)
#define USBHS_HCCHAR13_EC_1                            (0x00200000UL)
#define USBHS_HCCHAR13_DEVADDR_POS                     (22U)
#define USBHS_HCCHAR13_DEVADDR                         (0x1FC00000UL)
#define USBHS_HCCHAR13_DEVADDR_0                       (0x00400000UL)
#define USBHS_HCCHAR13_DEVADDR_1                       (0x00800000UL)
#define USBHS_HCCHAR13_DEVADDR_2                       (0x01000000UL)
#define USBHS_HCCHAR13_DEVADDR_3                       (0x02000000UL)
#define USBHS_HCCHAR13_DEVADDR_4                       (0x04000000UL)
#define USBHS_HCCHAR13_DEVADDR_5                       (0x08000000UL)
#define USBHS_HCCHAR13_DEVADDR_6                       (0x10000000UL)
#define USBHS_HCCHAR13_ODDFRM_POS                      (29U)
#define USBHS_HCCHAR13_ODDFRM                          (0x20000000UL)
#define USBHS_HCCHAR13_CHDIS_POS                       (30U)
#define USBHS_HCCHAR13_CHDIS                           (0x40000000UL)
#define USBHS_HCCHAR13_CHENA_POS                       (31U)
#define USBHS_HCCHAR13_CHENA                           (0x80000000UL)

/*  Bit definition for USBHS_HCSPLT13 register  */
#define USBHS_HCSPLT13_PRTADDR_POS                     (0U)
#define USBHS_HCSPLT13_PRTADDR                         (0x0000007FUL)
#define USBHS_HCSPLT13_PRTADDR_0                       (0x00000001UL)
#define USBHS_HCSPLT13_PRTADDR_1                       (0x00000002UL)
#define USBHS_HCSPLT13_PRTADDR_2                       (0x00000004UL)
#define USBHS_HCSPLT13_PRTADDR_3                       (0x00000008UL)
#define USBHS_HCSPLT13_PRTADDR_4                       (0x00000010UL)
#define USBHS_HCSPLT13_PRTADDR_5                       (0x00000020UL)
#define USBHS_HCSPLT13_PRTADDR_6                       (0x00000040UL)
#define USBHS_HCSPLT13_HUBADDR_POS                     (7U)
#define USBHS_HCSPLT13_HUBADDR                         (0x00003F80UL)
#define USBHS_HCSPLT13_HUBADDR_0                       (0x00000080UL)
#define USBHS_HCSPLT13_HUBADDR_1                       (0x00000100UL)
#define USBHS_HCSPLT13_HUBADDR_2                       (0x00000200UL)
#define USBHS_HCSPLT13_HUBADDR_3                       (0x00000400UL)
#define USBHS_HCSPLT13_HUBADDR_4                       (0x00000800UL)
#define USBHS_HCSPLT13_HUBADDR_5                       (0x00001000UL)
#define USBHS_HCSPLT13_HUBADDR_6                       (0x00002000UL)
#define USBHS_HCSPLT13_XACTPOS_POS                     (14U)
#define USBHS_HCSPLT13_XACTPOS                         (0x0000C000UL)
#define USBHS_HCSPLT13_XACTPOS_0                       (0x00004000UL)
#define USBHS_HCSPLT13_XACTPOS_1                       (0x00008000UL)
#define USBHS_HCSPLT13_COMPSPLT_POS                    (16U)
#define USBHS_HCSPLT13_COMPSPLT                        (0x00010000UL)
#define USBHS_HCSPLT13_SPLTENA_POS                     (31U)
#define USBHS_HCSPLT13_SPLTENA                         (0x80000000UL)

/*  Bit definition for USBHS_HCINT13 register  */
#define USBHS_HCINT13_XFERCOMPL_POS                    (0U)
#define USBHS_HCINT13_XFERCOMPL                        (0x00000001UL)
#define USBHS_HCINT13_CHHLTD_POS                       (1U)
#define USBHS_HCINT13_CHHLTD                           (0x00000002UL)
#define USBHS_HCINT13_AHBERR_POS                       (2U)
#define USBHS_HCINT13_AHBERR                           (0x00000004UL)
#define USBHS_HCINT13_STALL_POS                        (3U)
#define USBHS_HCINT13_STALL                            (0x00000008UL)
#define USBHS_HCINT13_NAK_POS                          (4U)
#define USBHS_HCINT13_NAK                              (0x00000010UL)
#define USBHS_HCINT13_ACK_POS                          (5U)
#define USBHS_HCINT13_ACK                              (0x00000020UL)
#define USBHS_HCINT13_NYET_POS                         (6U)
#define USBHS_HCINT13_NYET                             (0x00000040UL)
#define USBHS_HCINT13_XACTERR_POS                      (7U)
#define USBHS_HCINT13_XACTERR                          (0x00000080UL)
#define USBHS_HCINT13_BBLERR_POS                       (8U)
#define USBHS_HCINT13_BBLERR                           (0x00000100UL)
#define USBHS_HCINT13_FRMOVRUN_POS                     (9U)
#define USBHS_HCINT13_FRMOVRUN                         (0x00000200UL)
#define USBHS_HCINT13_DATATGLERR_POS                   (10U)
#define USBHS_HCINT13_DATATGLERR                       (0x00000400UL)

/*  Bit definition for USBHS_HCINTMSK13 register  */
#define USBHS_HCINTMSK13_XFERCOMPLMSK_POS              (0U)
#define USBHS_HCINTMSK13_XFERCOMPLMSK                  (0x00000001UL)
#define USBHS_HCINTMSK13_CHHLTDMSK_POS                 (1U)
#define USBHS_HCINTMSK13_CHHLTDMSK                     (0x00000002UL)
#define USBHS_HCINTMSK13_AHBERRMSK_POS                 (2U)
#define USBHS_HCINTMSK13_AHBERRMSK                     (0x00000004UL)
#define USBHS_HCINTMSK13_STALLMSK_POS                  (3U)
#define USBHS_HCINTMSK13_STALLMSK                      (0x00000008UL)
#define USBHS_HCINTMSK13_NAKMSK_POS                    (4U)
#define USBHS_HCINTMSK13_NAKMSK                        (0x00000010UL)
#define USBHS_HCINTMSK13_ACKMSK_POS                    (5U)
#define USBHS_HCINTMSK13_ACKMSK                        (0x00000020UL)
#define USBHS_HCINTMSK13_NYETMSK_POS                   (6U)
#define USBHS_HCINTMSK13_NYETMSK                       (0x00000040UL)
#define USBHS_HCINTMSK13_XACTERRMSK_POS                (7U)
#define USBHS_HCINTMSK13_XACTERRMSK                    (0x00000080UL)
#define USBHS_HCINTMSK13_BBLERRMSK_POS                 (8U)
#define USBHS_HCINTMSK13_BBLERRMSK                     (0x00000100UL)
#define USBHS_HCINTMSK13_FRMOVRUNMSK_POS               (9U)
#define USBHS_HCINTMSK13_FRMOVRUNMSK                   (0x00000200UL)
#define USBHS_HCINTMSK13_DATATGLERRMSK_POS             (10U)
#define USBHS_HCINTMSK13_DATATGLERRMSK                 (0x00000400UL)

