levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_HCTSIZ13 register  */
#define USBHS_HCTSIZ13_XFERSIZE_POS                    (0U)
#define USBHS_HCTSIZ13_XFERSIZE                        (0x0007FFFFUL)
#define USBHS_HCTSIZ13_XFERSIZE_0                      (0x00000001UL)
#define USBHS_HCTSIZ13_XFERSIZE_1                      (0x00000002UL)
#define USBHS_HCTSIZ13_XFERSIZE_2                      (0x00000004UL)
#define USBHS_HCTSIZ13_XFERSIZE_3                      (0x00000008UL)
#define USBHS_HCTSIZ13_XFERSIZE_4                      (0x00000010UL)
#define USBHS_HCTSIZ13_XFERSIZE_5                      (0x00000020UL)
#define USBHS_HCTSIZ13_XFERSIZE_6                      (0x00000040UL)
#define USBHS_HCTSIZ13_XFERSIZE_7                      (0x00000080UL)
#define USBHS_HCTSIZ13_XFERSIZE_8                      (0x00000100UL)
#define USBHS_HCTSIZ13_XFERSIZE_9                      (0x00000200UL)
#define USBHS_HCTSIZ13_XFERSIZE_10                     (0x00000400UL)
#define USBHS_HCTSIZ13_XFERSIZE_11                     (0x00000800UL)
#define USBHS_HCTSIZ13_XFERSIZE_12                     (0x00001000UL)
#define USBHS_HCTSIZ13_XFERSIZE_13                     (0x00002000UL)
#define USBHS_HCTSIZ13_XFERSIZE_14                     (0x00004000UL)
#define USBHS_HCTSIZ13_XFERSIZE_15                     (0x00008000UL)
#define USBHS_HCTSIZ13_XFERSIZE_16                     (0x00010000UL)
#define USBHS_HCTSIZ13_XFERSIZE_17                     (0x00020000UL)
#define USBHS_HCTSIZ13_XFERSIZE_18                     (0x00040000UL)
#define USBHS_HCTSIZ13_PKTCNT_POS                      (19U)
#define USBHS_HCTSIZ13_PKTCNT                          (0x1FF80000UL)
#define USBHS_HCTSIZ13_PKTCNT_0                        (0x00080000UL)
#define USBHS_HCTSIZ13_PKTCNT_1                        (0x00100000UL)
#define USBHS_HCTSIZ13_PKTCNT_2                        (0x00200000UL)
#define USBHS_HCTSIZ13_PKTCNT_3                        (0x00400000UL)
#define USBHS_HCTSIZ13_PKTCNT_4                        (0x00800000UL)
#define USBHS_HCTSIZ13_PKTCNT_5                        (0x01000000UL)
#define USBHS_HCTSIZ13_PKTCNT_6                        (0x02000000UL)
#define USBHS_HCTSIZ13_PKTCNT_7                        (0x04000000UL)
#define USBHS_HCTSIZ13_PKTCNT_8                        (0x08000000UL)
#define USBHS_HCTSIZ13_PKTCNT_9                        (0x10000000UL)
#define USBHS_HCTSIZ13_PID_POS                         (29U)
#define USBHS_HCTSIZ13_PID                             (0x60000000UL)
#define USBHS_HCTSIZ13_PID_0                           (0x20000000UL)
#define USBHS_HCTSIZ13_PID_1                           (0x40000000UL)
#define USBHS_HCTSIZ13_DOPNG_POS                       (31U)
#define USBHS_HCTSIZ13_DOPNG                           (0x80000000UL)

/*  Bit definition for USBHS_HCDMA13 register  */
#define USBHS_HCDMA13                                  (0xFFFFFFFFUL)

/*  Bit definition for USBHS_HCCHAR14 register  */
#define USBHS_HCCHAR14_MPS_POS                         (0U)
#define USBHS_HCCHAR14_MPS                             (0x000007FFUL)
#define USBHS_HCCHAR14_MPS_0                           (0x00000001UL)
#define USBHS_HCCHAR14_MPS_1                           (0x00000002UL)
#define USBHS_HCCHAR14_MPS_2                           (0x00000004UL)
#define USBHS_HCCHAR14_MPS_3                           (0x00000008UL)
#define USBHS_HCCHAR14_MPS_4                           (0x00000010UL)
#define USBHS_HCCHAR14_MPS_5                           (0x00000020UL)
#define USBHS_HCCHAR14_MPS_6                           (0x00000040UL)
#define USBHS_HCCHAR14_MPS_7                           (0x00000080UL)
#define USBHS_HCCHAR14_MPS_8                           (0x00000100UL)
#define USBHS_HCCHAR14_MPS_9                           (0x00000200UL)
#define USBHS_HCCHAR14_MPS_10                          (0x00000400UL)
#define USBHS_HCCHAR14_EPNUM_POS                       (11U)
#define USBHS_HCCHAR14_EPNUM                           (0x00007800UL)
#define USBHS_HCCHAR14_EPNUM_0                         (0x00000800UL)
#define USBHS_HCCHAR14_EPNUM_1                         (0x00001000UL)
#define USBHS_HCCHAR14_EPNUM_2                         (0x00002000UL)
#define USBHS_HCCHAR14_EPNUM_3                         (0x00004000UL)
#define USBHS_HCCHAR14_EPDIR_POS                       (15U)
#define USBHS_HCCHAR14_EPDIR                           (0x00008000UL)
#define USBHS_HCCHAR14_LSPDDEV_POS                     (17U)
#define USBHS_HCCHAR14_LSPDDEV                         (0x00020000UL)
#define USBHS_HCCHAR14_EPTYPE_POS                      (18U)
#define USBHS_HCCHAR14_EPTYPE                          (0x000C0000UL)
#define USBHS_HCCHAR14_EPTYPE_0                        (0x00040000UL)
#define USBHS_HCCHAR14_EPTYPE_1                        (0x00080000UL)
#define USBHS_HCCHAR14_EC_POS                          (20U)
#define USBHS_HCCHAR14_EC                              (0x00300000UL)
#define USBHS_HCCHAR14_EC_0                            (0x00100000UL)
#define USBHS_HCCHAR14_EC_1                            (0x00200000UL)
#define USBHS_HCCHAR14_DEVADDR_POS                     (22U)
#define USBHS_HCCHAR14_DEVADDR                         (0x1FC00000UL)
#define USBHS_HCCHAR14_DEVADDR_0                       (0x00400000UL)
#define USBHS_HCCHAR14_DEVADDR_1                       (0x00800000UL)
#define USBHS_HCCHAR14_DEVADDR_2                       (0x01000000UL)
#define USBHS_HCCHAR14_DEVADDR_3                       (0x02000000UL)
#define USBHS_HCCHAR14_DEVADDR_4                       (0x04000000UL)
#define USBHS_HCCHAR14_DEVADDR_5                       (0x08000000UL)
#define USBHS_HCCHAR14_DEVADDR_6                       (0x10000000UL)
#define USBHS_HCCHAR14_ODDFRM_POS                      (29U)
#define USBHS_HCCHAR14_ODDFRM                          (0x20000000UL)
#define USBHS_HCCHAR14_CHDIS_POS                       (30U)
#define USBHS_HCCHAR14_CHDIS                           (0x40000000UL)
#define USBHS_HCCHAR14_CHENA_POS                       (31U)
#define USBHS_HCCHAR14_CHENA                           (0x80000000UL)

/*  Bit definition for USBHS_HCSPLT14 register  */
#define USBHS_HCSPLT14_PRTADDR_POS                     (0U)
#define USBHS_HCSPLT14_PRTADDR                         (0x0000007FUL)
#define USBHS_HCSPLT14_PRTADDR_0                       (0x00000001UL)
#define USBHS_HCSPLT14_PRTADDR_1                       (0x00000002UL)
#define USBHS_HCSPLT14_PRTADDR_2                       (0x00000004UL)
#define USBHS_HCSPLT14_PRTADDR_3                       (0x00000008UL)
#define USBHS_HCSPLT14_PRTADDR_4                       (0x00000010UL)
#define USBHS_HCSPLT14_PRTADDR_5                       (0x00000020UL)
#define USBHS_HCSPLT14_PRTADDR_6                       (0x00000040UL)
#define USBHS_HCSPLT14_HUBADDR_POS                     (7U)
#define USBHS_HCSPLT14_HUBADDR                         (0x00003F80UL)
#define USBHS_HCSPLT14_HUBADDR_0                       (0x00000080UL)
#define USBHS_HCSPLT14_HUBADDR_1                       (0x00000100UL)
#define USBHS_HCSPLT14_HUBADDR_2                       (0x00000200UL)
#define USBHS_HCSPLT14_HUBADDR_3                       (0x00000400UL)
#define USBHS_HCSPLT14_HUBADDR_4                       (0x00000800UL)
#define USBHS_HCSPLT14_HUBADDR_5                       (0x00001000UL)
#define USBHS_HCSPLT14_HUBADDR_6                       (0x00002000UL)
#define USBHS_HCSPLT14_XACTPOS_POS                     (14U)
#define USBHS_HCSPLT14_XACTPOS                         (0x0000C000UL)
#define USBHS_HCSPLT14_XACTPOS_0                       (0x00004000UL)
#define USBHS_HCSPLT14_XACTPOS_1                       (0x00008000UL)
#define USBHS_HCSPLT14_COMPSPLT_POS                    (16U)
#define USBHS_HCSPLT14_COMPSPLT                        (0x00010000UL)
#define USBHS_HCSPLT14_SPLTENA_POS                     (31U)
#define USBHS_HCSPLT14_SPLTENA                         (0x80000000UL)

/*  Bit definition for USBHS_HCINT14 register  */
#define USBHS_HCINT14_XFERCOMPL_POS                    (0U)
#define USBHS_HCINT14_XFERCOMPL                        (0x00000001UL)
#define USBHS_HCINT14_CHHLTD_POS                       (1U)
#define USBHS_HCINT14_CHHLTD                           (0x00000002UL)
#define USBHS_HCINT14_AHBERR_POS                       (2U)
#define USBHS_HCINT14_AHBERR                           (0x00000004UL)
#define USBHS_HCINT14_STALL_POS                        (3U)
#define USBHS_HCINT14_STALL                            (0x00000008UL)
#define USBHS_HCINT14_NAK_POS                          (4U)
#define USBHS_HCINT14_NAK                              (0x00000010UL)
#define USBHS_HCINT14_ACK_POS                          (5U)
#define USBHS_HCINT14_ACK                              (0x00000020UL)
#define USBHS_HCINT14_NYET_POS                         (6U)
#define USBHS_HCINT14_NYET                             (0x00000040UL)
#define USBHS_HCINT14_XACTERR_POS                      (7U)
#define USBHS_HCINT14_XACTERR                          (0x00000080UL)
#define USBHS_HCINT14_BBLERR_POS                       (8U)
#define USBHS_HCINT14_BBLERR                           (0x00000100UL)
#define USBHS_HCINT14_FRMOVRUN_POS                     (9U)
#define USBHS_HCINT14_FRMOVRUN                         (0x00000200UL)
#define USBHS_HCINT14_DATATGLERR_POS                   (10U)
#define USBHS_HCINT14_DATATGLERR                       (0x00000400UL)

/*  Bit definition for USBHS_HCINTMSK14 register  */
#define USBHS_HCINTMSK14_XFERCOMPLMSK_POS              (0U)
#define USBHS_HCINTMSK14_XFERCOMPLMSK                  (0x00000001UL)
#define USBHS_HCINTMSK14_CHHLTDMSK_POS                 (1U)
#define USBHS_HCINTMSK14_CHHLTDMSK                     (0x00000002UL)
#define USBHS_HCINTMSK14_AHBERRMSK_POS                 (2U)
#define USBHS_HCINTMSK14_AHBERRMSK                     (0x00000004UL)
#define USBHS_HCINTMSK14_STALLMSK_POS                  (3U)
#define USBHS_HCINTMSK14_STALLMSK                      (0x00000008UL)
#define USBHS_HCINTMSK14_NAKMSK_POS                    (4U)
#define USBHS_HCINTMSK14_NAKMSK                        (0x00000010UL)
#define USBHS_HCINTMSK14_ACKMSK_POS                    (5U)
#define USBHS_HCINTMSK14_ACKMSK                        (0x00000020UL)
#define USBHS_HCINTMSK14_NYETMSK_POS                   (6U)
#define USBHS_HCINTMSK14_NYETMSK                       (0x00000040UL)
#define USBHS_HCINTMSK14_XACTERRMSK_POS                (7U)
#define USBHS_HCINTMSK14_XACTERRMSK                    (0x00000080UL)
#define USBHS_HCINTMSK14_BBLERRMSK_POS                 (8U)
#define USBHS_HCINTMSK14_BBLERRMSK                     (0x00000100UL)
#define USBHS_HCINTMSK14_FRMOVRUNMSK_POS               (9U)
#define USBHS_HCINTMSK14_FRMOVRUNMSK                   (0x00000200UL)
#define USBHS_HCINTMSK14_DATATGLERRMSK_POS             (10U)
#define USBHS_HCINTMSK14_DATATGLERRMSK                 (0x00000400UL)

