levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_HCTSIZ14 register  */
#define USBHS_HCTSIZ14_XFERSIZE_POS                    (0U)
#define USBHS_HCTSIZ14_XFERSIZE                        (0x0007FFFFUL)
#define USBHS_HCTSIZ14_XFERSIZE_0                      (0x00000001UL)
#define USBHS_HCTSIZ14_XFERSIZE_1                      (0x00000002UL)
#define USBHS_HCTSIZ14_XFERSIZE_2                      (0x00000004UL)
#define USBHS_HCTSIZ14_XFERSIZE_3                      (0x00000008UL)
#define USBHS_HCTSIZ14_XFERSIZE_4                      (0x00000010UL)
#define USBHS_HCTSIZ14_XFERSIZE_5                      (0x00000020UL)
#define USBHS_HCTSIZ14_XFERSIZE_6                      (0x00000040UL)
#define USBHS_HCTSIZ14_XFERSIZE_7                      (0x00000080UL)
#define USBHS_HCTSIZ14_XFERSIZE_8                      (0x00000100UL)
#define USBHS_HCTSIZ14_XFERSIZE_9                      (0x00000200UL)
#define USBHS_HCTSIZ14_XFERSIZE_10                     (0x00000400UL)
#define USBHS_HCTSIZ14_XFERSIZE_11                     (0x00000800UL)
#define USBHS_HCTSIZ14_XFERSIZE_12                     (0x00001000UL)
#define USBHS_HCTSIZ14_XFERSIZE_13                     (0x00002000UL)
#define USBHS_HCTSIZ14_XFERSIZE_14                     (0x00004000UL)
#define USBHS_HCTSIZ14_XFERSIZE_15                     (0x00008000UL)
#define USBHS_HCTSIZ14_XFERSIZE_16                     (0x00010000UL)
#define USBHS_HCTSIZ14_XFERSIZE_17                     (0x00020000UL)
#define USBHS_HCTSIZ14_XFERSIZE_18                     (0x00040000UL)
#define USBHS_HCTSIZ14_PKTCNT_POS                      (19U)
#define USBHS_HCTSIZ14_PKTCNT                          (0x1FF80000UL)
#define USBHS_HCTSIZ14_PKTCNT_0                        (0x00080000UL)
#define USBHS_HCTSIZ14_PKTCNT_1                        (0x00100000UL)
#define USBHS_HCTSIZ14_PKTCNT_2                        (0x00200000UL)
#define USBHS_HCTSIZ14_PKTCNT_3                        (0x00400000UL)
#define USBHS_HCTSIZ14_PKTCNT_4                        (0x00800000UL)
#define USBHS_HCTSIZ14_PKTCNT_5                        (0x01000000UL)
#define USBHS_HCTSIZ14_PKTCNT_6                        (0x02000000UL)
#define USBHS_HCTSIZ14_PKTCNT_7                        (0x04000000UL)
#define USBHS_HCTSIZ14_PKTCNT_8                        (0x08000000UL)
#define USBHS_HCTSIZ14_PKTCNT_9                        (0x10000000UL)
#define USBHS_HCTSIZ14_PID_POS                         (29U)
#define USBHS_HCTSIZ14_PID                             (0x60000000UL)
#define USBHS_HCTSIZ14_PID_0                           (0x20000000UL)
#define USBHS_HCTSIZ14_PID_1                           (0x40000000UL)
#define USBHS_HCTSIZ14_DOPNG_POS                       (31U)
#define USBHS_HCTSIZ14_DOPNG                           (0x80000000UL)

/*  Bit definition for USBHS_HCDMA14 register  */
#define USBHS_HCDMA14                                  (0xFFFFFFFFUL)

/*  Bit definition for USBHS_HCCHAR15 register  */
#define USBHS_HCCHAR15_MPS_POS                         (0U)
#define USBHS_HCCHAR15_MPS                             (0x000007FFUL)
#define USBHS_HCCHAR15_MPS_0                           (0x00000001UL)
#define USBHS_HCCHAR15_MPS_1                           (0x00000002UL)
#define USBHS_HCCHAR15_MPS_2                           (0x00000004UL)
#define USBHS_HCCHAR15_MPS_3                           (0x00000008UL)
#define USBHS_HCCHAR15_MPS_4                           (0x00000010UL)
#define USBHS_HCCHAR15_MPS_5                           (0x00000020UL)
#define USBHS_HCCHAR15_MPS_6                           (0x00000040UL)
#define USBHS_HCCHAR15_MPS_7                           (0x00000080UL)
#define USBHS_HCCHAR15_MPS_8                           (0x00000100UL)
#define USBHS_HCCHAR15_MPS_9                           (0x00000200UL)
#define USBHS_HCCHAR15_MPS_10                          (0x00000400UL)
#define USBHS_HCCHAR15_EPNUM_POS                       (11U)
#define USBHS_HCCHAR15_EPNUM                           (0x00007800UL)
#define USBHS_HCCHAR15_EPNUM_0                         (0x00000800UL)
#define USBHS_HCCHAR15_EPNUM_1                         (0x00001000UL)
#define USBHS_HCCHAR15_EPNUM_2                         (0x00002000UL)
#define USBHS_HCCHAR15_EPNUM_3                         (0x00004000UL)
#define USBHS_HCCHAR15_EPDIR_POS                       (15U)
#define USBHS_HCCHAR15_EPDIR                           (0x00008000UL)
#define USBHS_HCCHAR15_LSPDDEV_POS                     (17U)
#define USBHS_HCCHAR15_LSPDDEV                         (0x00020000UL)
#define USBHS_HCCHAR15_EPTYPE_POS                      (18U)
#define USBHS_HCCHAR15_EPTYPE                          (0x000C0000UL)
#define USBHS_HCCHAR15_EPTYPE_0                        (0x00040000UL)
#define USBHS_HCCHAR15_EPTYPE_1                        (0x00080000UL)
#define USBHS_HCCHAR15_EC_POS                          (20U)
#define USBHS_HCCHAR15_EC                              (0x00300000UL)
#define USBHS_HCCHAR15_EC_0                            (0x00100000UL)
#define USBHS_HCCHAR15_EC_1                            (0x00200000UL)
#define USBHS_HCCHAR15_DEVADDR_POS                     (22U)
#define USBHS_HCCHAR15_DEVADDR                         (0x1FC00000UL)
#define USBHS_HCCHAR15_DEVADDR_0                       (0x00400000UL)
#define USBHS_HCCHAR15_DEVADDR_1                       (0x00800000UL)
#define USBHS_HCCHAR15_DEVADDR_2                       (0x01000000UL)
#define USBHS_HCCHAR15_DEVADDR_3                       (0x02000000UL)
#define USBHS_HCCHAR15_DEVADDR_4                       (0x04000000UL)
#define USBHS_HCCHAR15_DEVADDR_5                       (0x08000000UL)
#define USBHS_HCCHAR15_DEVADDR_6                       (0x10000000UL)
#define USBHS_HCCHAR15_ODDFRM_POS                      (29U)
#define USBHS_HCCHAR15_ODDFRM                          (0x20000000UL)
#define USBHS_HCCHAR15_CHDIS_POS                       (30U)
#define USBHS_HCCHAR15_CHDIS                           (0x40000000UL)
#define USBHS_HCCHAR15_CHENA_POS                       (31U)
#define USBHS_HCCHAR15_CHENA                           (0x80000000UL)

