levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_HCSPLT15 register  */
#define USBHS_HCSPLT15_PRTADDR_POS                     (0U)
#define USBHS_HCSPLT15_PRTADDR                         (0x0000007FUL)
#define USBHS_HCSPLT15_PRTADDR_0                       (0x00000001UL)
#define USBHS_HCSPLT15_PRTADDR_1                       (0x00000002UL)
#define USBHS_HCSPLT15_PRTADDR_2                       (0x00000004UL)
#define USBHS_HCSPLT15_PRTADDR_3                       (0x00000008UL)
#define USBHS_HCSPLT15_PRTADDR_4                       (0x00000010UL)
#define USBHS_HCSPLT15_PRTADDR_5                       (0x00000020UL)
#define USBHS_HCSPLT15_PRTADDR_6                       (0x00000040UL)
#define USBHS_HCSPLT15_HUBADDR_POS                     (7U)
#define USBHS_HCSPLT15_HUBADDR                         (0x00003F80UL)
#define USBHS_HCSPLT15_HUBADDR_0                       (0x00000080UL)
#define USBHS_HCSPLT15_HUBADDR_1                       (0x00000100UL)
#define USBHS_HCSPLT15_HUBADDR_2                       (0x00000200UL)
#define USBHS_HCSPLT15_HUBADDR_3                       (0x00000400UL)
#define USBHS_HCSPLT15_HUBADDR_4                       (0x00000800UL)
#define USBHS_HCSPLT15_HUBADDR_5                       (0x00001000UL)
#define USBHS_HCSPLT15_HUBADDR_6                       (0x00002000UL)
#define USBHS_HCSPLT15_XACTPOS_POS                     (14U)
#define USBHS_HCSPLT15_XACTPOS                         (0x0000C000UL)
#define USBHS_HCSPLT15_XACTPOS_0                       (0x00004000UL)
#define USBHS_HCSPLT15_XACTPOS_1                       (0x00008000UL)
#define USBHS_HCSPLT15_COMPSPLT_POS                    (16U)
#define USBHS_HCSPLT15_COMPSPLT                        (0x00010000UL)
#define USBHS_HCSPLT15_SPLTENA_POS                     (31U)
#define USBHS_HCSPLT15_SPLTENA                         (0x80000000UL)

/*  Bit definition for USBHS_HCINT15 register  */
#define USBHS_HCINT15_XFERCOMPL_POS                    (0U)
#define USBHS_HCINT15_XFERCOMPL                        (0x00000001UL)
#define USBHS_HCINT15_CHHLTD_POS                       (1U)
#define USBHS_HCINT15_CHHLTD                           (0x00000002UL)
#define USBHS_HCINT15_AHBERR_POS                       (2U)
#define USBHS_HCINT15_AHBERR                           (0x00000004UL)
#define USBHS_HCINT15_STALL_POS                        (3U)
#define USBHS_HCINT15_STALL                            (0x00000008UL)
#define USBHS_HCINT15_NAK_POS                          (4U)
#define USBHS_HCINT15_NAK                              (0x00000010UL)
#define USBHS_HCINT15_ACK_POS                          (5U)
#define USBHS_HCINT15_ACK                              (0x00000020UL)
#define USBHS_HCINT15_NYET_POS                         (6U)
#define USBHS_HCINT15_NYET                             (0x00000040UL)
#define USBHS_HCINT15_XACTERR_POS                      (7U)
#define USBHS_HCINT15_XACTERR                          (0x00000080UL)
#define USBHS_HCINT15_BBLERR_POS                       (8U)
#define USBHS_HCINT15_BBLERR                           (0x00000100UL)
#define USBHS_HCINT15_FRMOVRUN_POS                     (9U)
#define USBHS_HCINT15_FRMOVRUN                         (0x00000200UL)
#define USBHS_HCINT15_DATATGLERR_POS                   (10U)
#define USBHS_HCINT15_DATATGLERR                       (0x00000400UL)

/*  Bit definition for USBHS_HCINTMSK15 register  */
#define USBHS_HCINTMSK15_XFERCOMPLMSK_POS              (0U)
#define USBHS_HCINTMSK15_XFERCOMPLMSK                  (0x00000001UL)
#define USBHS_HCINTMSK15_CHHLTDMSK_POS                 (1U)
#define USBHS_HCINTMSK15_CHHLTDMSK                     (0x00000002UL)
#define USBHS_HCINTMSK15_AHBERRMSK_POS                 (2U)
#define USBHS_HCINTMSK15_AHBERRMSK                     (0x00000004UL)
#define USBHS_HCINTMSK15_STALLMSK_POS                  (3U)
#define USBHS_HCINTMSK15_STALLMSK                      (0x00000008UL)
#define USBHS_HCINTMSK15_NAKMSK_POS                    (4U)
#define USBHS_HCINTMSK15_NAKMSK                        (0x00000010UL)
#define USBHS_HCINTMSK15_ACKMSK_POS                    (5U)
#define USBHS_HCINTMSK15_ACKMSK                        (0x00000020UL)
#define USBHS_HCINTMSK15_NYETMSK_POS                   (6U)
#define USBHS_HCINTMSK15_NYETMSK                       (0x00000040UL)
#define USBHS_HCINTMSK15_XACTERRMSK_POS                (7U)
#define USBHS_HCINTMSK15_XACTERRMSK                    (0x00000080UL)
#define USBHS_HCINTMSK15_BBLERRMSK_POS                 (8U)
#define USBHS_HCINTMSK15_BBLERRMSK                     (0x00000100UL)
#define USBHS_HCINTMSK15_FRMOVRUNMSK_POS               (9U)
#define USBHS_HCINTMSK15_FRMOVRUNMSK                   (0x00000200UL)
#define USBHS_HCINTMSK15_DATATGLERRMSK_POS             (10U)
#define USBHS_HCINTMSK15_DATATGLERRMSK                 (0x00000400UL)

/*  Bit definition for USBHS_HCTSIZ15 register  */
#define USBHS_HCTSIZ15_XFERSIZE_POS                    (0U)
#define USBHS_HCTSIZ15_XFERSIZE                        (0x0007FFFFUL)
#define USBHS_HCTSIZ15_XFERSIZE_0                      (0x00000001UL)
#define USBHS_HCTSIZ15_XFERSIZE_1                      (0x00000002UL)
#define USBHS_HCTSIZ15_XFERSIZE_2                      (0x00000004UL)
#define USBHS_HCTSIZ15_XFERSIZE_3                      (0x00000008UL)
#define USBHS_HCTSIZ15_XFERSIZE_4                      (0x00000010UL)
#define USBHS_HCTSIZ15_XFERSIZE_5                      (0x00000020UL)
#define USBHS_HCTSIZ15_XFERSIZE_6                      (0x00000040UL)
#define USBHS_HCTSIZ15_XFERSIZE_7                      (0x00000080UL)
#define USBHS_HCTSIZ15_XFERSIZE_8                      (0x00000100UL)
#define USBHS_HCTSIZ15_XFERSIZE_9                      (0x00000200UL)
#define USBHS_HCTSIZ15_XFERSIZE_10                     (0x00000400UL)
#define USBHS_HCTSIZ15_XFERSIZE_11                     (0x00000800UL)
#define USBHS_HCTSIZ15_XFERSIZE_12                     (0x00001000UL)
#define USBHS_HCTSIZ15_XFERSIZE_13                     (0x00002000UL)
#define USBHS_HCTSIZ15_XFERSIZE_14                     (0x00004000UL)
#define USBHS_HCTSIZ15_XFERSIZE_15                     (0x00008000UL)
#define USBHS_HCTSIZ15_XFERSIZE_16                     (0x00010000UL)
#define USBHS_HCTSIZ15_XFERSIZE_17                     (0x00020000UL)
#define USBHS_HCTSIZ15_XFERSIZE_18                     (0x00040000UL)
#define USBHS_HCTSIZ15_PKTCNT_POS                      (19U)
#define USBHS_HCTSIZ15_PKTCNT                          (0x1FF80000UL)
#define USBHS_HCTSIZ15_PKTCNT_0                        (0x00080000UL)
#define USBHS_HCTSIZ15_PKTCNT_1                        (0x00100000UL)
#define USBHS_HCTSIZ15_PKTCNT_2                        (0x00200000UL)
#define USBHS_HCTSIZ15_PKTCNT_3                        (0x00400000UL)
#define USBHS_HCTSIZ15_PKTCNT_4                        (0x00800000UL)
#define USBHS_HCTSIZ15_PKTCNT_5                        (0x01000000UL)
#define USBHS_HCTSIZ15_PKTCNT_6                        (0x02000000UL)
#define USBHS_HCTSIZ15_PKTCNT_7                        (0x04000000UL)
#define USBHS_HCTSIZ15_PKTCNT_8                        (0x08000000UL)
#define USBHS_HCTSIZ15_PKTCNT_9                        (0x10000000UL)
#define USBHS_HCTSIZ15_PID_POS                         (29U)
#define USBHS_HCTSIZ15_PID                             (0x60000000UL)
#define USBHS_HCTSIZ15_PID_0                           (0x20000000UL)
#define USBHS_HCTSIZ15_PID_1                           (0x40000000UL)
#define USBHS_HCTSIZ15_DOPNG_POS                       (31U)
#define USBHS_HCTSIZ15_DOPNG                           (0x80000000UL)

/*  Bit definition for USBHS_HCDMA15 register  */
#define USBHS_HCDMA15                                  (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DCFG register  */
#define USBHS_DCFG_DEVSPD_POS                          (0U)
#define USBHS_DCFG_DEVSPD                              (0x00000003UL)
#define USBHS_DCFG_DEVSPD_0                            (0x00000001UL)
#define USBHS_DCFG_DEVSPD_1                            (0x00000002UL)
#define USBHS_DCFG_NZSTSOUTHSHK_POS                    (2U)
#define USBHS_DCFG_NZSTSOUTHSHK                        (0x00000004UL)
#define USBHS_DCFG_ENA32KHZSUSP_POS                    (3U)
#define USBHS_DCFG_ENA32KHZSUSP                        (0x00000008UL)
#define USBHS_DCFG_DEVADDR_POS                         (4U)
#define USBHS_DCFG_DEVADDR                             (0x000007F0UL)
#define USBHS_DCFG_DEVADDR_0                           (0x00000010UL)
#define USBHS_DCFG_DEVADDR_1                           (0x00000020UL)
#define USBHS_DCFG_DEVADDR_2                           (0x00000040UL)
#define USBHS_DCFG_DEVADDR_3                           (0x00000080UL)
#define USBHS_DCFG_DEVADDR_4                           (0x00000100UL)
#define USBHS_DCFG_DEVADDR_5                           (0x00000200UL)
#define USBHS_DCFG_DEVADDR_6                           (0x00000400UL)
#define USBHS_DCFG_PERFRINT_POS                        (11U)
#define USBHS_DCFG_PERFRINT                            (0x00001800UL)
#define USBHS_DCFG_PERFRINT_0                          (0x00000800UL)
#define USBHS_DCFG_PERFRINT_1                          (0x00001000UL)
#define USBHS_DCFG_XCVRDLY_POS                         (14U)
#define USBHS_DCFG_XCVRDLY                             (0x00004000UL)
#define USBHS_DCFG_ERRATICINTMSK_POS                   (15U)
#define USBHS_DCFG_ERRATICINTMSK                       (0x00008000UL)
#define USBHS_DCFG_IPGISOCSUPT_POS                     (17U)
#define USBHS_DCFG_IPGISOCSUPT                         (0x00020000UL)
#define USBHS_DCFG_PERSCHINTVL_POS                     (24U)
#define USBHS_DCFG_PERSCHINTVL                         (0x03000000UL)
#define USBHS_DCFG_PERSCHINTVL_0                       (0x01000000UL)
#define USBHS_DCFG_PERSCHINTVL_1                       (0x02000000UL)
#define USBHS_DCFG_RESVALID_POS                        (26U)
#define USBHS_DCFG_RESVALID                            (0xFC000000UL)
#define USBHS_DCFG_RESVALID_0                          (0x04000000UL)
#define USBHS_DCFG_RESVALID_1                          (0x08000000UL)
#define USBHS_DCFG_RESVALID_2                          (0x10000000UL)
#define USBHS_DCFG_RESVALID_3                          (0x20000000UL)
#define USBHS_DCFG_RESVALID_4                          (0x40000000UL)
#define USBHS_DCFG_RESVALID_5                          (0x80000000UL)

