levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DCTL register  */
#define USBHS_DCTL_RMTWKUPSIG_POS                      (0U)
#define USBHS_DCTL_RMTWKUPSIG                          (0x00000001UL)
#define USBHS_DCTL_SFTDISCON_POS                       (1U)
#define USBHS_DCTL_SFTDISCON                           (0x00000002UL)
#define USBHS_DCTL_GNPINNAKSTS_POS                     (2U)
#define USBHS_DCTL_GNPINNAKSTS                         (0x00000004UL)
#define USBHS_DCTL_GOUTNAKSTS_POS                      (3U)
#define USBHS_DCTL_GOUTNAKSTS                          (0x00000008UL)
#define USBHS_DCTL_TSTCTL_POS                          (4U)
#define USBHS_DCTL_TSTCTL                              (0x00000070UL)
#define USBHS_DCTL_TSTCTL_0                            (0x00000010UL)
#define USBHS_DCTL_TSTCTL_1                            (0x00000020UL)
#define USBHS_DCTL_TSTCTL_2                            (0x00000040UL)
#define USBHS_DCTL_SGNPINNAK_POS                       (7U)
#define USBHS_DCTL_SGNPINNAK                           (0x00000080UL)
#define USBHS_DCTL_CGNPINNAK_POS                       (8U)
#define USBHS_DCTL_CGNPINNAK                           (0x00000100UL)
#define USBHS_DCTL_SGOUTNAK_POS                        (9U)
#define USBHS_DCTL_SGOUTNAK                            (0x00000200UL)
#define USBHS_DCTL_CGOUTNAK_POS                        (10U)
#define USBHS_DCTL_CGOUTNAK                            (0x00000400UL)
#define USBHS_DCTL_PWRONPRGDONE_POS                    (11U)
#define USBHS_DCTL_PWRONPRGDONE                        (0x00000800UL)
#define USBHS_DCTL_IGNRFRMNUM_POS                      (15U)
#define USBHS_DCTL_IGNRFRMNUM                          (0x00008000UL)
#define USBHS_DCTL_NAKONBBLE_POS                       (16U)
#define USBHS_DCTL_NAKONBBLE                           (0x00010000UL)
#define USBHS_DCTL_DEEPSLEEPBESLREJECT_POS             (18U)
#define USBHS_DCTL_DEEPSLEEPBESLREJECT                 (0x00040000UL)
#define USBHS_DCTL_SERVINT_POS                         (19U)
#define USBHS_DCTL_SERVINT                             (0x00080000UL)

/*  Bit definition for USBHS_DSTS register  */
#define USBHS_DSTS_SUSPSTS_POS                         (0U)
#define USBHS_DSTS_SUSPSTS                             (0x00000001UL)
#define USBHS_DSTS_ENUMSPD_POS                         (1U)
#define USBHS_DSTS_ENUMSPD                             (0x00000006UL)
#define USBHS_DSTS_ENUMSPD_0                           (0x00000002UL)
#define USBHS_DSTS_ENUMSPD_1                           (0x00000004UL)
#define USBHS_DSTS_ERRTICERR_POS                       (3U)
#define USBHS_DSTS_ERRTICERR                           (0x00000008UL)
#define USBHS_DSTS_SOFFN_POS                           (8U)
#define USBHS_DSTS_SOFFN                               (0x003FFF00UL)
#define USBHS_DSTS_SOFFN_0                             (0x00000100UL)
#define USBHS_DSTS_SOFFN_1                             (0x00000200UL)
#define USBHS_DSTS_SOFFN_2                             (0x00000400UL)
#define USBHS_DSTS_SOFFN_3                             (0x00000800UL)
#define USBHS_DSTS_SOFFN_4                             (0x00001000UL)
#define USBHS_DSTS_SOFFN_5                             (0x00002000UL)
#define USBHS_DSTS_SOFFN_6                             (0x00004000UL)
#define USBHS_DSTS_SOFFN_7                             (0x00008000UL)
#define USBHS_DSTS_SOFFN_8                             (0x00010000UL)
#define USBHS_DSTS_SOFFN_9                             (0x00020000UL)
#define USBHS_DSTS_SOFFN_10                            (0x00040000UL)
#define USBHS_DSTS_SOFFN_11                            (0x00080000UL)
#define USBHS_DSTS_SOFFN_12                            (0x00100000UL)
#define USBHS_DSTS_SOFFN_13                            (0x00200000UL)
#define USBHS_DSTS_DEVLNSTS_POS                        (22U)
#define USBHS_DSTS_DEVLNSTS                            (0x00C00000UL)
#define USBHS_DSTS_DEVLNSTS_0                          (0x00400000UL)
#define USBHS_DSTS_DEVLNSTS_1                          (0x00800000UL)

/*  Bit definition for USBHS_DIEPMSK register  */
#define USBHS_DIEPMSK_XFERCOMPLMSK_POS                 (0U)
#define USBHS_DIEPMSK_XFERCOMPLMSK                     (0x00000001UL)
#define USBHS_DIEPMSK_EPDISBLDMSK_POS                  (1U)
#define USBHS_DIEPMSK_EPDISBLDMSK                      (0x00000002UL)
#define USBHS_DIEPMSK_AHBERRMSK_POS                    (2U)
#define USBHS_DIEPMSK_AHBERRMSK                        (0x00000004UL)
#define USBHS_DIEPMSK_TIMEOUTMSK_POS                   (3U)
#define USBHS_DIEPMSK_TIMEOUTMSK                       (0x00000008UL)
#define USBHS_DIEPMSK_INTKNTXFEMPMSK_POS               (4U)
#define USBHS_DIEPMSK_INTKNTXFEMPMSK                   (0x00000010UL)
#define USBHS_DIEPMSK_INTKNEPMISMSK_POS                (5U)
#define USBHS_DIEPMSK_INTKNEPMISMSK                    (0x00000020UL)
#define USBHS_DIEPMSK_INEPNAKEFFMSK_POS                (6U)
#define USBHS_DIEPMSK_INEPNAKEFFMSK                    (0x00000040UL)
#define USBHS_DIEPMSK_TXFIFOUNDRNMSK_POS               (8U)
#define USBHS_DIEPMSK_TXFIFOUNDRNMSK                   (0x00000100UL)
#define USBHS_DIEPMSK_NAKMSK_POS                       (13U)
#define USBHS_DIEPMSK_NAKMSK                           (0x00002000UL)

/*  Bit definition for USBHS_DOEPMSK register  */
#define USBHS_DOEPMSK_XFERCOMPLMSK_POS                 (0U)
#define USBHS_DOEPMSK_XFERCOMPLMSK                     (0x00000001UL)
#define USBHS_DOEPMSK_EPDISBLDMSK_POS                  (1U)
#define USBHS_DOEPMSK_EPDISBLDMSK                      (0x00000002UL)
#define USBHS_DOEPMSK_AHBERRMSK_POS                    (2U)
#define USBHS_DOEPMSK_AHBERRMSK                        (0x00000004UL)
#define USBHS_DOEPMSK_SETUPMSK_POS                     (3U)
#define USBHS_DOEPMSK_SETUPMSK                         (0x00000008UL)
#define USBHS_DOEPMSK_OUTTKNEPDISMSK_POS               (4U)
#define USBHS_DOEPMSK_OUTTKNEPDISMSK                   (0x00000010UL)
#define USBHS_DOEPMSK_STSPHSERCVDMSK_POS               (5U)
#define USBHS_DOEPMSK_STSPHSERCVDMSK                   (0x00000020UL)
#define USBHS_DOEPMSK_BACK2BACKSETUP_POS               (6U)
#define USBHS_DOEPMSK_BACK2BACKSETUP                   (0x00000040UL)
#define USBHS_DOEPMSK_OUTPKTERRMSK_POS                 (8U)
#define USBHS_DOEPMSK_OUTPKTERRMSK                     (0x00000100UL)
#define USBHS_DOEPMSK_BBLEERRMSK_POS                   (12U)
#define USBHS_DOEPMSK_BBLEERRMSK                       (0x00001000UL)
#define USBHS_DOEPMSK_NAKMSK_POS                       (13U)
#define USBHS_DOEPMSK_NAKMSK                           (0x00002000UL)
#define USBHS_DOEPMSK_NYETMSK_POS                      (14U)
#define USBHS_DOEPMSK_NYETMSK                          (0x00004000UL)

/*  Bit definition for USBHS_DAINT register  */
#define USBHS_DAINT_INEPINT0_POS                       (0U)
#define USBHS_DAINT_INEPINT0                           (0x00000001UL)
#define USBHS_DAINT_INEPINT1_POS                       (1U)
#define USBHS_DAINT_INEPINT1                           (0x00000002UL)
#define USBHS_DAINT_INEPINT2_POS                       (2U)
#define USBHS_DAINT_INEPINT2                           (0x00000004UL)
#define USBHS_DAINT_INEPINT3_POS                       (3U)
#define USBHS_DAINT_INEPINT3                           (0x00000008UL)
#define USBHS_DAINT_INEPINT4_POS                       (4U)
#define USBHS_DAINT_INEPINT4                           (0x00000010UL)
#define USBHS_DAINT_INEPINT5_POS                       (5U)
#define USBHS_DAINT_INEPINT5                           (0x00000020UL)
#define USBHS_DAINT_INEPINT6_POS                       (6U)
#define USBHS_DAINT_INEPINT6                           (0x00000040UL)
#define USBHS_DAINT_INEPINT7_POS                       (7U)
#define USBHS_DAINT_INEPINT7                           (0x00000080UL)
#define USBHS_DAINT_INEPINT8_POS                       (8U)
#define USBHS_DAINT_INEPINT8                           (0x00000100UL)
#define USBHS_DAINT_INEPINT9_POS                       (9U)
#define USBHS_DAINT_INEPINT9                           (0x00000200UL)
#define USBHS_DAINT_INEPINT10_POS                      (10U)
#define USBHS_DAINT_INEPINT10                          (0x00000400UL)
#define USBHS_DAINT_INEPINT11_POS                      (11U)
#define USBHS_DAINT_INEPINT11                          (0x00000800UL)
#define USBHS_DAINT_INEPINT12_POS                      (12U)
#define USBHS_DAINT_INEPINT12                          (0x00001000UL)
#define USBHS_DAINT_INEPINT13_POS                      (13U)
#define USBHS_DAINT_INEPINT13                          (0x00002000UL)
#define USBHS_DAINT_INEPINT14_POS                      (14U)
#define USBHS_DAINT_INEPINT14                          (0x00004000UL)
#define USBHS_DAINT_INEPINT15_POS                      (15U)
#define USBHS_DAINT_INEPINT15                          (0x00008000UL)
#define USBHS_DAINT_OUTEPINT0_POS                      (16U)
#define USBHS_DAINT_OUTEPINT0                          (0x00010000UL)
#define USBHS_DAINT_OUTEPINT1_POS                      (17U)
#define USBHS_DAINT_OUTEPINT1                          (0x00020000UL)
#define USBHS_DAINT_OUTEPINT2_POS                      (18U)
#define USBHS_DAINT_OUTEPINT2                          (0x00040000UL)
#define USBHS_DAINT_OUTEPINT3_POS                      (19U)
#define USBHS_DAINT_OUTEPINT3                          (0x00080000UL)
#define USBHS_DAINT_OUTEPINT4_POS                      (20U)
#define USBHS_DAINT_OUTEPINT4                          (0x00100000UL)
#define USBHS_DAINT_OUTEPINT5_POS                      (21U)
#define USBHS_DAINT_OUTEPINT5                          (0x00200000UL)
#define USBHS_DAINT_OUTEPINT6_POS                      (22U)
#define USBHS_DAINT_OUTEPINT6                          (0x00400000UL)
#define USBHS_DAINT_OUTEPINT7_POS                      (23U)
#define USBHS_DAINT_OUTEPINT7                          (0x00800000UL)
#define USBHS_DAINT_OUTEPINT8_POS                      (24U)
#define USBHS_DAINT_OUTEPINT8                          (0x01000000UL)
#define USBHS_DAINT_OUTEPINT9_POS                      (25U)
#define USBHS_DAINT_OUTEPINT9                          (0x02000000UL)
#define USBHS_DAINT_OUTEPINT10_POS                     (26U)
#define USBHS_DAINT_OUTEPINT10                         (0x04000000UL)
#define USBHS_DAINT_OUTEPINT11_POS                     (27U)
#define USBHS_DAINT_OUTEPINT11                         (0x08000000UL)
#define USBHS_DAINT_OUTEPINT12_POS                     (28U)
#define USBHS_DAINT_OUTEPINT12                         (0x10000000UL)
#define USBHS_DAINT_OUTEPINT13_POS                     (29U)
#define USBHS_DAINT_OUTEPINT13                         (0x20000000UL)
#define USBHS_DAINT_OUTEPINT14_POS                     (30U)
#define USBHS_DAINT_OUTEPINT14                         (0x40000000UL)
#define USBHS_DAINT_OUTEPINT15_POS                     (31U)
#define USBHS_DAINT_OUTEPINT15                         (0x80000000UL)

/*  Bit definition for USBHS_DAINTMSK register  */
#define USBHS_DAINTMSK_INEPMSK0_POS                    (0U)
#define USBHS_DAINTMSK_INEPMSK0                        (0x00000001UL)
#define USBHS_DAINTMSK_INEPMSK1_POS                    (1U)
#define USBHS_DAINTMSK_INEPMSK1                        (0x00000002UL)
#define USBHS_DAINTMSK_INEPMSK2_POS                    (2U)
#define USBHS_DAINTMSK_INEPMSK2                        (0x00000004UL)
#define USBHS_DAINTMSK_INEPMSK3_POS                    (3U)
#define USBHS_DAINTMSK_INEPMSK3                        (0x00000008UL)
#define USBHS_DAINTMSK_INEPMSK4_POS                    (4U)
#define USBHS_DAINTMSK_INEPMSK4                        (0x00000010UL)
#define USBHS_DAINTMSK_INEPMSK5_POS                    (5U)
#define USBHS_DAINTMSK_INEPMSK5                        (0x00000020UL)
#define USBHS_DAINTMSK_INEPMSK6_POS                    (6U)
#define USBHS_DAINTMSK_INEPMSK6                        (0x00000040UL)
#define USBHS_DAINTMSK_INEPMSK7_POS                    (7U)
#define USBHS_DAINTMSK_INEPMSK7                        (0x00000080UL)
#define USBHS_DAINTMSK_INEPMSK8_POS                    (8U)
#define USBHS_DAINTMSK_INEPMSK8                        (0x00000100UL)
#define USBHS_DAINTMSK_INEPMSK9_POS                    (9U)
#define USBHS_DAINTMSK_INEPMSK9                        (0x00000200UL)
#define USBHS_DAINTMSK_INEPMSK10_POS                   (10U)
#define USBHS_DAINTMSK_INEPMSK10                       (0x00000400UL)
#define USBHS_DAINTMSK_INEPMSK11_POS                   (11U)
#define USBHS_DAINTMSK_INEPMSK11                       (0x00000800UL)
#define USBHS_DAINTMSK_INEPMSK12_POS                   (12U)
#define USBHS_DAINTMSK_INEPMSK12                       (0x00001000UL)
#define USBHS_DAINTMSK_INEPMSK13_POS                   (13U)
#define USBHS_DAINTMSK_INEPMSK13                       (0x00002000UL)
#define USBHS_DAINTMSK_INEPMSK14_POS                   (14U)
#define USBHS_DAINTMSK_INEPMSK14                       (0x00004000UL)
#define USBHS_DAINTMSK_INEPMSK15_POS                   (15U)
#define USBHS_DAINTMSK_INEPMSK15                       (0x00008000UL)
#define USBHS_DAINTMSK_OUTEPMSK0_POS                   (16U)
#define USBHS_DAINTMSK_OUTEPMSK0                       (0x00010000UL)
#define USBHS_DAINTMSK_OUTEPMSK1_POS                   (17U)
#define USBHS_DAINTMSK_OUTEPMSK1                       (0x00020000UL)
#define USBHS_DAINTMSK_OUTEPMSK2_POS                   (18U)
#define USBHS_DAINTMSK_OUTEPMSK2                       (0x00040000UL)
#define USBHS_DAINTMSK_OUTEPMSK3_POS                   (19U)
#define USBHS_DAINTMSK_OUTEPMSK3                       (0x00080000UL)
#define USBHS_DAINTMSK_OUTEPMSK4_POS                   (20U)
#define USBHS_DAINTMSK_OUTEPMSK4                       (0x00100000UL)
#define USBHS_DAINTMSK_OUTEPMSK5_POS                   (21U)
#define USBHS_DAINTMSK_OUTEPMSK5                       (0x00200000UL)
#define USBHS_DAINTMSK_OUTEPMSK6_POS                   (22U)
#define USBHS_DAINTMSK_OUTEPMSK6                       (0x00400000UL)
#define USBHS_DAINTMSK_OUTEPMSK7_POS                   (23U)
#define USBHS_DAINTMSK_OUTEPMSK7                       (0x00800000UL)
#define USBHS_DAINTMSK_OUTEPMSK8_POS                   (24U)
#define USBHS_DAINTMSK_OUTEPMSK8                       (0x01000000UL)
#define USBHS_DAINTMSK_OUTEPMSK9_POS                   (25U)
#define USBHS_DAINTMSK_OUTEPMSK9                       (0x02000000UL)
#define USBHS_DAINTMSK_OUTEPMSK10_POS                  (26U)
#define USBHS_DAINTMSK_OUTEPMSK10                      (0x04000000UL)
#define USBHS_DAINTMSK_OUTEPMSK11_POS                  (27U)
#define USBHS_DAINTMSK_OUTEPMSK11                      (0x08000000UL)
#define USBHS_DAINTMSK_OUTEPMSK12_POS                  (28U)
#define USBHS_DAINTMSK_OUTEPMSK12                      (0x10000000UL)
#define USBHS_DAINTMSK_OUTEPMSK13_POS                  (29U)
#define USBHS_DAINTMSK_OUTEPMSK13                      (0x20000000UL)
#define USBHS_DAINTMSK_OUTEPMSK14_POS                  (30U)
#define USBHS_DAINTMSK_OUTEPMSK14                      (0x40000000UL)
#define USBHS_DAINTMSK_OUTEPMSK15_POS                  (31U)
#define USBHS_DAINTMSK_OUTEPMSK15                      (0x80000000UL)

