levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DTHRCTL register  */
#define USBHS_DTHRCTL_NONISOTHREN_POS                  (0U)
#define USBHS_DTHRCTL_NONISOTHREN                      (0x00000001UL)
#define USBHS_DTHRCTL_ISOTHREN_POS                     (1U)
#define USBHS_DTHRCTL_ISOTHREN                         (0x00000002UL)
#define USBHS_DTHRCTL_TXTHRLEN_POS                     (2U)
#define USBHS_DTHRCTL_TXTHRLEN                         (0x000007FCUL)
#define USBHS_DTHRCTL_TXTHRLEN_0                       (0x00000004UL)
#define USBHS_DTHRCTL_TXTHRLEN_1                       (0x00000008UL)
#define USBHS_DTHRCTL_TXTHRLEN_2                       (0x00000010UL)
#define USBHS_DTHRCTL_TXTHRLEN_3                       (0x00000020UL)
#define USBHS_DTHRCTL_TXTHRLEN_4                       (0x00000040UL)
#define USBHS_DTHRCTL_TXTHRLEN_5                       (0x00000080UL)
#define USBHS_DTHRCTL_TXTHRLEN_6                       (0x00000100UL)
#define USBHS_DTHRCTL_TXTHRLEN_7                       (0x00000200UL)
#define USBHS_DTHRCTL_TXTHRLEN_8                       (0x00000400UL)
#define USBHS_DTHRCTL_AHBTHRRATIO_POS                  (11U)
#define USBHS_DTHRCTL_AHBTHRRATIO                      (0x00001800UL)
#define USBHS_DTHRCTL_AHBTHRRATIO_0                    (0x00000800UL)
#define USBHS_DTHRCTL_AHBTHRRATIO_1                    (0x00001000UL)
#define USBHS_DTHRCTL_RXTHREN_POS                      (16U)
#define USBHS_DTHRCTL_RXTHREN                          (0x00010000UL)
#define USBHS_DTHRCTL_RXTHRLEN_POS                     (17U)
#define USBHS_DTHRCTL_RXTHRLEN                         (0x03FE0000UL)
#define USBHS_DTHRCTL_RXTHRLEN_0                       (0x00020000UL)
#define USBHS_DTHRCTL_RXTHRLEN_1                       (0x00040000UL)
#define USBHS_DTHRCTL_RXTHRLEN_2                       (0x00080000UL)
#define USBHS_DTHRCTL_RXTHRLEN_3                       (0x00100000UL)
#define USBHS_DTHRCTL_RXTHRLEN_4                       (0x00200000UL)
#define USBHS_DTHRCTL_RXTHRLEN_5                       (0x00400000UL)
#define USBHS_DTHRCTL_RXTHRLEN_6                       (0x00800000UL)
#define USBHS_DTHRCTL_RXTHRLEN_7                       (0x01000000UL)
#define USBHS_DTHRCTL_RXTHRLEN_8                       (0x02000000UL)
#define USBHS_DTHRCTL_ARBPRKEN_POS                     (27U)
#define USBHS_DTHRCTL_ARBPRKEN                         (0x08000000UL)

/*  Bit definition for USBHS_DIEPEMPMSK register  */
#define USBHS_DIEPEMPMSK_INEPTXFEMPMSK                 (0x0000FFFFUL)

/*  Bit definition for USBHS_DEACHINT register  */
#define USBHS_DEACHINT_ECHINEPINT_POS                  (0U)
#define USBHS_DEACHINT_ECHINEPINT                      (0x0000FFFFUL)
#define USBHS_DEACHINT_ECHINEPINT_0                    (0x00000001UL)
#define USBHS_DEACHINT_ECHINEPINT_1                    (0x00000002UL)
#define USBHS_DEACHINT_ECHINEPINT_2                    (0x00000004UL)
#define USBHS_DEACHINT_ECHINEPINT_3                    (0x00000008UL)
#define USBHS_DEACHINT_ECHINEPINT_4                    (0x00000010UL)
#define USBHS_DEACHINT_ECHINEPINT_5                    (0x00000020UL)
#define USBHS_DEACHINT_ECHINEPINT_6                    (0x00000040UL)
#define USBHS_DEACHINT_ECHINEPINT_7                    (0x00000080UL)
#define USBHS_DEACHINT_ECHINEPINT_8                    (0x00000100UL)
#define USBHS_DEACHINT_ECHINEPINT_9                    (0x00000200UL)
#define USBHS_DEACHINT_ECHINEPINT_10                   (0x00000400UL)
#define USBHS_DEACHINT_ECHINEPINT_11                   (0x00000800UL)
#define USBHS_DEACHINT_ECHINEPINT_12                   (0x00001000UL)
#define USBHS_DEACHINT_ECHINEPINT_13                   (0x00002000UL)
#define USBHS_DEACHINT_ECHINEPINT_14                   (0x00004000UL)
#define USBHS_DEACHINT_ECHINEPINT_15                   (0x00008000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_POS                 (16U)
#define USBHS_DEACHINT_ECHOUTEPINT                     (0xFFFF0000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_0                   (0x00010000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_1                   (0x00020000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_2                   (0x00040000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_3                   (0x00080000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_4                   (0x00100000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_5                   (0x00200000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_6                   (0x00400000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_7                   (0x00800000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_8                   (0x01000000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_9                   (0x02000000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_10                  (0x04000000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_11                  (0x08000000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_12                  (0x10000000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_13                  (0x20000000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_14                  (0x40000000UL)
#define USBHS_DEACHINT_ECHOUTEPINT_15                  (0x80000000UL)

/*  Bit definition for USBHS_DEACHINTMSK register  */
#define USBHS_DEACHINTMSK_ECHINEPMSK0_POS              (0U)
#define USBHS_DEACHINTMSK_ECHINEPMSK0                  (0x00000001UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK1_POS              (1U)
#define USBHS_DEACHINTMSK_ECHINEPMSK1                  (0x00000002UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK2_POS              (2U)
#define USBHS_DEACHINTMSK_ECHINEPMSK2                  (0x00000004UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK3_POS              (3U)
#define USBHS_DEACHINTMSK_ECHINEPMSK3                  (0x00000008UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK4_POS              (4U)
#define USBHS_DEACHINTMSK_ECHINEPMSK4                  (0x00000010UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK5_POS              (5U)
#define USBHS_DEACHINTMSK_ECHINEPMSK5                  (0x00000020UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK6_POS              (6U)
#define USBHS_DEACHINTMSK_ECHINEPMSK6                  (0x00000040UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK7_POS              (7U)
#define USBHS_DEACHINTMSK_ECHINEPMSK7                  (0x00000080UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK8_POS              (8U)
#define USBHS_DEACHINTMSK_ECHINEPMSK8                  (0x00000100UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK9_POS              (9U)
#define USBHS_DEACHINTMSK_ECHINEPMSK9                  (0x00000200UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK10_POS             (10U)
#define USBHS_DEACHINTMSK_ECHINEPMSK10                 (0x00000400UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK11_POS             (11U)
#define USBHS_DEACHINTMSK_ECHINEPMSK11                 (0x00000800UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK12_POS             (12U)
#define USBHS_DEACHINTMSK_ECHINEPMSK12                 (0x00001000UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK13_POS             (13U)
#define USBHS_DEACHINTMSK_ECHINEPMSK13                 (0x00002000UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK14_POS             (14U)
#define USBHS_DEACHINTMSK_ECHINEPMSK14                 (0x00004000UL)
#define USBHS_DEACHINTMSK_ECHINEPMSK15_POS             (15U)
#define USBHS_DEACHINTMSK_ECHINEPMSK15                 (0x00008000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK0_POS             (16U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK0                 (0x00010000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK1_POS             (17U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK1                 (0x00020000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK2_POS             (18U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK2                 (0x00040000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK3_POS             (19U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK3                 (0x00080000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK4_POS             (20U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK4                 (0x00100000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK5_POS             (21U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK5                 (0x00200000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK6_POS             (22U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK6                 (0x00400000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK7_POS             (23U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK7                 (0x00800000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK8_POS             (24U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK8                 (0x01000000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK9_POS             (25U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK9                 (0x02000000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK10_POS            (26U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK10                (0x04000000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK11_POS            (27U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK11                (0x08000000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK12_POS            (28U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK12                (0x10000000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK13_POS            (29U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK13                (0x20000000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK14_POS            (30U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK14                (0x40000000UL)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK15_POS            (31U)
#define USBHS_DEACHINTMSK_ECHOUTEPMSK15                (0x80000000UL)

/*  Bit definition for USBHS_DIEPEACHMSK1 register  */
#define USBHS_DIEPEACHMSK1_XFERCOMPLMSK_POS            (0U)
#define USBHS_DIEPEACHMSK1_XFERCOMPLMSK                (0x00000001UL)
#define USBHS_DIEPEACHMSK1_EPDISBLDMSK_POS             (1U)
#define USBHS_DIEPEACHMSK1_EPDISBLDMSK                 (0x00000002UL)
#define USBHS_DIEPEACHMSK1_AHBERRMSK_POS               (2U)
#define USBHS_DIEPEACHMSK1_AHBERRMSK                   (0x00000004UL)
#define USBHS_DIEPEACHMSK1_TIMEOUTMSK_POS              (3U)
#define USBHS_DIEPEACHMSK1_TIMEOUTMSK                  (0x00000008UL)
#define USBHS_DIEPEACHMSK1_INTKNTXFEMPMSK_POS          (4U)
#define USBHS_DIEPEACHMSK1_INTKNTXFEMPMSK              (0x00000010UL)
#define USBHS_DIEPEACHMSK1_INTKNEPMISMSK_POS           (5U)
#define USBHS_DIEPEACHMSK1_INTKNEPMISMSK               (0x00000020UL)
#define USBHS_DIEPEACHMSK1_INEPNAKEFFMSK_POS           (6U)
#define USBHS_DIEPEACHMSK1_INEPNAKEFFMSK               (0x00000040UL)
#define USBHS_DIEPEACHMSK1_TXFIFOUNDRNMSK_POS          (8U)
#define USBHS_DIEPEACHMSK1_TXFIFOUNDRNMSK              (0x00000100UL)
#define USBHS_DIEPEACHMSK1_NAKMSK_POS                  (13U)
#define USBHS_DIEPEACHMSK1_NAKMSK                      (0x00002000UL)

/*  Bit definition for USBHS_DOEPEACHMSK1 register  */
#define USBHS_DOEPEACHMSK1_XFERCOMPLMSK_POS            (0U)
#define USBHS_DOEPEACHMSK1_XFERCOMPLMSK                (0x00000001UL)
#define USBHS_DOEPEACHMSK1_EPDISBLDMSK_POS             (1U)
#define USBHS_DOEPEACHMSK1_EPDISBLDMSK                 (0x00000002UL)
#define USBHS_DOEPEACHMSK1_AHBERRMSK_POS               (2U)
#define USBHS_DOEPEACHMSK1_AHBERRMSK                   (0x00000004UL)
#define USBHS_DOEPEACHMSK1_SETUPMSK_POS                (3U)
#define USBHS_DOEPEACHMSK1_SETUPMSK                    (0x00000008UL)
#define USBHS_DOEPEACHMSK1_OUTTKNEPDISMSK_POS          (4U)
#define USBHS_DOEPEACHMSK1_OUTTKNEPDISMSK              (0x00000010UL)
#define USBHS_DOEPEACHMSK1_STSPHSRCVDMSK_POS           (5U)
#define USBHS_DOEPEACHMSK1_STSPHSRCVDMSK               (0x00000020UL)
#define USBHS_DOEPEACHMSK1_BACK2BACKSETUP_POS          (6U)
#define USBHS_DOEPEACHMSK1_BACK2BACKSETUP              (0x00000040UL)
#define USBHS_DOEPEACHMSK1_OUTPKTERRMSK_POS            (8U)
#define USBHS_DOEPEACHMSK1_OUTPKTERRMSK                (0x00000100UL)
#define USBHS_DOEPEACHMSK1_BBLEERRMSK_POS              (12U)
#define USBHS_DOEPEACHMSK1_BBLEERRMSK                  (0x00001000UL)
#define USBHS_DOEPEACHMSK1_NAKMSK_POS                  (13U)
#define USBHS_DOEPEACHMSK1_NAKMSK                      (0x00002000UL)
#define USBHS_DOEPEACHMSK1_NYETMSK_POS                 (14U)
#define USBHS_DOEPEACHMSK1_NYETMSK                     (0x00004000UL)

/*  Bit definition for USBHS_DIEPCTL0 register  */
#define USBHS_DIEPCTL0_MPS_POS                         (0U)
#define USBHS_DIEPCTL0_MPS                             (0x00000003UL)
#define USBHS_DIEPCTL0_MPS_0                           (0x00000001UL)
#define USBHS_DIEPCTL0_MPS_1                           (0x00000002UL)
#define USBHS_DIEPCTL0_USBACTEP_POS                    (15U)
#define USBHS_DIEPCTL0_USBACTEP                        (0x00008000UL)
#define USBHS_DIEPCTL0_NAKSTS_POS                      (17U)
#define USBHS_DIEPCTL0_NAKSTS                          (0x00020000UL)
#define USBHS_DIEPCTL0_EPTYPE_POS                      (18U)
#define USBHS_DIEPCTL0_EPTYPE                          (0x000C0000UL)
#define USBHS_DIEPCTL0_EPTYPE_0                        (0x00040000UL)
#define USBHS_DIEPCTL0_EPTYPE_1                        (0x00080000UL)
#define USBHS_DIEPCTL0_STALL_POS                       (21U)
#define USBHS_DIEPCTL0_STALL                           (0x00200000UL)
#define USBHS_DIEPCTL0_TXFNUM_POS                      (22U)
#define USBHS_DIEPCTL0_TXFNUM                          (0x03C00000UL)
#define USBHS_DIEPCTL0_TXFNUM_0                        (0x00400000UL)
#define USBHS_DIEPCTL0_TXFNUM_1                        (0x00800000UL)
#define USBHS_DIEPCTL0_TXFNUM_2                        (0x01000000UL)
#define USBHS_DIEPCTL0_TXFNUM_3                        (0x02000000UL)
#define USBHS_DIEPCTL0_CNAK_POS                        (26U)
#define USBHS_DIEPCTL0_CNAK                            (0x04000000UL)
#define USBHS_DIEPCTL0_SNAK_POS                        (27U)
#define USBHS_DIEPCTL0_SNAK                            (0x08000000UL)
#define USBHS_DIEPCTL0_EPDIS_POS                       (30U)
#define USBHS_DIEPCTL0_EPDIS                           (0x40000000UL)
#define USBHS_DIEPCTL0_EPENA_POS                       (31U)
#define USBHS_DIEPCTL0_EPENA                           (0x80000000UL)

/*  Bit definition for USBHS_DIEPINT0 register  */
#define USBHS_DIEPINT0_XFERCOMPL_POS                   (0U)
#define USBHS_DIEPINT0_XFERCOMPL                       (0x00000001UL)
#define USBHS_DIEPINT0_EPDISBLD_POS                    (1U)
#define USBHS_DIEPINT0_EPDISBLD                        (0x00000002UL)
#define USBHS_DIEPINT0_AHBERR_POS                      (2U)
#define USBHS_DIEPINT0_AHBERR                          (0x00000004UL)
#define USBHS_DIEPINT0_TIMEOUT_POS                     (3U)
#define USBHS_DIEPINT0_TIMEOUT                         (0x00000008UL)
#define USBHS_DIEPINT0_INTKNTXFEMP_POS                 (4U)
#define USBHS_DIEPINT0_INTKNTXFEMP                     (0x00000010UL)
#define USBHS_DIEPINT0_INTKNEPMIS_POS                  (5U)
#define USBHS_DIEPINT0_INTKNEPMIS                      (0x00000020UL)
#define USBHS_DIEPINT0_INEPNAKEFF_POS                  (6U)
#define USBHS_DIEPINT0_INEPNAKEFF                      (0x00000040UL)
#define USBHS_DIEPINT0_TXFEMP_POS                      (7U)
#define USBHS_DIEPINT0_TXFEMP                          (0x00000080UL)
#define USBHS_DIEPINT0_TXFIFOUNDRN_POS                 (8U)
#define USBHS_DIEPINT0_TXFIFOUNDRN                     (0x00000100UL)
#define USBHS_DIEPINT0_BNAINTR_POS                     (9U)
#define USBHS_DIEPINT0_BNAINTR                         (0x00000200UL)
#define USBHS_DIEPINT0_PKTDRPSTS_POS                   (11U)
#define USBHS_DIEPINT0_PKTDRPSTS                       (0x00000800UL)
#define USBHS_DIEPINT0_BBLEERR_POS                     (12U)
#define USBHS_DIEPINT0_BBLEERR                         (0x00001000UL)
#define USBHS_DIEPINT0_NAKINTRPT_POS                   (13U)
#define USBHS_DIEPINT0_NAKINTRPT                       (0x00002000UL)
#define USBHS_DIEPINT0_NYETINTRPT_POS                  (14U)
#define USBHS_DIEPINT0_NYETINTRPT                      (0x00004000UL)

