levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DIEPTSIZ0 register  */
#define USBHS_DIEPTSIZ0_XFERSIZE_POS                   (0U)
#define USBHS_DIEPTSIZ0_XFERSIZE                       (0x0000007FUL)
#define USBHS_DIEPTSIZ0_XFERSIZE_0                     (0x00000001UL)
#define USBHS_DIEPTSIZ0_XFERSIZE_1                     (0x00000002UL)
#define USBHS_DIEPTSIZ0_XFERSIZE_2                     (0x00000004UL)
#define USBHS_DIEPTSIZ0_XFERSIZE_3                     (0x00000008UL)
#define USBHS_DIEPTSIZ0_XFERSIZE_4                     (0x00000010UL)
#define USBHS_DIEPTSIZ0_XFERSIZE_5                     (0x00000020UL)
#define USBHS_DIEPTSIZ0_XFERSIZE_6                     (0x00000040UL)
#define USBHS_DIEPTSIZ0_PKTCNT_POS                     (19U)
#define USBHS_DIEPTSIZ0_PKTCNT                         (0x00180000UL)
#define USBHS_DIEPTSIZ0_PKTCNT_0                       (0x00080000UL)
#define USBHS_DIEPTSIZ0_PKTCNT_1                       (0x00100000UL)

/*  Bit definition for USBHS_DIEPDMA0 register  */
#define USBHS_DIEPDMA0                                 (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS0 register  */
#define USBHS_DTXFSTS0_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL1 register  */
#define USBHS_DIEPCTL1_MPS_POS                         (0U)
#define USBHS_DIEPCTL1_MPS                             (0x000007FFUL)
#define USBHS_DIEPCTL1_MPS_0                           (0x00000001UL)
#define USBHS_DIEPCTL1_MPS_1                           (0x00000002UL)
#define USBHS_DIEPCTL1_MPS_2                           (0x00000004UL)
#define USBHS_DIEPCTL1_MPS_3                           (0x00000008UL)
#define USBHS_DIEPCTL1_MPS_4                           (0x00000010UL)
#define USBHS_DIEPCTL1_MPS_5                           (0x00000020UL)
#define USBHS_DIEPCTL1_MPS_6                           (0x00000040UL)
#define USBHS_DIEPCTL1_MPS_7                           (0x00000080UL)
#define USBHS_DIEPCTL1_MPS_8                           (0x00000100UL)
#define USBHS_DIEPCTL1_MPS_9                           (0x00000200UL)
#define USBHS_DIEPCTL1_MPS_10                          (0x00000400UL)
#define USBHS_DIEPCTL1_USBACTEP_POS                    (15U)
#define USBHS_DIEPCTL1_USBACTEP                        (0x00008000UL)
#define USBHS_DIEPCTL1_DPID_POS                        (16U)
#define USBHS_DIEPCTL1_DPID                            (0x00010000UL)
#define USBHS_DIEPCTL1_NAKSTS_POS                      (17U)
#define USBHS_DIEPCTL1_NAKSTS                          (0x00020000UL)
#define USBHS_DIEPCTL1_EPTYPE_POS                      (18U)
#define USBHS_DIEPCTL1_EPTYPE                          (0x000C0000UL)
#define USBHS_DIEPCTL1_EPTYPE_0                        (0x00040000UL)
#define USBHS_DIEPCTL1_EPTYPE_1                        (0x00080000UL)
#define USBHS_DIEPCTL1_STALL_POS                       (21U)
#define USBHS_DIEPCTL1_STALL                           (0x00200000UL)
#define USBHS_DIEPCTL1_TXFNUM_POS                      (22U)
#define USBHS_DIEPCTL1_TXFNUM                          (0x03C00000UL)
#define USBHS_DIEPCTL1_TXFNUM_0                        (0x00400000UL)
#define USBHS_DIEPCTL1_TXFNUM_1                        (0x00800000UL)
#define USBHS_DIEPCTL1_TXFNUM_2                        (0x01000000UL)
#define USBHS_DIEPCTL1_TXFNUM_3                        (0x02000000UL)
#define USBHS_DIEPCTL1_CNAK_POS                        (26U)
#define USBHS_DIEPCTL1_CNAK                            (0x04000000UL)
#define USBHS_DIEPCTL1_SNAK_POS                        (27U)
#define USBHS_DIEPCTL1_SNAK                            (0x08000000UL)
#define USBHS_DIEPCTL1_SETD0PID_POS                    (28U)
#define USBHS_DIEPCTL1_SETD0PID                        (0x10000000UL)
#define USBHS_DIEPCTL1_SETD1PID_POS                    (29U)
#define USBHS_DIEPCTL1_SETD1PID                        (0x20000000UL)
#define USBHS_DIEPCTL1_EPDIS_POS                       (30U)
#define USBHS_DIEPCTL1_EPDIS                           (0x40000000UL)
#define USBHS_DIEPCTL1_EPENA_POS                       (31U)
#define USBHS_DIEPCTL1_EPENA                           (0x80000000UL)

/*  Bit definition for USBHS_DIEPINT1 register  */
#define USBHS_DIEPINT1_XFERCOMPL_POS                   (0U)
#define USBHS_DIEPINT1_XFERCOMPL                       (0x00000001UL)
#define USBHS_DIEPINT1_EPDISBLD_POS                    (1U)
#define USBHS_DIEPINT1_EPDISBLD                        (0x00000002UL)
#define USBHS_DIEPINT1_AHBERR_POS                      (2U)
#define USBHS_DIEPINT1_AHBERR                          (0x00000004UL)
#define USBHS_DIEPINT1_TIMEOUT_POS                     (3U)
#define USBHS_DIEPINT1_TIMEOUT                         (0x00000008UL)
#define USBHS_DIEPINT1_INTKNTXFEMP_POS                 (4U)
#define USBHS_DIEPINT1_INTKNTXFEMP                     (0x00000010UL)
#define USBHS_DIEPINT1_INTKNEPMIS_POS                  (5U)
#define USBHS_DIEPINT1_INTKNEPMIS                      (0x00000020UL)
#define USBHS_DIEPINT1_INEPNAKEFF_POS                  (6U)
#define USBHS_DIEPINT1_INEPNAKEFF                      (0x00000040UL)
#define USBHS_DIEPINT1_TXFEMP_POS                      (7U)
#define USBHS_DIEPINT1_TXFEMP                          (0x00000080UL)
#define USBHS_DIEPINT1_TXFIFOUNDRN_POS                 (8U)
#define USBHS_DIEPINT1_TXFIFOUNDRN                     (0x00000100UL)
#define USBHS_DIEPINT1_BNAINTR_POS                     (9U)
#define USBHS_DIEPINT1_BNAINTR                         (0x00000200UL)
#define USBHS_DIEPINT1_PKTDRPSTS_POS                   (11U)
#define USBHS_DIEPINT1_PKTDRPSTS                       (0x00000800UL)
#define USBHS_DIEPINT1_BBLEERR_POS                     (12U)
#define USBHS_DIEPINT1_BBLEERR                         (0x00001000UL)
#define USBHS_DIEPINT1_NAKINTRPT_POS                   (13U)
#define USBHS_DIEPINT1_NAKINTRPT                       (0x00002000UL)
#define USBHS_DIEPINT1_NYETINTRPT_POS                  (14U)
#define USBHS_DIEPINT1_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBHS_DIEPTSIZ1 register  */
#define USBHS_DIEPTSIZ1_XFERSIZE_POS                   (0U)
#define USBHS_DIEPTSIZ1_XFERSIZE                       (0x0007FFFFUL)
#define USBHS_DIEPTSIZ1_XFERSIZE_0                     (0x00000001UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_1                     (0x00000002UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_2                     (0x00000004UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_3                     (0x00000008UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_4                     (0x00000010UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_5                     (0x00000020UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_6                     (0x00000040UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_7                     (0x00000080UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_8                     (0x00000100UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_9                     (0x00000200UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_10                    (0x00000400UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_11                    (0x00000800UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_12                    (0x00001000UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_13                    (0x00002000UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_14                    (0x00004000UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_15                    (0x00008000UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_16                    (0x00010000UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_17                    (0x00020000UL)
#define USBHS_DIEPTSIZ1_XFERSIZE_18                    (0x00040000UL)
#define USBHS_DIEPTSIZ1_PKTCNT_POS                     (19U)
#define USBHS_DIEPTSIZ1_PKTCNT                         (0x1FF80000UL)
#define USBHS_DIEPTSIZ1_PKTCNT_0                       (0x00080000UL)
#define USBHS_DIEPTSIZ1_PKTCNT_1                       (0x00100000UL)
#define USBHS_DIEPTSIZ1_PKTCNT_2                       (0x00200000UL)
#define USBHS_DIEPTSIZ1_PKTCNT_3                       (0x00400000UL)
#define USBHS_DIEPTSIZ1_PKTCNT_4                       (0x00800000UL)
#define USBHS_DIEPTSIZ1_PKTCNT_5                       (0x01000000UL)
#define USBHS_DIEPTSIZ1_PKTCNT_6                       (0x02000000UL)
#define USBHS_DIEPTSIZ1_PKTCNT_7                       (0x04000000UL)
#define USBHS_DIEPTSIZ1_PKTCNT_8                       (0x08000000UL)
#define USBHS_DIEPTSIZ1_PKTCNT_9                       (0x10000000UL)
#define USBHS_DIEPTSIZ1_MC_POS                         (29U)
#define USBHS_DIEPTSIZ1_MC                             (0x60000000UL)
#define USBHS_DIEPTSIZ1_MC_0                           (0x20000000UL)
#define USBHS_DIEPTSIZ1_MC_1                           (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA1 register  */
#define USBHS_DIEPDMA1                                 (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS1 register  */
#define USBHS_DTXFSTS1_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL2 register  */
#define USBHS_DIEPCTL2_MPS_POS                         (0U)
#define USBHS_DIEPCTL2_MPS                             (0x000007FFUL)
#define USBHS_DIEPCTL2_MPS_0                           (0x00000001UL)
#define USBHS_DIEPCTL2_MPS_1                           (0x00000002UL)
#define USBHS_DIEPCTL2_MPS_2                           (0x00000004UL)
#define USBHS_DIEPCTL2_MPS_3                           (0x00000008UL)
#define USBHS_DIEPCTL2_MPS_4                           (0x00000010UL)
#define USBHS_DIEPCTL2_MPS_5                           (0x00000020UL)
#define USBHS_DIEPCTL2_MPS_6                           (0x00000040UL)
#define USBHS_DIEPCTL2_MPS_7                           (0x00000080UL)
#define USBHS_DIEPCTL2_MPS_8                           (0x00000100UL)
#define USBHS_DIEPCTL2_MPS_9                           (0x00000200UL)
#define USBHS_DIEPCTL2_MPS_10                          (0x00000400UL)
#define USBHS_DIEPCTL2_USBACTEP_POS                    (15U)
#define USBHS_DIEPCTL2_USBACTEP                        (0x00008000UL)
#define USBHS_DIEPCTL2_DPID_POS                        (16U)
#define USBHS_DIEPCTL2_DPID                            (0x00010000UL)
#define USBHS_DIEPCTL2_NAKSTS_POS                      (17U)
#define USBHS_DIEPCTL2_NAKSTS                          (0x00020000UL)
#define USBHS_DIEPCTL2_EPTYPE_POS                      (18U)
#define USBHS_DIEPCTL2_EPTYPE                          (0x000C0000UL)
#define USBHS_DIEPCTL2_EPTYPE_0                        (0x00040000UL)
#define USBHS_DIEPCTL2_EPTYPE_1                        (0x00080000UL)
#define USBHS_DIEPCTL2_STALL_POS                       (21U)
#define USBHS_DIEPCTL2_STALL                           (0x00200000UL)
#define USBHS_DIEPCTL2_TXFNUM_POS                      (22U)
#define USBHS_DIEPCTL2_TXFNUM                          (0x03C00000UL)
#define USBHS_DIEPCTL2_TXFNUM_0                        (0x00400000UL)
#define USBHS_DIEPCTL2_TXFNUM_1                        (0x00800000UL)
#define USBHS_DIEPCTL2_TXFNUM_2                        (0x01000000UL)
#define USBHS_DIEPCTL2_TXFNUM_3                        (0x02000000UL)
#define USBHS_DIEPCTL2_CNAK_POS                        (26U)
#define USBHS_DIEPCTL2_CNAK                            (0x04000000UL)
#define USBHS_DIEPCTL2_SNAK_POS                        (27U)
#define USBHS_DIEPCTL2_SNAK                            (0x08000000UL)
#define USBHS_DIEPCTL2_SETD0PID_POS                    (28U)
#define USBHS_DIEPCTL2_SETD0PID                        (0x10000000UL)
#define USBHS_DIEPCTL2_SETD1PID_POS                    (29U)
#define USBHS_DIEPCTL2_SETD1PID                        (0x20000000UL)
#define USBHS_DIEPCTL2_EPDIS_POS                       (30U)
#define USBHS_DIEPCTL2_EPDIS                           (0x40000000UL)
#define USBHS_DIEPCTL2_EPENA_POS                       (31U)
#define USBHS_DIEPCTL2_EPENA                           (0x80000000UL)

