levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DIEPINT2 register  */
#define USBHS_DIEPINT2_XFERCOMPL_POS                   (0U)
#define USBHS_DIEPINT2_XFERCOMPL                       (0x00000001UL)
#define USBHS_DIEPINT2_EPDISBLD_POS                    (1U)
#define USBHS_DIEPINT2_EPDISBLD                        (0x00000002UL)
#define USBHS_DIEPINT2_AHBERR_POS                      (2U)
#define USBHS_DIEPINT2_AHBERR                          (0x00000004UL)
#define USBHS_DIEPINT2_TIMEOUT_POS                     (3U)
#define USBHS_DIEPINT2_TIMEOUT                         (0x00000008UL)
#define USBHS_DIEPINT2_INTKNTXFEMP_POS                 (4U)
#define USBHS_DIEPINT2_INTKNTXFEMP                     (0x00000010UL)
#define USBHS_DIEPINT2_INTKNEPMIS_POS                  (5U)
#define USBHS_DIEPINT2_INTKNEPMIS                      (0x00000020UL)
#define USBHS_DIEPINT2_INEPNAKEFF_POS                  (6U)
#define USBHS_DIEPINT2_INEPNAKEFF                      (0x00000040UL)
#define USBHS_DIEPINT2_TXFEMP_POS                      (7U)
#define USBHS_DIEPINT2_TXFEMP                          (0x00000080UL)
#define USBHS_DIEPINT2_TXFIFOUNDRN_POS                 (8U)
#define USBHS_DIEPINT2_TXFIFOUNDRN                     (0x00000100UL)
#define USBHS_DIEPINT2_BNAINTR_POS                     (9U)
#define USBHS_DIEPINT2_BNAINTR                         (0x00000200UL)
#define USBHS_DIEPINT2_PKTDRPSTS_POS                   (11U)
#define USBHS_DIEPINT2_PKTDRPSTS                       (0x00000800UL)
#define USBHS_DIEPINT2_BBLEERR_POS                     (12U)
#define USBHS_DIEPINT2_BBLEERR                         (0x00001000UL)
#define USBHS_DIEPINT2_NAKINTRPT_POS                   (13U)
#define USBHS_DIEPINT2_NAKINTRPT                       (0x00002000UL)
#define USBHS_DIEPINT2_NYETINTRPT_POS                  (14U)
#define USBHS_DIEPINT2_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBHS_DIEPTSIZ2 register  */
#define USBHS_DIEPTSIZ2_XFERSIZE_POS                   (0U)
#define USBHS_DIEPTSIZ2_XFERSIZE                       (0x0007FFFFUL)
#define USBHS_DIEPTSIZ2_XFERSIZE_0                     (0x00000001UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_1                     (0x00000002UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_2                     (0x00000004UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_3                     (0x00000008UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_4                     (0x00000010UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_5                     (0x00000020UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_6                     (0x00000040UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_7                     (0x00000080UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_8                     (0x00000100UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_9                     (0x00000200UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_10                    (0x00000400UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_11                    (0x00000800UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_12                    (0x00001000UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_13                    (0x00002000UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_14                    (0x00004000UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_15                    (0x00008000UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_16                    (0x00010000UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_17                    (0x00020000UL)
#define USBHS_DIEPTSIZ2_XFERSIZE_18                    (0x00040000UL)
#define USBHS_DIEPTSIZ2_PKTCNT_POS                     (19U)
#define USBHS_DIEPTSIZ2_PKTCNT                         (0x1FF80000UL)
#define USBHS_DIEPTSIZ2_PKTCNT_0                       (0x00080000UL)
#define USBHS_DIEPTSIZ2_PKTCNT_1                       (0x00100000UL)
#define USBHS_DIEPTSIZ2_PKTCNT_2                       (0x00200000UL)
#define USBHS_DIEPTSIZ2_PKTCNT_3                       (0x00400000UL)
#define USBHS_DIEPTSIZ2_PKTCNT_4                       (0x00800000UL)
#define USBHS_DIEPTSIZ2_PKTCNT_5                       (0x01000000UL)
#define USBHS_DIEPTSIZ2_PKTCNT_6                       (0x02000000UL)
#define USBHS_DIEPTSIZ2_PKTCNT_7                       (0x04000000UL)
#define USBHS_DIEPTSIZ2_PKTCNT_8                       (0x08000000UL)
#define USBHS_DIEPTSIZ2_PKTCNT_9                       (0x10000000UL)
#define USBHS_DIEPTSIZ2_MC_POS                         (29U)
#define USBHS_DIEPTSIZ2_MC                             (0x60000000UL)
#define USBHS_DIEPTSIZ2_MC_0                           (0x20000000UL)
#define USBHS_DIEPTSIZ2_MC_1                           (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA2 register  */
#define USBHS_DIEPDMA2                                 (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS2 register  */
#define USBHS_DTXFSTS2_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL3 register  */
#define USBHS_DIEPCTL3_MPS_POS                         (0U)
#define USBHS_DIEPCTL3_MPS                             (0x000007FFUL)
#define USBHS_DIEPCTL3_MPS_0                           (0x00000001UL)
#define USBHS_DIEPCTL3_MPS_1                           (0x00000002UL)
#define USBHS_DIEPCTL3_MPS_2                           (0x00000004UL)
#define USBHS_DIEPCTL3_MPS_3                           (0x00000008UL)
#define USBHS_DIEPCTL3_MPS_4                           (0x00000010UL)
#define USBHS_DIEPCTL3_MPS_5                           (0x00000020UL)
#define USBHS_DIEPCTL3_MPS_6                           (0x00000040UL)
#define USBHS_DIEPCTL3_MPS_7                           (0x00000080UL)
#define USBHS_DIEPCTL3_MPS_8                           (0x00000100UL)
#define USBHS_DIEPCTL3_MPS_9                           (0x00000200UL)
#define USBHS_DIEPCTL3_MPS_10                          (0x00000400UL)
#define USBHS_DIEPCTL3_USBACTEP_POS                    (15U)
#define USBHS_DIEPCTL3_USBACTEP                        (0x00008000UL)
#define USBHS_DIEPCTL3_DPID_POS                        (16U)
#define USBHS_DIEPCTL3_DPID                            (0x00010000UL)
#define USBHS_DIEPCTL3_NAKSTS_POS                      (17U)
#define USBHS_DIEPCTL3_NAKSTS                          (0x00020000UL)
#define USBHS_DIEPCTL3_EPTYPE_POS                      (18U)
#define USBHS_DIEPCTL3_EPTYPE                          (0x000C0000UL)
#define USBHS_DIEPCTL3_EPTYPE_0                        (0x00040000UL)
#define USBHS_DIEPCTL3_EPTYPE_1                        (0x00080000UL)
#define USBHS_DIEPCTL3_STALL_POS                       (21U)
#define USBHS_DIEPCTL3_STALL                           (0x00200000UL)
#define USBHS_DIEPCTL3_TXFNUM_POS                      (22U)
#define USBHS_DIEPCTL3_TXFNUM                          (0x03C00000UL)
#define USBHS_DIEPCTL3_TXFNUM_0                        (0x00400000UL)
#define USBHS_DIEPCTL3_TXFNUM_1                        (0x00800000UL)
#define USBHS_DIEPCTL3_TXFNUM_2                        (0x01000000UL)
#define USBHS_DIEPCTL3_TXFNUM_3                        (0x02000000UL)
#define USBHS_DIEPCTL3_CNAK_POS                        (26U)
#define USBHS_DIEPCTL3_CNAK                            (0x04000000UL)
#define USBHS_DIEPCTL3_SNAK_POS                        (27U)
#define USBHS_DIEPCTL3_SNAK                            (0x08000000UL)
#define USBHS_DIEPCTL3_SETD0PID_POS                    (28U)
#define USBHS_DIEPCTL3_SETD0PID                        (0x10000000UL)
#define USBHS_DIEPCTL3_SETD1PID_POS                    (29U)
#define USBHS_DIEPCTL3_SETD1PID                        (0x20000000UL)
#define USBHS_DIEPCTL3_EPDIS_POS                       (30U)
#define USBHS_DIEPCTL3_EPDIS                           (0x40000000UL)
#define USBHS_DIEPCTL3_EPENA_POS                       (31U)
#define USBHS_DIEPCTL3_EPENA                           (0x80000000UL)

/*  Bit definition for USBHS_DIEPINT3 register  */
#define USBHS_DIEPINT3_XFERCOMPL_POS                   (0U)
#define USBHS_DIEPINT3_XFERCOMPL                       (0x00000001UL)
#define USBHS_DIEPINT3_EPDISBLD_POS                    (1U)
#define USBHS_DIEPINT3_EPDISBLD                        (0x00000002UL)
#define USBHS_DIEPINT3_AHBERR_POS                      (2U)
#define USBHS_DIEPINT3_AHBERR                          (0x00000004UL)
#define USBHS_DIEPINT3_TIMEOUT_POS                     (3U)
#define USBHS_DIEPINT3_TIMEOUT                         (0x00000008UL)
#define USBHS_DIEPINT3_INTKNTXFEMP_POS                 (4U)
#define USBHS_DIEPINT3_INTKNTXFEMP                     (0x00000010UL)
#define USBHS_DIEPINT3_INTKNEPMIS_POS                  (5U)
#define USBHS_DIEPINT3_INTKNEPMIS                      (0x00000020UL)
#define USBHS_DIEPINT3_INEPNAKEFF_POS                  (6U)
#define USBHS_DIEPINT3_INEPNAKEFF                      (0x00000040UL)
#define USBHS_DIEPINT3_TXFEMP_POS                      (7U)
#define USBHS_DIEPINT3_TXFEMP                          (0x00000080UL)
#define USBHS_DIEPINT3_TXFIFOUNDRN_POS                 (8U)
#define USBHS_DIEPINT3_TXFIFOUNDRN                     (0x00000100UL)
#define USBHS_DIEPINT3_BNAINTR_POS                     (9U)
#define USBHS_DIEPINT3_BNAINTR                         (0x00000200UL)
#define USBHS_DIEPINT3_PKTDRPSTS_POS                   (11U)
#define USBHS_DIEPINT3_PKTDRPSTS                       (0x00000800UL)
#define USBHS_DIEPINT3_BBLEERR_POS                     (12U)
#define USBHS_DIEPINT3_BBLEERR                         (0x00001000UL)
#define USBHS_DIEPINT3_NAKINTRPT_POS                   (13U)
#define USBHS_DIEPINT3_NAKINTRPT                       (0x00002000UL)
#define USBHS_DIEPINT3_NYETINTRPT_POS                  (14U)
#define USBHS_DIEPINT3_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBHS_DIEPTSIZ3 register  */
#define USBHS_DIEPTSIZ3_XFERSIZE_POS                   (0U)
#define USBHS_DIEPTSIZ3_XFERSIZE                       (0x0007FFFFUL)
#define USBHS_DIEPTSIZ3_XFERSIZE_0                     (0x00000001UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_1                     (0x00000002UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_2                     (0x00000004UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_3                     (0x00000008UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_4                     (0x00000010UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_5                     (0x00000020UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_6                     (0x00000040UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_7                     (0x00000080UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_8                     (0x00000100UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_9                     (0x00000200UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_10                    (0x00000400UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_11                    (0x00000800UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_12                    (0x00001000UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_13                    (0x00002000UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_14                    (0x00004000UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_15                    (0x00008000UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_16                    (0x00010000UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_17                    (0x00020000UL)
#define USBHS_DIEPTSIZ3_XFERSIZE_18                    (0x00040000UL)
#define USBHS_DIEPTSIZ3_PKTCNT_POS                     (19U)
#define USBHS_DIEPTSIZ3_PKTCNT                         (0x1FF80000UL)
#define USBHS_DIEPTSIZ3_PKTCNT_0                       (0x00080000UL)
#define USBHS_DIEPTSIZ3_PKTCNT_1                       (0x00100000UL)
#define USBHS_DIEPTSIZ3_PKTCNT_2                       (0x00200000UL)
#define USBHS_DIEPTSIZ3_PKTCNT_3                       (0x00400000UL)
#define USBHS_DIEPTSIZ3_PKTCNT_4                       (0x00800000UL)
#define USBHS_DIEPTSIZ3_PKTCNT_5                       (0x01000000UL)
#define USBHS_DIEPTSIZ3_PKTCNT_6                       (0x02000000UL)
#define USBHS_DIEPTSIZ3_PKTCNT_7                       (0x04000000UL)
#define USBHS_DIEPTSIZ3_PKTCNT_8                       (0x08000000UL)
#define USBHS_DIEPTSIZ3_PKTCNT_9                       (0x10000000UL)
#define USBHS_DIEPTSIZ3_MC_POS                         (29U)
#define USBHS_DIEPTSIZ3_MC                             (0x60000000UL)
#define USBHS_DIEPTSIZ3_MC_0                           (0x20000000UL)
#define USBHS_DIEPTSIZ3_MC_1                           (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA3 register  */
#define USBHS_DIEPDMA3                                 (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS3 register  */
#define USBHS_DTXFSTS3_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL4 register  */
#define USBHS_DIEPCTL4_MPS_POS                         (0U)
#define USBHS_DIEPCTL4_MPS                             (0x000007FFUL)
#define USBHS_DIEPCTL4_MPS_0                           (0x00000001UL)
#define USBHS_DIEPCTL4_MPS_1                           (0x00000002UL)
#define USBHS_DIEPCTL4_MPS_2                           (0x00000004UL)
#define USBHS_DIEPCTL4_MPS_3                           (0x00000008UL)
#define USBHS_DIEPCTL4_MPS_4                           (0x00000010UL)
#define USBHS_DIEPCTL4_MPS_5                           (0x00000020UL)
#define USBHS_DIEPCTL4_MPS_6                           (0x00000040UL)
#define USBHS_DIEPCTL4_MPS_7                           (0x00000080UL)
#define USBHS_DIEPCTL4_MPS_8                           (0x00000100UL)
#define USBHS_DIEPCTL4_MPS_9                           (0x00000200UL)
#define USBHS_DIEPCTL4_MPS_10                          (0x00000400UL)
#define USBHS_DIEPCTL4_USBACTEP_POS                    (15U)
#define USBHS_DIEPCTL4_USBACTEP                        (0x00008000UL)
#define USBHS_DIEPCTL4_DPID_POS                        (16U)
#define USBHS_DIEPCTL4_DPID                            (0x00010000UL)
#define USBHS_DIEPCTL4_NAKSTS_POS                      (17U)
#define USBHS_DIEPCTL4_NAKSTS                          (0x00020000UL)
#define USBHS_DIEPCTL4_EPTYPE_POS                      (18U)
#define USBHS_DIEPCTL4_EPTYPE                          (0x000C0000UL)
#define USBHS_DIEPCTL4_EPTYPE_0                        (0x00040000UL)
#define USBHS_DIEPCTL4_EPTYPE_1                        (0x00080000UL)
#define USBHS_DIEPCTL4_STALL_POS                       (21U)
#define USBHS_DIEPCTL4_STALL                           (0x00200000UL)
#define USBHS_DIEPCTL4_TXFNUM_POS                      (22U)
#define USBHS_DIEPCTL4_TXFNUM                          (0x03C00000UL)
#define USBHS_DIEPCTL4_TXFNUM_0                        (0x00400000UL)
#define USBHS_DIEPCTL4_TXFNUM_1                        (0x00800000UL)
#define USBHS_DIEPCTL4_TXFNUM_2                        (0x01000000UL)
#define USBHS_DIEPCTL4_TXFNUM_3                        (0x02000000UL)
#define USBHS_DIEPCTL4_CNAK_POS                        (26U)
#define USBHS_DIEPCTL4_CNAK                            (0x04000000UL)
#define USBHS_DIEPCTL4_SNAK_POS                        (27U)
#define USBHS_DIEPCTL4_SNAK                            (0x08000000UL)
#define USBHS_DIEPCTL4_SETD0PID_POS                    (28U)
#define USBHS_DIEPCTL4_SETD0PID                        (0x10000000UL)
#define USBHS_DIEPCTL4_SETD1PID_POS                    (29U)
#define USBHS_DIEPCTL4_SETD1PID                        (0x20000000UL)
#define USBHS_DIEPCTL4_EPDIS_POS                       (30U)
#define USBHS_DIEPCTL4_EPDIS                           (0x40000000UL)
#define USBHS_DIEPCTL4_EPENA_POS                       (31U)
#define USBHS_DIEPCTL4_EPENA                           (0x80000000UL)

/*  Bit definition for USBHS_DIEPINT4 register  */
#define USBHS_DIEPINT4_XFERCOMPL_POS                   (0U)
#define USBHS_DIEPINT4_XFERCOMPL                       (0x00000001UL)
#define USBHS_DIEPINT4_EPDISBLD_POS                    (1U)
#define USBHS_DIEPINT4_EPDISBLD                        (0x00000002UL)
#define USBHS_DIEPINT4_AHBERR_POS                      (2U)
#define USBHS_DIEPINT4_AHBERR                          (0x00000004UL)
#define USBHS_DIEPINT4_TIMEOUT_POS                     (3U)
#define USBHS_DIEPINT4_TIMEOUT                         (0x00000008UL)
#define USBHS_DIEPINT4_INTKNTXFEMP_POS                 (4U)
#define USBHS_DIEPINT4_INTKNTXFEMP                     (0x00000010UL)
#define USBHS_DIEPINT4_INTKNEPMIS_POS                  (5U)
#define USBHS_DIEPINT4_INTKNEPMIS                      (0x00000020UL)
#define USBHS_DIEPINT4_INEPNAKEFF_POS                  (6U)
#define USBHS_DIEPINT4_INEPNAKEFF                      (0x00000040UL)
#define USBHS_DIEPINT4_TXFEMP_POS                      (7U)
#define USBHS_DIEPINT4_TXFEMP                          (0x00000080UL)
#define USBHS_DIEPINT4_TXFIFOUNDRN_POS                 (8U)
#define USBHS_DIEPINT4_TXFIFOUNDRN                     (0x00000100UL)
#define USBHS_DIEPINT4_BNAINTR_POS                     (9U)
#define USBHS_DIEPINT4_BNAINTR                         (0x00000200UL)
#define USBHS_DIEPINT4_PKTDRPSTS_POS                   (11U)
#define USBHS_DIEPINT4_PKTDRPSTS                       (0x00000800UL)
#define USBHS_DIEPINT4_BBLEERR_POS                     (12U)
#define USBHS_DIEPINT4_BBLEERR                         (0x00001000UL)
#define USBHS_DIEPINT4_NAKINTRPT_POS                   (13U)
#define USBHS_DIEPINT4_NAKINTRPT                       (0x00002000UL)
#define USBHS_DIEPINT4_NYETINTRPT_POS                  (14U)
#define USBHS_DIEPINT4_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBHS_DIEPTSIZ4 register  */
#define USBHS_DIEPTSIZ4_XFERSIZE_POS                   (0U)
#define USBHS_DIEPTSIZ4_XFERSIZE                       (0x0007FFFFUL)
#define USBHS_DIEPTSIZ4_XFERSIZE_0                     (0x00000001UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_1                     (0x00000002UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_2                     (0x00000004UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_3                     (0x00000008UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_4                     (0x00000010UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_5                     (0x00000020UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_6                     (0x00000040UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_7                     (0x00000080UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_8                     (0x00000100UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_9                     (0x00000200UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_10                    (0x00000400UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_11                    (0x00000800UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_12                    (0x00001000UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_13                    (0x00002000UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_14                    (0x00004000UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_15                    (0x00008000UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_16                    (0x00010000UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_17                    (0x00020000UL)
#define USBHS_DIEPTSIZ4_XFERSIZE_18                    (0x00040000UL)
#define USBHS_DIEPTSIZ4_PKTCNT_POS                     (19U)
#define USBHS_DIEPTSIZ4_PKTCNT                         (0x1FF80000UL)
#define USBHS_DIEPTSIZ4_PKTCNT_0                       (0x00080000UL)
#define USBHS_DIEPTSIZ4_PKTCNT_1                       (0x00100000UL)
#define USBHS_DIEPTSIZ4_PKTCNT_2                       (0x00200000UL)
#define USBHS_DIEPTSIZ4_PKTCNT_3                       (0x00400000UL)
#define USBHS_DIEPTSIZ4_PKTCNT_4                       (0x00800000UL)
#define USBHS_DIEPTSIZ4_PKTCNT_5                       (0x01000000UL)
#define USBHS_DIEPTSIZ4_PKTCNT_6                       (0x02000000UL)
#define USBHS_DIEPTSIZ4_PKTCNT_7                       (0x04000000UL)
#define USBHS_DIEPTSIZ4_PKTCNT_8                       (0x08000000UL)
#define USBHS_DIEPTSIZ4_PKTCNT_9                       (0x10000000UL)
#define USBHS_DIEPTSIZ4_MC_POS                         (29U)
#define USBHS_DIEPTSIZ4_MC                             (0x60000000UL)
#define USBHS_DIEPTSIZ4_MC_0                           (0x20000000UL)
#define USBHS_DIEPTSIZ4_MC_1                           (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA4 register  */
#define USBHS_DIEPDMA4                                 (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS4 register  */
#define USBHS_DTXFSTS4_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL5 register  */
#define USBHS_DIEPCTL5_MPS_POS                         (0U)
#define USBHS_DIEPCTL5_MPS                             (0x000007FFUL)
#define USBHS_DIEPCTL5_MPS_0                           (0x00000001UL)
#define USBHS_DIEPCTL5_MPS_1                           (0x00000002UL)
#define USBHS_DIEPCTL5_MPS_2                           (0x00000004UL)
#define USBHS_DIEPCTL5_MPS_3                           (0x00000008UL)
#define USBHS_DIEPCTL5_MPS_4                           (0x00000010UL)
#define USBHS_DIEPCTL5_MPS_5                           (0x00000020UL)
#define USBHS_DIEPCTL5_MPS_6                           (0x00000040UL)
#define USBHS_DIEPCTL5_MPS_7                           (0x00000080UL)
#define USBHS_DIEPCTL5_MPS_8                           (0x00000100UL)
#define USBHS_DIEPCTL5_MPS_9                           (0x00000200UL)
#define USBHS_DIEPCTL5_MPS_10                          (0x00000400UL)
#define USBHS_DIEPCTL5_USBACTEP_POS                    (15U)
#define USBHS_DIEPCTL5_USBACTEP                        (0x00008000UL)
#define USBHS_DIEPCTL5_DPID_POS                        (16U)
#define USBHS_DIEPCTL5_DPID                            (0x00010000UL)
#define USBHS_DIEPCTL5_NAKSTS_POS                      (17U)
#define USBHS_DIEPCTL5_NAKSTS                          (0x00020000UL)
#define USBHS_DIEPCTL5_EPTYPE_POS                      (18U)
#define USBHS_DIEPCTL5_EPTYPE                          (0x000C0000UL)
#define USBHS_DIEPCTL5_EPTYPE_0                        (0x00040000UL)
#define USBHS_DIEPCTL5_EPTYPE_1                        (0x00080000UL)
#define USBHS_DIEPCTL5_STALL_POS                       (21U)
#define USBHS_DIEPCTL5_STALL                           (0x00200000UL)
#define USBHS_DIEPCTL5_TXFNUM_POS                      (22U)
#define USBHS_DIEPCTL5_TXFNUM                          (0x03C00000UL)
#define USBHS_DIEPCTL5_TXFNUM_0                        (0x00400000UL)
#define USBHS_DIEPCTL5_TXFNUM_1                        (0x00800000UL)
#define USBHS_DIEPCTL5_TXFNUM_2                        (0x01000000UL)
#define USBHS_DIEPCTL5_TXFNUM_3                        (0x02000000UL)
#define USBHS_DIEPCTL5_CNAK_POS                        (26U)
#define USBHS_DIEPCTL5_CNAK                            (0x04000000UL)
#define USBHS_DIEPCTL5_SNAK_POS                        (27U)
#define USBHS_DIEPCTL5_SNAK                            (0x08000000UL)
#define USBHS_DIEPCTL5_SETD0PID_POS                    (28U)
#define USBHS_DIEPCTL5_SETD0PID                        (0x10000000UL)
#define USBHS_DIEPCTL5_SETD1PID_POS                    (29U)
#define USBHS_DIEPCTL5_SETD1PID                        (0x20000000UL)
#define USBHS_DIEPCTL5_EPDIS_POS                       (30U)
#define USBHS_DIEPCTL5_EPDIS                           (0x40000000UL)
#define USBHS_DIEPCTL5_EPENA_POS                       (31U)
#define USBHS_DIEPCTL5_EPENA                           (0x80000000UL)

