levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DIEPINT5 register  */
#define USBHS_DIEPINT5_XFERCOMPL_POS                   (0U)
#define USBHS_DIEPINT5_XFERCOMPL                       (0x00000001UL)
#define USBHS_DIEPINT5_EPDISBLD_POS                    (1U)
#define USBHS_DIEPINT5_EPDISBLD                        (0x00000002UL)
#define USBHS_DIEPINT5_AHBERR_POS                      (2U)
#define USBHS_DIEPINT5_AHBERR                          (0x00000004UL)
#define USBHS_DIEPINT5_TIMEOUT_POS                     (3U)
#define USBHS_DIEPINT5_TIMEOUT                         (0x00000008UL)
#define USBHS_DIEPINT5_INTKNTXFEMP_POS                 (4U)
#define USBHS_DIEPINT5_INTKNTXFEMP                     (0x00000010UL)
#define USBHS_DIEPINT5_INTKNEPMIS_POS                  (5U)
#define USBHS_DIEPINT5_INTKNEPMIS                      (0x00000020UL)
#define USBHS_DIEPINT5_INEPNAKEFF_POS                  (6U)
#define USBHS_DIEPINT5_INEPNAKEFF                      (0x00000040UL)
#define USBHS_DIEPINT5_TXFEMP_POS                      (7U)
#define USBHS_DIEPINT5_TXFEMP                          (0x00000080UL)
#define USBHS_DIEPINT5_TXFIFOUNDRN_POS                 (8U)
#define USBHS_DIEPINT5_TXFIFOUNDRN                     (0x00000100UL)
#define USBHS_DIEPINT5_BNAINTR_POS                     (9U)
#define USBHS_DIEPINT5_BNAINTR                         (0x00000200UL)
#define USBHS_DIEPINT5_PKTDRPSTS_POS                   (11U)
#define USBHS_DIEPINT5_PKTDRPSTS                       (0x00000800UL)
#define USBHS_DIEPINT5_BBLEERR_POS                     (12U)
#define USBHS_DIEPINT5_BBLEERR                         (0x00001000UL)
#define USBHS_DIEPINT5_NAKINTRPT_POS                   (13U)
#define USBHS_DIEPINT5_NAKINTRPT                       (0x00002000UL)
#define USBHS_DIEPINT5_NYETINTRPT_POS                  (14U)
#define USBHS_DIEPINT5_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBHS_DIEPTSIZ5 register  */
#define USBHS_DIEPTSIZ5_XFERSIZE_POS                   (0U)
#define USBHS_DIEPTSIZ5_XFERSIZE                       (0x0007FFFFUL)
#define USBHS_DIEPTSIZ5_XFERSIZE_0                     (0x00000001UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_1                     (0x00000002UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_2                     (0x00000004UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_3                     (0x00000008UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_4                     (0x00000010UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_5                     (0x00000020UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_6                     (0x00000040UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_7                     (0x00000080UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_8                     (0x00000100UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_9                     (0x00000200UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_10                    (0x00000400UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_11                    (0x00000800UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_12                    (0x00001000UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_13                    (0x00002000UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_14                    (0x00004000UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_15                    (0x00008000UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_16                    (0x00010000UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_17                    (0x00020000UL)
#define USBHS_DIEPTSIZ5_XFERSIZE_18                    (0x00040000UL)
#define USBHS_DIEPTSIZ5_PKTCNT_POS                     (19U)
#define USBHS_DIEPTSIZ5_PKTCNT                         (0x1FF80000UL)
#define USBHS_DIEPTSIZ5_PKTCNT_0                       (0x00080000UL)
#define USBHS_DIEPTSIZ5_PKTCNT_1                       (0x00100000UL)
#define USBHS_DIEPTSIZ5_PKTCNT_2                       (0x00200000UL)
#define USBHS_DIEPTSIZ5_PKTCNT_3                       (0x00400000UL)
#define USBHS_DIEPTSIZ5_PKTCNT_4                       (0x00800000UL)
#define USBHS_DIEPTSIZ5_PKTCNT_5                       (0x01000000UL)
#define USBHS_DIEPTSIZ5_PKTCNT_6                       (0x02000000UL)
#define USBHS_DIEPTSIZ5_PKTCNT_7                       (0x04000000UL)
#define USBHS_DIEPTSIZ5_PKTCNT_8                       (0x08000000UL)
#define USBHS_DIEPTSIZ5_PKTCNT_9                       (0x10000000UL)
#define USBHS_DIEPTSIZ5_MC_POS                         (29U)
#define USBHS_DIEPTSIZ5_MC                             (0x60000000UL)
#define USBHS_DIEPTSIZ5_MC_0                           (0x20000000UL)
#define USBHS_DIEPTSIZ5_MC_1                           (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA5 register  */
#define USBHS_DIEPDMA5                                 (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS5 register  */
#define USBHS_DTXFSTS5_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL6 register  */
#define USBHS_DIEPCTL6_MPS_POS                         (0U)
#define USBHS_DIEPCTL6_MPS                             (0x000007FFUL)
#define USBHS_DIEPCTL6_MPS_0                           (0x00000001UL)
#define USBHS_DIEPCTL6_MPS_1                           (0x00000002UL)
#define USBHS_DIEPCTL6_MPS_2                           (0x00000004UL)
#define USBHS_DIEPCTL6_MPS_3                           (0x00000008UL)
#define USBHS_DIEPCTL6_MPS_4                           (0x00000010UL)
#define USBHS_DIEPCTL6_MPS_5                           (0x00000020UL)
#define USBHS_DIEPCTL6_MPS_6                           (0x00000040UL)
#define USBHS_DIEPCTL6_MPS_7                           (0x00000080UL)
#define USBHS_DIEPCTL6_MPS_8                           (0x00000100UL)
#define USBHS_DIEPCTL6_MPS_9                           (0x00000200UL)
#define USBHS_DIEPCTL6_MPS_10                          (0x00000400UL)
#define USBHS_DIEPCTL6_USBACTEP_POS                    (15U)
#define USBHS_DIEPCTL6_USBACTEP                        (0x00008000UL)
#define USBHS_DIEPCTL6_DPID_POS                        (16U)
#define USBHS_DIEPCTL6_DPID                            (0x00010000UL)
#define USBHS_DIEPCTL6_NAKSTS_POS                      (17U)
#define USBHS_DIEPCTL6_NAKSTS                          (0x00020000UL)
#define USBHS_DIEPCTL6_EPTYPE_POS                      (18U)
#define USBHS_DIEPCTL6_EPTYPE                          (0x000C0000UL)
#define USBHS_DIEPCTL6_EPTYPE_0                        (0x00040000UL)
#define USBHS_DIEPCTL6_EPTYPE_1                        (0x00080000UL)
#define USBHS_DIEPCTL6_STALL_POS                       (21U)
#define USBHS_DIEPCTL6_STALL                           (0x00200000UL)
#define USBHS_DIEPCTL6_TXFNUM_POS                      (22U)
#define USBHS_DIEPCTL6_TXFNUM                          (0x03C00000UL)
#define USBHS_DIEPCTL6_TXFNUM_0                        (0x00400000UL)
#define USBHS_DIEPCTL6_TXFNUM_1                        (0x00800000UL)
#define USBHS_DIEPCTL6_TXFNUM_2                        (0x01000000UL)
#define USBHS_DIEPCTL6_TXFNUM_3                        (0x02000000UL)
#define USBHS_DIEPCTL6_CNAK_POS                        (26U)
#define USBHS_DIEPCTL6_CNAK                            (0x04000000UL)
#define USBHS_DIEPCTL6_SNAK_POS                        (27U)
#define USBHS_DIEPCTL6_SNAK                            (0x08000000UL)
#define USBHS_DIEPCTL6_SETD0PID_POS                    (28U)
#define USBHS_DIEPCTL6_SETD0PID                        (0x10000000UL)
#define USBHS_DIEPCTL6_SETD1PID_POS                    (29U)
#define USBHS_DIEPCTL6_SETD1PID                        (0x20000000UL)
#define USBHS_DIEPCTL6_EPDIS_POS                       (30U)
#define USBHS_DIEPCTL6_EPDIS                           (0x40000000UL)
#define USBHS_DIEPCTL6_EPENA_POS                       (31U)
#define USBHS_DIEPCTL6_EPENA                           (0x80000000UL)

/*  Bit definition for USBHS_DIEPINT6 register  */
#define USBHS_DIEPINT6_XFERCOMPL_POS                   (0U)
#define USBHS_DIEPINT6_XFERCOMPL                       (0x00000001UL)
#define USBHS_DIEPINT6_EPDISBLD_POS                    (1U)
#define USBHS_DIEPINT6_EPDISBLD                        (0x00000002UL)
#define USBHS_DIEPINT6_AHBERR_POS                      (2U)
#define USBHS_DIEPINT6_AHBERR                          (0x00000004UL)
#define USBHS_DIEPINT6_TIMEOUT_POS                     (3U)
#define USBHS_DIEPINT6_TIMEOUT                         (0x00000008UL)
#define USBHS_DIEPINT6_INTKNTXFEMP_POS                 (4U)
#define USBHS_DIEPINT6_INTKNTXFEMP                     (0x00000010UL)
#define USBHS_DIEPINT6_INTKNEPMIS_POS                  (5U)
#define USBHS_DIEPINT6_INTKNEPMIS                      (0x00000020UL)
#define USBHS_DIEPINT6_INEPNAKEFF_POS                  (6U)
#define USBHS_DIEPINT6_INEPNAKEFF                      (0x00000040UL)
#define USBHS_DIEPINT6_TXFEMP_POS                      (7U)
#define USBHS_DIEPINT6_TXFEMP                          (0x00000080UL)
#define USBHS_DIEPINT6_TXFIFOUNDRN_POS                 (8U)
#define USBHS_DIEPINT6_TXFIFOUNDRN                     (0x00000100UL)
#define USBHS_DIEPINT6_BNAINTR_POS                     (9U)
#define USBHS_DIEPINT6_BNAINTR                         (0x00000200UL)
#define USBHS_DIEPINT6_PKTDRPSTS_POS                   (11U)
#define USBHS_DIEPINT6_PKTDRPSTS                       (0x00000800UL)
#define USBHS_DIEPINT6_BBLEERR_POS                     (12U)
#define USBHS_DIEPINT6_BBLEERR                         (0x00001000UL)
#define USBHS_DIEPINT6_NAKINTRPT_POS                   (13U)
#define USBHS_DIEPINT6_NAKINTRPT                       (0x00002000UL)
#define USBHS_DIEPINT6_NYETINTRPT_POS                  (14U)
#define USBHS_DIEPINT6_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBHS_DIEPTSIZ6 register  */
#define USBHS_DIEPTSIZ6_XFERSIZE_POS                   (0U)
#define USBHS_DIEPTSIZ6_XFERSIZE                       (0x0007FFFFUL)
#define USBHS_DIEPTSIZ6_XFERSIZE_0                     (0x00000001UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_1                     (0x00000002UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_2                     (0x00000004UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_3                     (0x00000008UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_4                     (0x00000010UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_5                     (0x00000020UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_6                     (0x00000040UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_7                     (0x00000080UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_8                     (0x00000100UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_9                     (0x00000200UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_10                    (0x00000400UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_11                    (0x00000800UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_12                    (0x00001000UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_13                    (0x00002000UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_14                    (0x00004000UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_15                    (0x00008000UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_16                    (0x00010000UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_17                    (0x00020000UL)
#define USBHS_DIEPTSIZ6_XFERSIZE_18                    (0x00040000UL)
#define USBHS_DIEPTSIZ6_PKTCNT_POS                     (19U)
#define USBHS_DIEPTSIZ6_PKTCNT                         (0x1FF80000UL)
#define USBHS_DIEPTSIZ6_PKTCNT_0                       (0x00080000UL)
#define USBHS_DIEPTSIZ6_PKTCNT_1                       (0x00100000UL)
#define USBHS_DIEPTSIZ6_PKTCNT_2                       (0x00200000UL)
#define USBHS_DIEPTSIZ6_PKTCNT_3                       (0x00400000UL)
#define USBHS_DIEPTSIZ6_PKTCNT_4                       (0x00800000UL)
#define USBHS_DIEPTSIZ6_PKTCNT_5                       (0x01000000UL)
#define USBHS_DIEPTSIZ6_PKTCNT_6                       (0x02000000UL)
#define USBHS_DIEPTSIZ6_PKTCNT_7                       (0x04000000UL)
#define USBHS_DIEPTSIZ6_PKTCNT_8                       (0x08000000UL)
#define USBHS_DIEPTSIZ6_PKTCNT_9                       (0x10000000UL)
#define USBHS_DIEPTSIZ6_MC_POS                         (29U)
#define USBHS_DIEPTSIZ6_MC                             (0x60000000UL)
#define USBHS_DIEPTSIZ6_MC_0                           (0x20000000UL)
#define USBHS_DIEPTSIZ6_MC_1                           (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA6 register  */
#define USBHS_DIEPDMA6                                 (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS6 register  */
#define USBHS_DTXFSTS6_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL7 register  */
#define USBHS_DIEPCTL7_MPS_POS                         (0U)
#define USBHS_DIEPCTL7_MPS                             (0x000007FFUL)
#define USBHS_DIEPCTL7_MPS_0                           (0x00000001UL)
#define USBHS_DIEPCTL7_MPS_1                           (0x00000002UL)
#define USBHS_DIEPCTL7_MPS_2                           (0x00000004UL)
#define USBHS_DIEPCTL7_MPS_3                           (0x00000008UL)
#define USBHS_DIEPCTL7_MPS_4                           (0x00000010UL)
#define USBHS_DIEPCTL7_MPS_5                           (0x00000020UL)
#define USBHS_DIEPCTL7_MPS_6                           (0x00000040UL)
#define USBHS_DIEPCTL7_MPS_7                           (0x00000080UL)
#define USBHS_DIEPCTL7_MPS_8                           (0x00000100UL)
#define USBHS_DIEPCTL7_MPS_9                           (0x00000200UL)
#define USBHS_DIEPCTL7_MPS_10                          (0x00000400UL)
#define USBHS_DIEPCTL7_USBACTEP_POS                    (15U)
#define USBHS_DIEPCTL7_USBACTEP                        (0x00008000UL)
#define USBHS_DIEPCTL7_DPID_POS                        (16U)
#define USBHS_DIEPCTL7_DPID                            (0x00010000UL)
#define USBHS_DIEPCTL7_NAKSTS_POS                      (17U)
#define USBHS_DIEPCTL7_NAKSTS                          (0x00020000UL)
#define USBHS_DIEPCTL7_EPTYPE_POS                      (18U)
#define USBHS_DIEPCTL7_EPTYPE                          (0x000C0000UL)
#define USBHS_DIEPCTL7_EPTYPE_0                        (0x00040000UL)
#define USBHS_DIEPCTL7_EPTYPE_1                        (0x00080000UL)
#define USBHS_DIEPCTL7_STALL_POS                       (21U)
#define USBHS_DIEPCTL7_STALL                           (0x00200000UL)
#define USBHS_DIEPCTL7_TXFNUM_POS                      (22U)
#define USBHS_DIEPCTL7_TXFNUM                          (0x03C00000UL)
#define USBHS_DIEPCTL7_TXFNUM_0                        (0x00400000UL)
#define USBHS_DIEPCTL7_TXFNUM_1                        (0x00800000UL)
#define USBHS_DIEPCTL7_TXFNUM_2                        (0x01000000UL)
#define USBHS_DIEPCTL7_TXFNUM_3                        (0x02000000UL)
#define USBHS_DIEPCTL7_CNAK_POS                        (26U)
#define USBHS_DIEPCTL7_CNAK                            (0x04000000UL)
#define USBHS_DIEPCTL7_SNAK_POS                        (27U)
#define USBHS_DIEPCTL7_SNAK                            (0x08000000UL)
#define USBHS_DIEPCTL7_SETD0PID_POS                    (28U)
#define USBHS_DIEPCTL7_SETD0PID                        (0x10000000UL)
#define USBHS_DIEPCTL7_SETD1PID_POS                    (29U)
#define USBHS_DIEPCTL7_SETD1PID                        (0x20000000UL)
#define USBHS_DIEPCTL7_EPDIS_POS                       (30U)
#define USBHS_DIEPCTL7_EPDIS                           (0x40000000UL)
#define USBHS_DIEPCTL7_EPENA_POS                       (31U)
#define USBHS_DIEPCTL7_EPENA                           (0x80000000UL)

/*  Bit definition for USBHS_DIEPINT7 register  */
#define USBHS_DIEPINT7_XFERCOMPL_POS                   (0U)
#define USBHS_DIEPINT7_XFERCOMPL                       (0x00000001UL)
#define USBHS_DIEPINT7_EPDISBLD_POS                    (1U)
#define USBHS_DIEPINT7_EPDISBLD                        (0x00000002UL)
#define USBHS_DIEPINT7_AHBERR_POS                      (2U)
#define USBHS_DIEPINT7_AHBERR                          (0x00000004UL)
#define USBHS_DIEPINT7_TIMEOUT_POS                     (3U)
#define USBHS_DIEPINT7_TIMEOUT                         (0x00000008UL)
#define USBHS_DIEPINT7_INTKNTXFEMP_POS                 (4U)
#define USBHS_DIEPINT7_INTKNTXFEMP                     (0x00000010UL)
#define USBHS_DIEPINT7_INTKNEPMIS_POS                  (5U)
#define USBHS_DIEPINT7_INTKNEPMIS                      (0x00000020UL)
#define USBHS_DIEPINT7_INEPNAKEFF_POS                  (6U)
#define USBHS_DIEPINT7_INEPNAKEFF                      (0x00000040UL)
#define USBHS_DIEPINT7_TXFEMP_POS                      (7U)
#define USBHS_DIEPINT7_TXFEMP                          (0x00000080UL)
#define USBHS_DIEPINT7_TXFIFOUNDRN_POS                 (8U)
#define USBHS_DIEPINT7_TXFIFOUNDRN                     (0x00000100UL)
#define USBHS_DIEPINT7_BNAINTR_POS                     (9U)
#define USBHS_DIEPINT7_BNAINTR                         (0x00000200UL)
#define USBHS_DIEPINT7_PKTDRPSTS_POS                   (11U)
#define USBHS_DIEPINT7_PKTDRPSTS                       (0x00000800UL)
#define USBHS_DIEPINT7_BBLEERR_POS                     (12U)
#define USBHS_DIEPINT7_BBLEERR                         (0x00001000UL)
#define USBHS_DIEPINT7_NAKINTRPT_POS                   (13U)
#define USBHS_DIEPINT7_NAKINTRPT                       (0x00002000UL)
#define USBHS_DIEPINT7_NYETINTRPT_POS                  (14U)
#define USBHS_DIEPINT7_NYETINTRPT                      (0x00004000UL)

