levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DIEPTSIZ7 register  */
#define USBHS_DIEPTSIZ7_XFERSIZE_POS                   (0U)
#define USBHS_DIEPTSIZ7_XFERSIZE                       (0x0007FFFFUL)
#define USBHS_DIEPTSIZ7_XFERSIZE_0                     (0x00000001UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_1                     (0x00000002UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_2                     (0x00000004UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_3                     (0x00000008UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_4                     (0x00000010UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_5                     (0x00000020UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_6                     (0x00000040UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_7                     (0x00000080UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_8                     (0x00000100UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_9                     (0x00000200UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_10                    (0x00000400UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_11                    (0x00000800UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_12                    (0x00001000UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_13                    (0x00002000UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_14                    (0x00004000UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_15                    (0x00008000UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_16                    (0x00010000UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_17                    (0x00020000UL)
#define USBHS_DIEPTSIZ7_XFERSIZE_18                    (0x00040000UL)
#define USBHS_DIEPTSIZ7_PKTCNT_POS                     (19U)
#define USBHS_DIEPTSIZ7_PKTCNT                         (0x1FF80000UL)
#define USBHS_DIEPTSIZ7_PKTCNT_0                       (0x00080000UL)
#define USBHS_DIEPTSIZ7_PKTCNT_1                       (0x00100000UL)
#define USBHS_DIEPTSIZ7_PKTCNT_2                       (0x00200000UL)
#define USBHS_DIEPTSIZ7_PKTCNT_3                       (0x00400000UL)
#define USBHS_DIEPTSIZ7_PKTCNT_4                       (0x00800000UL)
#define USBHS_DIEPTSIZ7_PKTCNT_5                       (0x01000000UL)
#define USBHS_DIEPTSIZ7_PKTCNT_6                       (0x02000000UL)
#define USBHS_DIEPTSIZ7_PKTCNT_7                       (0x04000000UL)
#define USBHS_DIEPTSIZ7_PKTCNT_8                       (0x08000000UL)
#define USBHS_DIEPTSIZ7_PKTCNT_9                       (0x10000000UL)
#define USBHS_DIEPTSIZ7_MC_POS                         (29U)
#define USBHS_DIEPTSIZ7_MC                             (0x60000000UL)
#define USBHS_DIEPTSIZ7_MC_0                           (0x20000000UL)
#define USBHS_DIEPTSIZ7_MC_1                           (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA7 register  */
#define USBHS_DIEPDMA7                                 (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS7 register  */
#define USBHS_DTXFSTS7_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL8 register  */
#define USBHS_DIEPCTL8_MPS_POS                         (0U)
#define USBHS_DIEPCTL8_MPS                             (0x000007FFUL)
#define USBHS_DIEPCTL8_MPS_0                           (0x00000001UL)
#define USBHS_DIEPCTL8_MPS_1                           (0x00000002UL)
#define USBHS_DIEPCTL8_MPS_2                           (0x00000004UL)
#define USBHS_DIEPCTL8_MPS_3                           (0x00000008UL)
#define USBHS_DIEPCTL8_MPS_4                           (0x00000010UL)
#define USBHS_DIEPCTL8_MPS_5                           (0x00000020UL)
#define USBHS_DIEPCTL8_MPS_6                           (0x00000040UL)
#define USBHS_DIEPCTL8_MPS_7                           (0x00000080UL)
#define USBHS_DIEPCTL8_MPS_8                           (0x00000100UL)
#define USBHS_DIEPCTL8_MPS_9                           (0x00000200UL)
#define USBHS_DIEPCTL8_MPS_10                          (0x00000400UL)
#define USBHS_DIEPCTL8_USBACTEP_POS                    (15U)
#define USBHS_DIEPCTL8_USBACTEP                        (0x00008000UL)
#define USBHS_DIEPCTL8_DPID_POS                        (16U)
#define USBHS_DIEPCTL8_DPID                            (0x00010000UL)
#define USBHS_DIEPCTL8_NAKSTS_POS                      (17U)
#define USBHS_DIEPCTL8_NAKSTS                          (0x00020000UL)
#define USBHS_DIEPCTL8_EPTYPE_POS                      (18U)
#define USBHS_DIEPCTL8_EPTYPE                          (0x000C0000UL)
#define USBHS_DIEPCTL8_EPTYPE_0                        (0x00040000UL)
#define USBHS_DIEPCTL8_EPTYPE_1                        (0x00080000UL)
#define USBHS_DIEPCTL8_STALL_POS                       (21U)
#define USBHS_DIEPCTL8_STALL                           (0x00200000UL)
#define USBHS_DIEPCTL8_TXFNUM_POS                      (22U)
#define USBHS_DIEPCTL8_TXFNUM                          (0x03C00000UL)
#define USBHS_DIEPCTL8_TXFNUM_0                        (0x00400000UL)
#define USBHS_DIEPCTL8_TXFNUM_1                        (0x00800000UL)
#define USBHS_DIEPCTL8_TXFNUM_2                        (0x01000000UL)
#define USBHS_DIEPCTL8_TXFNUM_3                        (0x02000000UL)
#define USBHS_DIEPCTL8_CNAK_POS                        (26U)
#define USBHS_DIEPCTL8_CNAK                            (0x04000000UL)
#define USBHS_DIEPCTL8_SNAK_POS                        (27U)
#define USBHS_DIEPCTL8_SNAK                            (0x08000000UL)
#define USBHS_DIEPCTL8_SETD0PID_POS                    (28U)
#define USBHS_DIEPCTL8_SETD0PID                        (0x10000000UL)
#define USBHS_DIEPCTL8_SETD1PID_POS                    (29U)
#define USBHS_DIEPCTL8_SETD1PID                        (0x20000000UL)
#define USBHS_DIEPCTL8_EPDIS_POS                       (30U)
#define USBHS_DIEPCTL8_EPDIS                           (0x40000000UL)
#define USBHS_DIEPCTL8_EPENA_POS                       (31U)
#define USBHS_DIEPCTL8_EPENA                           (0x80000000UL)

/*  Bit definition for USBHS_DIEPINT8 register  */
#define USBHS_DIEPINT8_XFERCOMPL_POS                   (0U)
#define USBHS_DIEPINT8_XFERCOMPL                       (0x00000001UL)
#define USBHS_DIEPINT8_EPDISBLD_POS                    (1U)
#define USBHS_DIEPINT8_EPDISBLD                        (0x00000002UL)
#define USBHS_DIEPINT8_AHBERR_POS                      (2U)
#define USBHS_DIEPINT8_AHBERR                          (0x00000004UL)
#define USBHS_DIEPINT8_TIMEOUT_POS                     (3U)
#define USBHS_DIEPINT8_TIMEOUT                         (0x00000008UL)
#define USBHS_DIEPINT8_INTKNTXFEMP_POS                 (4U)
#define USBHS_DIEPINT8_INTKNTXFEMP                     (0x00000010UL)
#define USBHS_DIEPINT8_INTKNEPMIS_POS                  (5U)
#define USBHS_DIEPINT8_INTKNEPMIS                      (0x00000020UL)
#define USBHS_DIEPINT8_INEPNAKEFF_POS                  (6U)
#define USBHS_DIEPINT8_INEPNAKEFF                      (0x00000040UL)
#define USBHS_DIEPINT8_TXFEMP_POS                      (7U)
#define USBHS_DIEPINT8_TXFEMP                          (0x00000080UL)
#define USBHS_DIEPINT8_TXFIFOUNDRN_POS                 (8U)
#define USBHS_DIEPINT8_TXFIFOUNDRN                     (0x00000100UL)
#define USBHS_DIEPINT8_BNAINTR_POS                     (9U)
#define USBHS_DIEPINT8_BNAINTR                         (0x00000200UL)
#define USBHS_DIEPINT8_PKTDRPSTS_POS                   (11U)
#define USBHS_DIEPINT8_PKTDRPSTS                       (0x00000800UL)
#define USBHS_DIEPINT8_BBLEERR_POS                     (12U)
#define USBHS_DIEPINT8_BBLEERR                         (0x00001000UL)
#define USBHS_DIEPINT8_NAKINTRPT_POS                   (13U)
#define USBHS_DIEPINT8_NAKINTRPT                       (0x00002000UL)
#define USBHS_DIEPINT8_NYETINTRPT_POS                  (14U)
#define USBHS_DIEPINT8_NYETINTRPT                      (0x00004000UL)

/*  Bit definition for USBHS_DIEPTSIZ8 register  */
#define USBHS_DIEPTSIZ8_XFERSIZE_POS                   (0U)
#define USBHS_DIEPTSIZ8_XFERSIZE                       (0x0007FFFFUL)
#define USBHS_DIEPTSIZ8_XFERSIZE_0                     (0x00000001UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_1                     (0x00000002UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_2                     (0x00000004UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_3                     (0x00000008UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_4                     (0x00000010UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_5                     (0x00000020UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_6                     (0x00000040UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_7                     (0x00000080UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_8                     (0x00000100UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_9                     (0x00000200UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_10                    (0x00000400UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_11                    (0x00000800UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_12                    (0x00001000UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_13                    (0x00002000UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_14                    (0x00004000UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_15                    (0x00008000UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_16                    (0x00010000UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_17                    (0x00020000UL)
#define USBHS_DIEPTSIZ8_XFERSIZE_18                    (0x00040000UL)
#define USBHS_DIEPTSIZ8_PKTCNT_POS                     (19U)
#define USBHS_DIEPTSIZ8_PKTCNT                         (0x1FF80000UL)
#define USBHS_DIEPTSIZ8_PKTCNT_0                       (0x00080000UL)
#define USBHS_DIEPTSIZ8_PKTCNT_1                       (0x00100000UL)
#define USBHS_DIEPTSIZ8_PKTCNT_2                       (0x00200000UL)
#define USBHS_DIEPTSIZ8_PKTCNT_3                       (0x00400000UL)
#define USBHS_DIEPTSIZ8_PKTCNT_4                       (0x00800000UL)
#define USBHS_DIEPTSIZ8_PKTCNT_5                       (0x01000000UL)
#define USBHS_DIEPTSIZ8_PKTCNT_6                       (0x02000000UL)
#define USBHS_DIEPTSIZ8_PKTCNT_7                       (0x04000000UL)
#define USBHS_DIEPTSIZ8_PKTCNT_8                       (0x08000000UL)
#define USBHS_DIEPTSIZ8_PKTCNT_9                       (0x10000000UL)
#define USBHS_DIEPTSIZ8_MC_POS                         (29U)
#define USBHS_DIEPTSIZ8_MC                             (0x60000000UL)
#define USBHS_DIEPTSIZ8_MC_0                           (0x20000000UL)
#define USBHS_DIEPTSIZ8_MC_1                           (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA8 register  */
#define USBHS_DIEPDMA8                                 (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS8 register  */
#define USBHS_DTXFSTS8_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL9 register  */
#define USBHS_DIEPCTL9_MPS_POS                         (0U)
#define USBHS_DIEPCTL9_MPS                             (0x000007FFUL)
#define USBHS_DIEPCTL9_MPS_0                           (0x00000001UL)
#define USBHS_DIEPCTL9_MPS_1                           (0x00000002UL)
#define USBHS_DIEPCTL9_MPS_2                           (0x00000004UL)
#define USBHS_DIEPCTL9_MPS_3                           (0x00000008UL)
#define USBHS_DIEPCTL9_MPS_4                           (0x00000010UL)
#define USBHS_DIEPCTL9_MPS_5                           (0x00000020UL)
#define USBHS_DIEPCTL9_MPS_6                           (0x00000040UL)
#define USBHS_DIEPCTL9_MPS_7                           (0x00000080UL)
#define USBHS_DIEPCTL9_MPS_8                           (0x00000100UL)
#define USBHS_DIEPCTL9_MPS_9                           (0x00000200UL)
#define USBHS_DIEPCTL9_MPS_10                          (0x00000400UL)
#define USBHS_DIEPCTL9_USBACTEP_POS                    (15U)
#define USBHS_DIEPCTL9_USBACTEP                        (0x00008000UL)
#define USBHS_DIEPCTL9_DPID_POS                        (16U)
#define USBHS_DIEPCTL9_DPID                            (0x00010000UL)
#define USBHS_DIEPCTL9_NAKSTS_POS                      (17U)
#define USBHS_DIEPCTL9_NAKSTS                          (0x00020000UL)
#define USBHS_DIEPCTL9_EPTYPE_POS                      (18U)
#define USBHS_DIEPCTL9_EPTYPE                          (0x000C0000UL)
#define USBHS_DIEPCTL9_EPTYPE_0                        (0x00040000UL)
#define USBHS_DIEPCTL9_EPTYPE_1                        (0x00080000UL)
#define USBHS_DIEPCTL9_STALL_POS                       (21U)
#define USBHS_DIEPCTL9_STALL                           (0x00200000UL)
#define USBHS_DIEPCTL9_TXFNUM_POS                      (22U)
#define USBHS_DIEPCTL9_TXFNUM                          (0x03C00000UL)
#define USBHS_DIEPCTL9_TXFNUM_0                        (0x00400000UL)
#define USBHS_DIEPCTL9_TXFNUM_1                        (0x00800000UL)
#define USBHS_DIEPCTL9_TXFNUM_2                        (0x01000000UL)
#define USBHS_DIEPCTL9_TXFNUM_3                        (0x02000000UL)
#define USBHS_DIEPCTL9_CNAK_POS                        (26U)
#define USBHS_DIEPCTL9_CNAK                            (0x04000000UL)
#define USBHS_DIEPCTL9_SNAK_POS                        (27U)
#define USBHS_DIEPCTL9_SNAK                            (0x08000000UL)
#define USBHS_DIEPCTL9_SETD0PID_POS                    (28U)
#define USBHS_DIEPCTL9_SETD0PID                        (0x10000000UL)
#define USBHS_DIEPCTL9_SETD1PID_POS                    (29U)
#define USBHS_DIEPCTL9_SETD1PID                        (0x20000000UL)
#define USBHS_DIEPCTL9_EPDIS_POS                       (30U)
#define USBHS_DIEPCTL9_EPDIS                           (0x40000000UL)
#define USBHS_DIEPCTL9_EPENA_POS                       (31U)
#define USBHS_DIEPCTL9_EPENA                           (0x80000000UL)

/*  Bit definition for USBHS_DIEPINT9 register  */
#define USBHS_DIEPINT9_XFERCOMPL_POS                   (0U)
#define USBHS_DIEPINT9_XFERCOMPL                       (0x00000001UL)
#define USBHS_DIEPINT9_EPDISBLD_POS                    (1U)
#define USBHS_DIEPINT9_EPDISBLD                        (0x00000002UL)
#define USBHS_DIEPINT9_AHBERR_POS                      (2U)
#define USBHS_DIEPINT9_AHBERR                          (0x00000004UL)
#define USBHS_DIEPINT9_TIMEOUT_POS                     (3U)
#define USBHS_DIEPINT9_TIMEOUT                         (0x00000008UL)
#define USBHS_DIEPINT9_INTKNTXFEMP_POS                 (4U)
#define USBHS_DIEPINT9_INTKNTXFEMP                     (0x00000010UL)
#define USBHS_DIEPINT9_INTKNEPMIS_POS                  (5U)
#define USBHS_DIEPINT9_INTKNEPMIS                      (0x00000020UL)
#define USBHS_DIEPINT9_INEPNAKEFF_POS                  (6U)
#define USBHS_DIEPINT9_INEPNAKEFF                      (0x00000040UL)
#define USBHS_DIEPINT9_TXFEMP_POS                      (7U)
#define USBHS_DIEPINT9_TXFEMP                          (0x00000080UL)
#define USBHS_DIEPINT9_TXFIFOUNDRN_POS                 (8U)
#define USBHS_DIEPINT9_TXFIFOUNDRN                     (0x00000100UL)
#define USBHS_DIEPINT9_BNAINTR_POS                     (9U)
#define USBHS_DIEPINT9_BNAINTR                         (0x00000200UL)
#define USBHS_DIEPINT9_PKTDRPSTS_POS                   (11U)
#define USBHS_DIEPINT9_PKTDRPSTS                       (0x00000800UL)
#define USBHS_DIEPINT9_BBLEERR_POS                     (12U)
#define USBHS_DIEPINT9_BBLEERR                         (0x00001000UL)
#define USBHS_DIEPINT9_NAKINTRPT_POS                   (13U)
#define USBHS_DIEPINT9_NAKINTRPT                       (0x00002000UL)
#define USBHS_DIEPINT9_NYETINTRPT_POS                  (14U)
#define USBHS_DIEPINT9_NYETINTRPT                      (0x00004000UL)

