levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DIEPTSIZ9 register  */
#define USBHS_DIEPTSIZ9_XFERSIZE_POS                   (0U)
#define USBHS_DIEPTSIZ9_XFERSIZE                       (0x0007FFFFUL)
#define USBHS_DIEPTSIZ9_XFERSIZE_0                     (0x00000001UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_1                     (0x00000002UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_2                     (0x00000004UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_3                     (0x00000008UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_4                     (0x00000010UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_5                     (0x00000020UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_6                     (0x00000040UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_7                     (0x00000080UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_8                     (0x00000100UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_9                     (0x00000200UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_10                    (0x00000400UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_11                    (0x00000800UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_12                    (0x00001000UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_13                    (0x00002000UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_14                    (0x00004000UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_15                    (0x00008000UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_16                    (0x00010000UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_17                    (0x00020000UL)
#define USBHS_DIEPTSIZ9_XFERSIZE_18                    (0x00040000UL)
#define USBHS_DIEPTSIZ9_PKTCNT_POS                     (19U)
#define USBHS_DIEPTSIZ9_PKTCNT                         (0x1FF80000UL)
#define USBHS_DIEPTSIZ9_PKTCNT_0                       (0x00080000UL)
#define USBHS_DIEPTSIZ9_PKTCNT_1                       (0x00100000UL)
#define USBHS_DIEPTSIZ9_PKTCNT_2                       (0x00200000UL)
#define USBHS_DIEPTSIZ9_PKTCNT_3                       (0x00400000UL)
#define USBHS_DIEPTSIZ9_PKTCNT_4                       (0x00800000UL)
#define USBHS_DIEPTSIZ9_PKTCNT_5                       (0x01000000UL)
#define USBHS_DIEPTSIZ9_PKTCNT_6                       (0x02000000UL)
#define USBHS_DIEPTSIZ9_PKTCNT_7                       (0x04000000UL)
#define USBHS_DIEPTSIZ9_PKTCNT_8                       (0x08000000UL)
#define USBHS_DIEPTSIZ9_PKTCNT_9                       (0x10000000UL)
#define USBHS_DIEPTSIZ9_MC_POS                         (29U)
#define USBHS_DIEPTSIZ9_MC                             (0x60000000UL)
#define USBHS_DIEPTSIZ9_MC_0                           (0x20000000UL)
#define USBHS_DIEPTSIZ9_MC_1                           (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA9 register  */
#define USBHS_DIEPDMA9                                 (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS9 register  */
#define USBHS_DTXFSTS9_INEPTXFSPCAVAIL                 (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL10 register  */
#define USBHS_DIEPCTL10_MPS_POS                        (0U)
#define USBHS_DIEPCTL10_MPS                            (0x000007FFUL)
#define USBHS_DIEPCTL10_MPS_0                          (0x00000001UL)
#define USBHS_DIEPCTL10_MPS_1                          (0x00000002UL)
#define USBHS_DIEPCTL10_MPS_2                          (0x00000004UL)
#define USBHS_DIEPCTL10_MPS_3                          (0x00000008UL)
#define USBHS_DIEPCTL10_MPS_4                          (0x00000010UL)
#define USBHS_DIEPCTL10_MPS_5                          (0x00000020UL)
#define USBHS_DIEPCTL10_MPS_6                          (0x00000040UL)
#define USBHS_DIEPCTL10_MPS_7                          (0x00000080UL)
#define USBHS_DIEPCTL10_MPS_8                          (0x00000100UL)
#define USBHS_DIEPCTL10_MPS_9                          (0x00000200UL)
#define USBHS_DIEPCTL10_MPS_10                         (0x00000400UL)
#define USBHS_DIEPCTL10_USBACTEP_POS                   (15U)
#define USBHS_DIEPCTL10_USBACTEP                       (0x00008000UL)
#define USBHS_DIEPCTL10_DPID_POS                       (16U)
#define USBHS_DIEPCTL10_DPID                           (0x00010000UL)
#define USBHS_DIEPCTL10_NAKSTS_POS                     (17U)
#define USBHS_DIEPCTL10_NAKSTS                         (0x00020000UL)
#define USBHS_DIEPCTL10_EPTYPE_POS                     (18U)
#define USBHS_DIEPCTL10_EPTYPE                         (0x000C0000UL)
#define USBHS_DIEPCTL10_EPTYPE_0                       (0x00040000UL)
#define USBHS_DIEPCTL10_EPTYPE_1                       (0x00080000UL)
#define USBHS_DIEPCTL10_STALL_POS                      (21U)
#define USBHS_DIEPCTL10_STALL                          (0x00200000UL)
#define USBHS_DIEPCTL10_TXFNUM_POS                     (22U)
#define USBHS_DIEPCTL10_TXFNUM                         (0x03C00000UL)
#define USBHS_DIEPCTL10_TXFNUM_0                       (0x00400000UL)
#define USBHS_DIEPCTL10_TXFNUM_1                       (0x00800000UL)
#define USBHS_DIEPCTL10_TXFNUM_2                       (0x01000000UL)
#define USBHS_DIEPCTL10_TXFNUM_3                       (0x02000000UL)
#define USBHS_DIEPCTL10_CNAK_POS                       (26U)
#define USBHS_DIEPCTL10_CNAK                           (0x04000000UL)
#define USBHS_DIEPCTL10_SNAK_POS                       (27U)
#define USBHS_DIEPCTL10_SNAK                           (0x08000000UL)
#define USBHS_DIEPCTL10_SETD0PID_POS                   (28U)
#define USBHS_DIEPCTL10_SETD0PID                       (0x10000000UL)
#define USBHS_DIEPCTL10_SETD1PID_POS                   (29U)
#define USBHS_DIEPCTL10_SETD1PID                       (0x20000000UL)
#define USBHS_DIEPCTL10_EPDIS_POS                      (30U)
#define USBHS_DIEPCTL10_EPDIS                          (0x40000000UL)
#define USBHS_DIEPCTL10_EPENA_POS                      (31U)
#define USBHS_DIEPCTL10_EPENA                          (0x80000000UL)

/*  Bit definition for USBHS_DIEPINT10 register  */
#define USBHS_DIEPINT10_XFERCOMPL_POS                  (0U)
#define USBHS_DIEPINT10_XFERCOMPL                      (0x00000001UL)
#define USBHS_DIEPINT10_EPDISBLD_POS                   (1U)
#define USBHS_DIEPINT10_EPDISBLD                       (0x00000002UL)
#define USBHS_DIEPINT10_AHBERR_POS                     (2U)
#define USBHS_DIEPINT10_AHBERR                         (0x00000004UL)
#define USBHS_DIEPINT10_TIMEOUT_POS                    (3U)
#define USBHS_DIEPINT10_TIMEOUT                        (0x00000008UL)
#define USBHS_DIEPINT10_INTKNTXFEMP_POS                (4U)
#define USBHS_DIEPINT10_INTKNTXFEMP                    (0x00000010UL)
#define USBHS_DIEPINT10_INTKNEPMIS_POS                 (5U)
#define USBHS_DIEPINT10_INTKNEPMIS                     (0x00000020UL)
#define USBHS_DIEPINT10_INEPNAKEFF_POS                 (6U)
#define USBHS_DIEPINT10_INEPNAKEFF                     (0x00000040UL)
#define USBHS_DIEPINT10_TXFEMP_POS                     (7U)
#define USBHS_DIEPINT10_TXFEMP                         (0x00000080UL)
#define USBHS_DIEPINT10_TXFIFOUNDRN_POS                (8U)
#define USBHS_DIEPINT10_TXFIFOUNDRN                    (0x00000100UL)
#define USBHS_DIEPINT10_BNAINTR_POS                    (9U)
#define USBHS_DIEPINT10_BNAINTR                        (0x00000200UL)
#define USBHS_DIEPINT10_PKTDRPSTS_POS                  (11U)
#define USBHS_DIEPINT10_PKTDRPSTS                      (0x00000800UL)
#define USBHS_DIEPINT10_BBLEERR_POS                    (12U)
#define USBHS_DIEPINT10_BBLEERR                        (0x00001000UL)
#define USBHS_DIEPINT10_NAKINTRPT_POS                  (13U)
#define USBHS_DIEPINT10_NAKINTRPT                      (0x00002000UL)
#define USBHS_DIEPINT10_NYETINTRPT_POS                 (14U)
#define USBHS_DIEPINT10_NYETINTRPT                     (0x00004000UL)

/*  Bit definition for USBHS_DIEPTSIZ10 register  */
#define USBHS_DIEPTSIZ10_XFERSIZE_POS                  (0U)
#define USBHS_DIEPTSIZ10_XFERSIZE                      (0x0007FFFFUL)
#define USBHS_DIEPTSIZ10_XFERSIZE_0                    (0x00000001UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_1                    (0x00000002UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_2                    (0x00000004UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_3                    (0x00000008UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_4                    (0x00000010UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_5                    (0x00000020UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_6                    (0x00000040UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_7                    (0x00000080UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_8                    (0x00000100UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_9                    (0x00000200UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_10                   (0x00000400UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_11                   (0x00000800UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_12                   (0x00001000UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_13                   (0x00002000UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_14                   (0x00004000UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_15                   (0x00008000UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_16                   (0x00010000UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_17                   (0x00020000UL)
#define USBHS_DIEPTSIZ10_XFERSIZE_18                   (0x00040000UL)
#define USBHS_DIEPTSIZ10_PKTCNT_POS                    (19U)
#define USBHS_DIEPTSIZ10_PKTCNT                        (0x1FF80000UL)
#define USBHS_DIEPTSIZ10_PKTCNT_0                      (0x00080000UL)
#define USBHS_DIEPTSIZ10_PKTCNT_1                      (0x00100000UL)
#define USBHS_DIEPTSIZ10_PKTCNT_2                      (0x00200000UL)
#define USBHS_DIEPTSIZ10_PKTCNT_3                      (0x00400000UL)
#define USBHS_DIEPTSIZ10_PKTCNT_4                      (0x00800000UL)
#define USBHS_DIEPTSIZ10_PKTCNT_5                      (0x01000000UL)
#define USBHS_DIEPTSIZ10_PKTCNT_6                      (0x02000000UL)
#define USBHS_DIEPTSIZ10_PKTCNT_7                      (0x04000000UL)
#define USBHS_DIEPTSIZ10_PKTCNT_8                      (0x08000000UL)
#define USBHS_DIEPTSIZ10_PKTCNT_9                      (0x10000000UL)
#define USBHS_DIEPTSIZ10_MC_POS                        (29U)
#define USBHS_DIEPTSIZ10_MC                            (0x60000000UL)
#define USBHS_DIEPTSIZ10_MC_0                          (0x20000000UL)
#define USBHS_DIEPTSIZ10_MC_1                          (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA10 register  */
#define USBHS_DIEPDMA10                                (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS10 register  */
#define USBHS_DTXFSTS10_INEPTXFSPCAVAIL                (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL11 register  */
#define USBHS_DIEPCTL11_MPS_POS                        (0U)
#define USBHS_DIEPCTL11_MPS                            (0x000007FFUL)
#define USBHS_DIEPCTL11_MPS_0                          (0x00000001UL)
#define USBHS_DIEPCTL11_MPS_1                          (0x00000002UL)
#define USBHS_DIEPCTL11_MPS_2                          (0x00000004UL)
#define USBHS_DIEPCTL11_MPS_3                          (0x00000008UL)
#define USBHS_DIEPCTL11_MPS_4                          (0x00000010UL)
#define USBHS_DIEPCTL11_MPS_5                          (0x00000020UL)
#define USBHS_DIEPCTL11_MPS_6                          (0x00000040UL)
#define USBHS_DIEPCTL11_MPS_7                          (0x00000080UL)
#define USBHS_DIEPCTL11_MPS_8                          (0x00000100UL)
#define USBHS_DIEPCTL11_MPS_9                          (0x00000200UL)
#define USBHS_DIEPCTL11_MPS_10                         (0x00000400UL)
#define USBHS_DIEPCTL11_USBACTEP_POS                   (15U)
#define USBHS_DIEPCTL11_USBACTEP                       (0x00008000UL)
#define USBHS_DIEPCTL11_DPID_POS                       (16U)
#define USBHS_DIEPCTL11_DPID                           (0x00010000UL)
#define USBHS_DIEPCTL11_NAKSTS_POS                     (17U)
#define USBHS_DIEPCTL11_NAKSTS                         (0x00020000UL)
#define USBHS_DIEPCTL11_EPTYPE_POS                     (18U)
#define USBHS_DIEPCTL11_EPTYPE                         (0x000C0000UL)
#define USBHS_DIEPCTL11_EPTYPE_0                       (0x00040000UL)
#define USBHS_DIEPCTL11_EPTYPE_1                       (0x00080000UL)
#define USBHS_DIEPCTL11_STALL_POS                      (21U)
#define USBHS_DIEPCTL11_STALL                          (0x00200000UL)
#define USBHS_DIEPCTL11_TXFNUM_POS                     (22U)
#define USBHS_DIEPCTL11_TXFNUM                         (0x03C00000UL)
#define USBHS_DIEPCTL11_TXFNUM_0                       (0x00400000UL)
#define USBHS_DIEPCTL11_TXFNUM_1                       (0x00800000UL)
#define USBHS_DIEPCTL11_TXFNUM_2                       (0x01000000UL)
#define USBHS_DIEPCTL11_TXFNUM_3                       (0x02000000UL)
#define USBHS_DIEPCTL11_CNAK_POS                       (26U)
#define USBHS_DIEPCTL11_CNAK                           (0x04000000UL)
#define USBHS_DIEPCTL11_SNAK_POS                       (27U)
#define USBHS_DIEPCTL11_SNAK                           (0x08000000UL)
#define USBHS_DIEPCTL11_SETD0PID_POS                   (28U)
#define USBHS_DIEPCTL11_SETD0PID                       (0x10000000UL)
#define USBHS_DIEPCTL11_SETD1PID_POS                   (29U)
#define USBHS_DIEPCTL11_SETD1PID                       (0x20000000UL)
#define USBHS_DIEPCTL11_EPDIS_POS                      (30U)
#define USBHS_DIEPCTL11_EPDIS                          (0x40000000UL)
#define USBHS_DIEPCTL11_EPENA_POS                      (31U)
#define USBHS_DIEPCTL11_EPENA                          (0x80000000UL)

