levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DIEPINT11 register  */
#define USBHS_DIEPINT11_XFERCOMPL_POS                  (0U)
#define USBHS_DIEPINT11_XFERCOMPL                      (0x00000001UL)
#define USBHS_DIEPINT11_EPDISBLD_POS                   (1U)
#define USBHS_DIEPINT11_EPDISBLD                       (0x00000002UL)
#define USBHS_DIEPINT11_AHBERR_POS                     (2U)
#define USBHS_DIEPINT11_AHBERR                         (0x00000004UL)
#define USBHS_DIEPINT11_TIMEOUT_POS                    (3U)
#define USBHS_DIEPINT11_TIMEOUT                        (0x00000008UL)
#define USBHS_DIEPINT11_INTKNTXFEMP_POS                (4U)
#define USBHS_DIEPINT11_INTKNTXFEMP                    (0x00000010UL)
#define USBHS_DIEPINT11_INTKNEPMIS_POS                 (5U)
#define USBHS_DIEPINT11_INTKNEPMIS                     (0x00000020UL)
#define USBHS_DIEPINT11_INEPNAKEFF_POS                 (6U)
#define USBHS_DIEPINT11_INEPNAKEFF                     (0x00000040UL)
#define USBHS_DIEPINT11_TXFEMP_POS                     (7U)
#define USBHS_DIEPINT11_TXFEMP                         (0x00000080UL)
#define USBHS_DIEPINT11_TXFIFOUNDRN_POS                (8U)
#define USBHS_DIEPINT11_TXFIFOUNDRN                    (0x00000100UL)
#define USBHS_DIEPINT11_BNAINTR_POS                    (9U)
#define USBHS_DIEPINT11_BNAINTR                        (0x00000200UL)
#define USBHS_DIEPINT11_PKTDRPSTS_POS                  (11U)
#define USBHS_DIEPINT11_PKTDRPSTS                      (0x00000800UL)
#define USBHS_DIEPINT11_BBLEERR_POS                    (12U)
#define USBHS_DIEPINT11_BBLEERR                        (0x00001000UL)
#define USBHS_DIEPINT11_NAKINTRPT_POS                  (13U)
#define USBHS_DIEPINT11_NAKINTRPT                      (0x00002000UL)
#define USBHS_DIEPINT11_NYETINTRPT_POS                 (14U)
#define USBHS_DIEPINT11_NYETINTRPT                     (0x00004000UL)

/*  Bit definition for USBHS_DIEPTSIZ11 register  */
#define USBHS_DIEPTSIZ11_XFERSIZE_POS                  (0U)
#define USBHS_DIEPTSIZ11_XFERSIZE                      (0x0007FFFFUL)
#define USBHS_DIEPTSIZ11_XFERSIZE_0                    (0x00000001UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_1                    (0x00000002UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_2                    (0x00000004UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_3                    (0x00000008UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_4                    (0x00000010UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_5                    (0x00000020UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_6                    (0x00000040UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_7                    (0x00000080UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_8                    (0x00000100UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_9                    (0x00000200UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_10                   (0x00000400UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_11                   (0x00000800UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_12                   (0x00001000UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_13                   (0x00002000UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_14                   (0x00004000UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_15                   (0x00008000UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_16                   (0x00010000UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_17                   (0x00020000UL)
#define USBHS_DIEPTSIZ11_XFERSIZE_18                   (0x00040000UL)
#define USBHS_DIEPTSIZ11_PKTCNT_POS                    (19U)
#define USBHS_DIEPTSIZ11_PKTCNT                        (0x1FF80000UL)
#define USBHS_DIEPTSIZ11_PKTCNT_0                      (0x00080000UL)
#define USBHS_DIEPTSIZ11_PKTCNT_1                      (0x00100000UL)
#define USBHS_DIEPTSIZ11_PKTCNT_2                      (0x00200000UL)
#define USBHS_DIEPTSIZ11_PKTCNT_3                      (0x00400000UL)
#define USBHS_DIEPTSIZ11_PKTCNT_4                      (0x00800000UL)
#define USBHS_DIEPTSIZ11_PKTCNT_5                      (0x01000000UL)
#define USBHS_DIEPTSIZ11_PKTCNT_6                      (0x02000000UL)
#define USBHS_DIEPTSIZ11_PKTCNT_7                      (0x04000000UL)
#define USBHS_DIEPTSIZ11_PKTCNT_8                      (0x08000000UL)
#define USBHS_DIEPTSIZ11_PKTCNT_9                      (0x10000000UL)
#define USBHS_DIEPTSIZ11_MC_POS                        (29U)
#define USBHS_DIEPTSIZ11_MC                            (0x60000000UL)
#define USBHS_DIEPTSIZ11_MC_0                          (0x20000000UL)
#define USBHS_DIEPTSIZ11_MC_1                          (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA11 register  */
#define USBHS_DIEPDMA11                                (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS11 register  */
#define USBHS_DTXFSTS11_INEPTXFSPCAVAIL                (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL12 register  */
#define USBHS_DIEPCTL12_MPS_POS                        (0U)
#define USBHS_DIEPCTL12_MPS                            (0x000007FFUL)
#define USBHS_DIEPCTL12_MPS_0                          (0x00000001UL)
#define USBHS_DIEPCTL12_MPS_1                          (0x00000002UL)
#define USBHS_DIEPCTL12_MPS_2                          (0x00000004UL)
#define USBHS_DIEPCTL12_MPS_3                          (0x00000008UL)
#define USBHS_DIEPCTL12_MPS_4                          (0x00000010UL)
#define USBHS_DIEPCTL12_MPS_5                          (0x00000020UL)
#define USBHS_DIEPCTL12_MPS_6                          (0x00000040UL)
#define USBHS_DIEPCTL12_MPS_7                          (0x00000080UL)
#define USBHS_DIEPCTL12_MPS_8                          (0x00000100UL)
#define USBHS_DIEPCTL12_MPS_9                          (0x00000200UL)
#define USBHS_DIEPCTL12_MPS_10                         (0x00000400UL)
#define USBHS_DIEPCTL12_USBACTEP_POS                   (15U)
#define USBHS_DIEPCTL12_USBACTEP                       (0x00008000UL)
#define USBHS_DIEPCTL12_DPID_POS                       (16U)
#define USBHS_DIEPCTL12_DPID                           (0x00010000UL)
#define USBHS_DIEPCTL12_NAKSTS_POS                     (17U)
#define USBHS_DIEPCTL12_NAKSTS                         (0x00020000UL)
#define USBHS_DIEPCTL12_EPTYPE_POS                     (18U)
#define USBHS_DIEPCTL12_EPTYPE                         (0x000C0000UL)
#define USBHS_DIEPCTL12_EPTYPE_0                       (0x00040000UL)
#define USBHS_DIEPCTL12_EPTYPE_1                       (0x00080000UL)
#define USBHS_DIEPCTL12_STALL_POS                      (21U)
#define USBHS_DIEPCTL12_STALL                          (0x00200000UL)
#define USBHS_DIEPCTL12_TXFNUM_POS                     (22U)
#define USBHS_DIEPCTL12_TXFNUM                         (0x03C00000UL)
#define USBHS_DIEPCTL12_TXFNUM_0                       (0x00400000UL)
#define USBHS_DIEPCTL12_TXFNUM_1                       (0x00800000UL)
#define USBHS_DIEPCTL12_TXFNUM_2                       (0x01000000UL)
#define USBHS_DIEPCTL12_TXFNUM_3                       (0x02000000UL)
#define USBHS_DIEPCTL12_CNAK_POS                       (26U)
#define USBHS_DIEPCTL12_CNAK                           (0x04000000UL)
#define USBHS_DIEPCTL12_SNAK_POS                       (27U)
#define USBHS_DIEPCTL12_SNAK                           (0x08000000UL)
#define USBHS_DIEPCTL12_SETD0PID_POS                   (28U)
#define USBHS_DIEPCTL12_SETD0PID                       (0x10000000UL)
#define USBHS_DIEPCTL12_SETD1PID_POS                   (29U)
#define USBHS_DIEPCTL12_SETD1PID                       (0x20000000UL)
#define USBHS_DIEPCTL12_EPDIS_POS                      (30U)
#define USBHS_DIEPCTL12_EPDIS                          (0x40000000UL)
#define USBHS_DIEPCTL12_EPENA_POS                      (31U)
#define USBHS_DIEPCTL12_EPENA                          (0x80000000UL)

/*  Bit definition for USBHS_DIEPINT12 register  */
#define USBHS_DIEPINT12_XFERCOMPL_POS                  (0U)
#define USBHS_DIEPINT12_XFERCOMPL                      (0x00000001UL)
#define USBHS_DIEPINT12_EPDISBLD_POS                   (1U)
#define USBHS_DIEPINT12_EPDISBLD                       (0x00000002UL)
#define USBHS_DIEPINT12_AHBERR_POS                     (2U)
#define USBHS_DIEPINT12_AHBERR                         (0x00000004UL)
#define USBHS_DIEPINT12_TIMEOUT_POS                    (3U)
#define USBHS_DIEPINT12_TIMEOUT                        (0x00000008UL)
#define USBHS_DIEPINT12_INTKNTXFEMP_POS                (4U)
#define USBHS_DIEPINT12_INTKNTXFEMP                    (0x00000010UL)
#define USBHS_DIEPINT12_INTKNEPMIS_POS                 (5U)
#define USBHS_DIEPINT12_INTKNEPMIS                     (0x00000020UL)
#define USBHS_DIEPINT12_INEPNAKEFF_POS                 (6U)
#define USBHS_DIEPINT12_INEPNAKEFF                     (0x00000040UL)
#define USBHS_DIEPINT12_TXFEMP_POS                     (7U)
#define USBHS_DIEPINT12_TXFEMP                         (0x00000080UL)
#define USBHS_DIEPINT12_TXFIFOUNDRN_POS                (8U)
#define USBHS_DIEPINT12_TXFIFOUNDRN                    (0x00000100UL)
#define USBHS_DIEPINT12_BNAINTR_POS                    (9U)
#define USBHS_DIEPINT12_BNAINTR                        (0x00000200UL)
#define USBHS_DIEPINT12_PKTDRPSTS_POS                  (11U)
#define USBHS_DIEPINT12_PKTDRPSTS                      (0x00000800UL)
#define USBHS_DIEPINT12_BBLEERR_POS                    (12U)
#define USBHS_DIEPINT12_BBLEERR                        (0x00001000UL)
#define USBHS_DIEPINT12_NAKINTRPT_POS                  (13U)
#define USBHS_DIEPINT12_NAKINTRPT                      (0x00002000UL)
#define USBHS_DIEPINT12_NYETINTRPT_POS                 (14U)
#define USBHS_DIEPINT12_NYETINTRPT                     (0x00004000UL)

