levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DIEPTSIZ12 register  */
#define USBHS_DIEPTSIZ12_XFERSIZE_POS                  (0U)
#define USBHS_DIEPTSIZ12_XFERSIZE                      (0x0007FFFFUL)
#define USBHS_DIEPTSIZ12_XFERSIZE_0                    (0x00000001UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_1                    (0x00000002UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_2                    (0x00000004UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_3                    (0x00000008UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_4                    (0x00000010UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_5                    (0x00000020UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_6                    (0x00000040UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_7                    (0x00000080UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_8                    (0x00000100UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_9                    (0x00000200UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_10                   (0x00000400UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_11                   (0x00000800UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_12                   (0x00001000UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_13                   (0x00002000UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_14                   (0x00004000UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_15                   (0x00008000UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_16                   (0x00010000UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_17                   (0x00020000UL)
#define USBHS_DIEPTSIZ12_XFERSIZE_18                   (0x00040000UL)
#define USBHS_DIEPTSIZ12_PKTCNT_POS                    (19U)
#define USBHS_DIEPTSIZ12_PKTCNT                        (0x1FF80000UL)
#define USBHS_DIEPTSIZ12_PKTCNT_0                      (0x00080000UL)
#define USBHS_DIEPTSIZ12_PKTCNT_1                      (0x00100000UL)
#define USBHS_DIEPTSIZ12_PKTCNT_2                      (0x00200000UL)
#define USBHS_DIEPTSIZ12_PKTCNT_3                      (0x00400000UL)
#define USBHS_DIEPTSIZ12_PKTCNT_4                      (0x00800000UL)
#define USBHS_DIEPTSIZ12_PKTCNT_5                      (0x01000000UL)
#define USBHS_DIEPTSIZ12_PKTCNT_6                      (0x02000000UL)
#define USBHS_DIEPTSIZ12_PKTCNT_7                      (0x04000000UL)
#define USBHS_DIEPTSIZ12_PKTCNT_8                      (0x08000000UL)
#define USBHS_DIEPTSIZ12_PKTCNT_9                      (0x10000000UL)
#define USBHS_DIEPTSIZ12_MC_POS                        (29U)
#define USBHS_DIEPTSIZ12_MC                            (0x60000000UL)
#define USBHS_DIEPTSIZ12_MC_0                          (0x20000000UL)
#define USBHS_DIEPTSIZ12_MC_1                          (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA12 register  */
#define USBHS_DIEPDMA12                                (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS12 register  */
#define USBHS_DTXFSTS12_INEPTXFSPCAVAIL                (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL13 register  */
#define USBHS_DIEPCTL13_MPS_POS                        (0U)
#define USBHS_DIEPCTL13_MPS                            (0x000007FFUL)
#define USBHS_DIEPCTL13_MPS_0                          (0x00000001UL)
#define USBHS_DIEPCTL13_MPS_1                          (0x00000002UL)
#define USBHS_DIEPCTL13_MPS_2                          (0x00000004UL)
#define USBHS_DIEPCTL13_MPS_3                          (0x00000008UL)
#define USBHS_DIEPCTL13_MPS_4                          (0x00000010UL)
#define USBHS_DIEPCTL13_MPS_5                          (0x00000020UL)
#define USBHS_DIEPCTL13_MPS_6                          (0x00000040UL)
#define USBHS_DIEPCTL13_MPS_7                          (0x00000080UL)
#define USBHS_DIEPCTL13_MPS_8                          (0x00000100UL)
#define USBHS_DIEPCTL13_MPS_9                          (0x00000200UL)
#define USBHS_DIEPCTL13_MPS_10                         (0x00000400UL)
#define USBHS_DIEPCTL13_USBACTEP_POS                   (15U)
#define USBHS_DIEPCTL13_USBACTEP                       (0x00008000UL)
#define USBHS_DIEPCTL13_DPID_POS                       (16U)
#define USBHS_DIEPCTL13_DPID                           (0x00010000UL)
#define USBHS_DIEPCTL13_NAKSTS_POS                     (17U)
#define USBHS_DIEPCTL13_NAKSTS                         (0x00020000UL)
#define USBHS_DIEPCTL13_EPTYPE_POS                     (18U)
#define USBHS_DIEPCTL13_EPTYPE                         (0x000C0000UL)
#define USBHS_DIEPCTL13_EPTYPE_0                       (0x00040000UL)
#define USBHS_DIEPCTL13_EPTYPE_1                       (0x00080000UL)
#define USBHS_DIEPCTL13_STALL_POS                      (21U)
#define USBHS_DIEPCTL13_STALL                          (0x00200000UL)
#define USBHS_DIEPCTL13_TXFNUM_POS                     (22U)
#define USBHS_DIEPCTL13_TXFNUM                         (0x03C00000UL)
#define USBHS_DIEPCTL13_TXFNUM_0                       (0x00400000UL)
#define USBHS_DIEPCTL13_TXFNUM_1                       (0x00800000UL)
#define USBHS_DIEPCTL13_TXFNUM_2                       (0x01000000UL)
#define USBHS_DIEPCTL13_TXFNUM_3                       (0x02000000UL)
#define USBHS_DIEPCTL13_CNAK_POS                       (26U)
#define USBHS_DIEPCTL13_CNAK                           (0x04000000UL)
#define USBHS_DIEPCTL13_SNAK_POS                       (27U)
#define USBHS_DIEPCTL13_SNAK                           (0x08000000UL)
#define USBHS_DIEPCTL13_SETD0PID_POS                   (28U)
#define USBHS_DIEPCTL13_SETD0PID                       (0x10000000UL)
#define USBHS_DIEPCTL13_SETD1PID_POS                   (29U)
#define USBHS_DIEPCTL13_SETD1PID                       (0x20000000UL)
#define USBHS_DIEPCTL13_EPDIS_POS                      (30U)
#define USBHS_DIEPCTL13_EPDIS                          (0x40000000UL)
#define USBHS_DIEPCTL13_EPENA_POS                      (31U)
#define USBHS_DIEPCTL13_EPENA                          (0x80000000UL)

/*  Bit definition for USBHS_DIEPINT13 register  */
#define USBHS_DIEPINT13_XFERCOMPL_POS                  (0U)
#define USBHS_DIEPINT13_XFERCOMPL                      (0x00000001UL)
#define USBHS_DIEPINT13_EPDISBLD_POS                   (1U)
#define USBHS_DIEPINT13_EPDISBLD                       (0x00000002UL)
#define USBHS_DIEPINT13_AHBERR_POS                     (2U)
#define USBHS_DIEPINT13_AHBERR                         (0x00000004UL)
#define USBHS_DIEPINT13_TIMEOUT_POS                    (3U)
#define USBHS_DIEPINT13_TIMEOUT                        (0x00000008UL)
#define USBHS_DIEPINT13_INTKNTXFEMP_POS                (4U)
#define USBHS_DIEPINT13_INTKNTXFEMP                    (0x00000010UL)
#define USBHS_DIEPINT13_INTKNEPMIS_POS                 (5U)
#define USBHS_DIEPINT13_INTKNEPMIS                     (0x00000020UL)
#define USBHS_DIEPINT13_INEPNAKEFF_POS                 (6U)
#define USBHS_DIEPINT13_INEPNAKEFF                     (0x00000040UL)
#define USBHS_DIEPINT13_TXFEMP_POS                     (7U)
#define USBHS_DIEPINT13_TXFEMP                         (0x00000080UL)
#define USBHS_DIEPINT13_TXFIFOUNDRN_POS                (8U)
#define USBHS_DIEPINT13_TXFIFOUNDRN                    (0x00000100UL)
#define USBHS_DIEPINT13_BNAINTR_POS                    (9U)
#define USBHS_DIEPINT13_BNAINTR                        (0x00000200UL)
#define USBHS_DIEPINT13_PKTDRPSTS_POS                  (11U)
#define USBHS_DIEPINT13_PKTDRPSTS                      (0x00000800UL)
#define USBHS_DIEPINT13_BBLEERR_POS                    (12U)
#define USBHS_DIEPINT13_BBLEERR                        (0x00001000UL)
#define USBHS_DIEPINT13_NAKINTRPT_POS                  (13U)
#define USBHS_DIEPINT13_NAKINTRPT                      (0x00002000UL)
#define USBHS_DIEPINT13_NYETINTRPT_POS                 (14U)
#define USBHS_DIEPINT13_NYETINTRPT                     (0x00004000UL)

/*  Bit definition for USBHS_DIEPTSIZ13 register  */
#define USBHS_DIEPTSIZ13_XFERSIZE_POS                  (0U)
#define USBHS_DIEPTSIZ13_XFERSIZE                      (0x0007FFFFUL)
#define USBHS_DIEPTSIZ13_XFERSIZE_0                    (0x00000001UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_1                    (0x00000002UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_2                    (0x00000004UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_3                    (0x00000008UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_4                    (0x00000010UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_5                    (0x00000020UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_6                    (0x00000040UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_7                    (0x00000080UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_8                    (0x00000100UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_9                    (0x00000200UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_10                   (0x00000400UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_11                   (0x00000800UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_12                   (0x00001000UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_13                   (0x00002000UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_14                   (0x00004000UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_15                   (0x00008000UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_16                   (0x00010000UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_17                   (0x00020000UL)
#define USBHS_DIEPTSIZ13_XFERSIZE_18                   (0x00040000UL)
#define USBHS_DIEPTSIZ13_PKTCNT_POS                    (19U)
#define USBHS_DIEPTSIZ13_PKTCNT                        (0x1FF80000UL)
#define USBHS_DIEPTSIZ13_PKTCNT_0                      (0x00080000UL)
#define USBHS_DIEPTSIZ13_PKTCNT_1                      (0x00100000UL)
#define USBHS_DIEPTSIZ13_PKTCNT_2                      (0x00200000UL)
#define USBHS_DIEPTSIZ13_PKTCNT_3                      (0x00400000UL)
#define USBHS_DIEPTSIZ13_PKTCNT_4                      (0x00800000UL)
#define USBHS_DIEPTSIZ13_PKTCNT_5                      (0x01000000UL)
#define USBHS_DIEPTSIZ13_PKTCNT_6                      (0x02000000UL)
#define USBHS_DIEPTSIZ13_PKTCNT_7                      (0x04000000UL)
#define USBHS_DIEPTSIZ13_PKTCNT_8                      (0x08000000UL)
#define USBHS_DIEPTSIZ13_PKTCNT_9                      (0x10000000UL)
#define USBHS_DIEPTSIZ13_MC_POS                        (29U)
#define USBHS_DIEPTSIZ13_MC                            (0x60000000UL)
#define USBHS_DIEPTSIZ13_MC_0                          (0x20000000UL)
#define USBHS_DIEPTSIZ13_MC_1                          (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA13 register  */
#define USBHS_DIEPDMA13                                (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS13 register  */
#define USBHS_DTXFSTS13_INEPTXFSPCAVAIL                (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL14 register  */
#define USBHS_DIEPCTL14_MPS_POS                        (0U)
#define USBHS_DIEPCTL14_MPS                            (0x000007FFUL)
#define USBHS_DIEPCTL14_MPS_0                          (0x00000001UL)
#define USBHS_DIEPCTL14_MPS_1                          (0x00000002UL)
#define USBHS_DIEPCTL14_MPS_2                          (0x00000004UL)
#define USBHS_DIEPCTL14_MPS_3                          (0x00000008UL)
#define USBHS_DIEPCTL14_MPS_4                          (0x00000010UL)
#define USBHS_DIEPCTL14_MPS_5                          (0x00000020UL)
#define USBHS_DIEPCTL14_MPS_6                          (0x00000040UL)
#define USBHS_DIEPCTL14_MPS_7                          (0x00000080UL)
#define USBHS_DIEPCTL14_MPS_8                          (0x00000100UL)
#define USBHS_DIEPCTL14_MPS_9                          (0x00000200UL)
#define USBHS_DIEPCTL14_MPS_10                         (0x00000400UL)
#define USBHS_DIEPCTL14_USBACTEP_POS                   (15U)
#define USBHS_DIEPCTL14_USBACTEP                       (0x00008000UL)
#define USBHS_DIEPCTL14_DPID_POS                       (16U)
#define USBHS_DIEPCTL14_DPID                           (0x00010000UL)
#define USBHS_DIEPCTL14_NAKSTS_POS                     (17U)
#define USBHS_DIEPCTL14_NAKSTS                         (0x00020000UL)
#define USBHS_DIEPCTL14_EPTYPE_POS                     (18U)
#define USBHS_DIEPCTL14_EPTYPE                         (0x000C0000UL)
#define USBHS_DIEPCTL14_EPTYPE_0                       (0x00040000UL)
#define USBHS_DIEPCTL14_EPTYPE_1                       (0x00080000UL)
#define USBHS_DIEPCTL14_STALL_POS                      (21U)
#define USBHS_DIEPCTL14_STALL                          (0x00200000UL)
#define USBHS_DIEPCTL14_TXFNUM_POS                     (22U)
#define USBHS_DIEPCTL14_TXFNUM                         (0x03C00000UL)
#define USBHS_DIEPCTL14_TXFNUM_0                       (0x00400000UL)
#define USBHS_DIEPCTL14_TXFNUM_1                       (0x00800000UL)
#define USBHS_DIEPCTL14_TXFNUM_2                       (0x01000000UL)
#define USBHS_DIEPCTL14_TXFNUM_3                       (0x02000000UL)
#define USBHS_DIEPCTL14_CNAK_POS                       (26U)
#define USBHS_DIEPCTL14_CNAK                           (0x04000000UL)
#define USBHS_DIEPCTL14_SNAK_POS                       (27U)
#define USBHS_DIEPCTL14_SNAK                           (0x08000000UL)
#define USBHS_DIEPCTL14_SETD0PID_POS                   (28U)
#define USBHS_DIEPCTL14_SETD0PID                       (0x10000000UL)
#define USBHS_DIEPCTL14_SETD1PID_POS                   (29U)
#define USBHS_DIEPCTL14_SETD1PID                       (0x20000000UL)
#define USBHS_DIEPCTL14_EPDIS_POS                      (30U)
#define USBHS_DIEPCTL14_EPDIS                          (0x40000000UL)
#define USBHS_DIEPCTL14_EPENA_POS                      (31U)
#define USBHS_DIEPCTL14_EPENA                          (0x80000000UL)

/*  Bit definition for USBHS_DIEPINT14 register  */
#define USBHS_DIEPINT14_XFERCOMPL_POS                  (0U)
#define USBHS_DIEPINT14_XFERCOMPL                      (0x00000001UL)
#define USBHS_DIEPINT14_EPDISBLD_POS                   (1U)
#define USBHS_DIEPINT14_EPDISBLD                       (0x00000002UL)
#define USBHS_DIEPINT14_AHBERR_POS                     (2U)
#define USBHS_DIEPINT14_AHBERR                         (0x00000004UL)
#define USBHS_DIEPINT14_TIMEOUT_POS                    (3U)
#define USBHS_DIEPINT14_TIMEOUT                        (0x00000008UL)
#define USBHS_DIEPINT14_INTKNTXFEMP_POS                (4U)
#define USBHS_DIEPINT14_INTKNTXFEMP                    (0x00000010UL)
#define USBHS_DIEPINT14_INTKNEPMIS_POS                 (5U)
#define USBHS_DIEPINT14_INTKNEPMIS                     (0x00000020UL)
#define USBHS_DIEPINT14_INEPNAKEFF_POS                 (6U)
#define USBHS_DIEPINT14_INEPNAKEFF                     (0x00000040UL)
#define USBHS_DIEPINT14_TXFEMP_POS                     (7U)
#define USBHS_DIEPINT14_TXFEMP                         (0x00000080UL)
#define USBHS_DIEPINT14_TXFIFOUNDRN_POS                (8U)
#define USBHS_DIEPINT14_TXFIFOUNDRN                    (0x00000100UL)
#define USBHS_DIEPINT14_BNAINTR_POS                    (9U)
#define USBHS_DIEPINT14_BNAINTR                        (0x00000200UL)
#define USBHS_DIEPINT14_PKTDRPSTS_POS                  (11U)
#define USBHS_DIEPINT14_PKTDRPSTS                      (0x00000800UL)
#define USBHS_DIEPINT14_BBLEERR_POS                    (12U)
#define USBHS_DIEPINT14_BBLEERR                        (0x00001000UL)
#define USBHS_DIEPINT14_NAKINTRPT_POS                  (13U)
#define USBHS_DIEPINT14_NAKINTRPT                      (0x00002000UL)
#define USBHS_DIEPINT14_NYETINTRPT_POS                 (14U)
#define USBHS_DIEPINT14_NYETINTRPT                     (0x00004000UL)

/*  Bit definition for USBHS_DIEPTSIZ14 register  */
#define USBHS_DIEPTSIZ14_XFERSIZE_POS                  (0U)
#define USBHS_DIEPTSIZ14_XFERSIZE                      (0x0007FFFFUL)
#define USBHS_DIEPTSIZ14_XFERSIZE_0                    (0x00000001UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_1                    (0x00000002UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_2                    (0x00000004UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_3                    (0x00000008UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_4                    (0x00000010UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_5                    (0x00000020UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_6                    (0x00000040UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_7                    (0x00000080UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_8                    (0x00000100UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_9                    (0x00000200UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_10                   (0x00000400UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_11                   (0x00000800UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_12                   (0x00001000UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_13                   (0x00002000UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_14                   (0x00004000UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_15                   (0x00008000UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_16                   (0x00010000UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_17                   (0x00020000UL)
#define USBHS_DIEPTSIZ14_XFERSIZE_18                   (0x00040000UL)
#define USBHS_DIEPTSIZ14_PKTCNT_POS                    (19U)
#define USBHS_DIEPTSIZ14_PKTCNT                        (0x1FF80000UL)
#define USBHS_DIEPTSIZ14_PKTCNT_0                      (0x00080000UL)
#define USBHS_DIEPTSIZ14_PKTCNT_1                      (0x00100000UL)
#define USBHS_DIEPTSIZ14_PKTCNT_2                      (0x00200000UL)
#define USBHS_DIEPTSIZ14_PKTCNT_3                      (0x00400000UL)
#define USBHS_DIEPTSIZ14_PKTCNT_4                      (0x00800000UL)
#define USBHS_DIEPTSIZ14_PKTCNT_5                      (0x01000000UL)
#define USBHS_DIEPTSIZ14_PKTCNT_6                      (0x02000000UL)
#define USBHS_DIEPTSIZ14_PKTCNT_7                      (0x04000000UL)
#define USBHS_DIEPTSIZ14_PKTCNT_8                      (0x08000000UL)
#define USBHS_DIEPTSIZ14_PKTCNT_9                      (0x10000000UL)
#define USBHS_DIEPTSIZ14_MC_POS                        (29U)
#define USBHS_DIEPTSIZ14_MC                            (0x60000000UL)
#define USBHS_DIEPTSIZ14_MC_0                          (0x20000000UL)
#define USBHS_DIEPTSIZ14_MC_1                          (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA14 register  */
#define USBHS_DIEPDMA14                                (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS14 register  */
#define USBHS_DTXFSTS14_INEPTXFSPCAVAIL                (0x0000FFFFUL)

/*  Bit definition for USBHS_DIEPCTL15 register  */
#define USBHS_DIEPCTL15_MPS_POS                        (0U)
#define USBHS_DIEPCTL15_MPS                            (0x000007FFUL)
#define USBHS_DIEPCTL15_MPS_0                          (0x00000001UL)
#define USBHS_DIEPCTL15_MPS_1                          (0x00000002UL)
#define USBHS_DIEPCTL15_MPS_2                          (0x00000004UL)
#define USBHS_DIEPCTL15_MPS_3                          (0x00000008UL)
#define USBHS_DIEPCTL15_MPS_4                          (0x00000010UL)
#define USBHS_DIEPCTL15_MPS_5                          (0x00000020UL)
#define USBHS_DIEPCTL15_MPS_6                          (0x00000040UL)
#define USBHS_DIEPCTL15_MPS_7                          (0x00000080UL)
#define USBHS_DIEPCTL15_MPS_8                          (0x00000100UL)
#define USBHS_DIEPCTL15_MPS_9                          (0x00000200UL)
#define USBHS_DIEPCTL15_MPS_10                         (0x00000400UL)
#define USBHS_DIEPCTL15_USBACTEP_POS                   (15U)
#define USBHS_DIEPCTL15_USBACTEP                       (0x00008000UL)
#define USBHS_DIEPCTL15_DPID_POS                       (16U)
#define USBHS_DIEPCTL15_DPID                           (0x00010000UL)
#define USBHS_DIEPCTL15_NAKSTS_POS                     (17U)
#define USBHS_DIEPCTL15_NAKSTS                         (0x00020000UL)
#define USBHS_DIEPCTL15_EPTYPE_POS                     (18U)
#define USBHS_DIEPCTL15_EPTYPE                         (0x000C0000UL)
#define USBHS_DIEPCTL15_EPTYPE_0                       (0x00040000UL)
#define USBHS_DIEPCTL15_EPTYPE_1                       (0x00080000UL)
#define USBHS_DIEPCTL15_STALL_POS                      (21U)
#define USBHS_DIEPCTL15_STALL                          (0x00200000UL)
#define USBHS_DIEPCTL15_TXFNUM_POS                     (22U)
#define USBHS_DIEPCTL15_TXFNUM                         (0x03C00000UL)
#define USBHS_DIEPCTL15_TXFNUM_0                       (0x00400000UL)
#define USBHS_DIEPCTL15_TXFNUM_1                       (0x00800000UL)
#define USBHS_DIEPCTL15_TXFNUM_2                       (0x01000000UL)
#define USBHS_DIEPCTL15_TXFNUM_3                       (0x02000000UL)
#define USBHS_DIEPCTL15_CNAK_POS                       (26U)
#define USBHS_DIEPCTL15_CNAK                           (0x04000000UL)
#define USBHS_DIEPCTL15_SNAK_POS                       (27U)
#define USBHS_DIEPCTL15_SNAK                           (0x08000000UL)
#define USBHS_DIEPCTL15_SETD0PID_POS                   (28U)
#define USBHS_DIEPCTL15_SETD0PID                       (0x10000000UL)
#define USBHS_DIEPCTL15_SETD1PID_POS                   (29U)
#define USBHS_DIEPCTL15_SETD1PID                       (0x20000000UL)
#define USBHS_DIEPCTL15_EPDIS_POS                      (30U)
#define USBHS_DIEPCTL15_EPDIS                          (0x40000000UL)
#define USBHS_DIEPCTL15_EPENA_POS                      (31U)
#define USBHS_DIEPCTL15_EPENA                          (0x80000000UL)

/*  Bit definition for USBHS_DIEPINT15 register  */
#define USBHS_DIEPINT15_XFERCOMPL_POS                  (0U)
#define USBHS_DIEPINT15_XFERCOMPL                      (0x00000001UL)
#define USBHS_DIEPINT15_EPDISBLD_POS                   (1U)
#define USBHS_DIEPINT15_EPDISBLD                       (0x00000002UL)
#define USBHS_DIEPINT15_AHBERR_POS                     (2U)
#define USBHS_DIEPINT15_AHBERR                         (0x00000004UL)
#define USBHS_DIEPINT15_TIMEOUT_POS                    (3U)
#define USBHS_DIEPINT15_TIMEOUT                        (0x00000008UL)
#define USBHS_DIEPINT15_INTKNTXFEMP_POS                (4U)
#define USBHS_DIEPINT15_INTKNTXFEMP                    (0x00000010UL)
#define USBHS_DIEPINT15_INTKNEPMIS_POS                 (5U)
#define USBHS_DIEPINT15_INTKNEPMIS                     (0x00000020UL)
#define USBHS_DIEPINT15_INEPNAKEFF_POS                 (6U)
#define USBHS_DIEPINT15_INEPNAKEFF                     (0x00000040UL)
#define USBHS_DIEPINT15_TXFEMP_POS                     (7U)
#define USBHS_DIEPINT15_TXFEMP                         (0x00000080UL)
#define USBHS_DIEPINT15_TXFIFOUNDRN_POS                (8U)
#define USBHS_DIEPINT15_TXFIFOUNDRN                    (0x00000100UL)
#define USBHS_DIEPINT15_BNAINTR_POS                    (9U)
#define USBHS_DIEPINT15_BNAINTR                        (0x00000200UL)
#define USBHS_DIEPINT15_PKTDRPSTS_POS                  (11U)
#define USBHS_DIEPINT15_PKTDRPSTS                      (0x00000800UL)
#define USBHS_DIEPINT15_BBLEERR_POS                    (12U)
#define USBHS_DIEPINT15_BBLEERR                        (0x00001000UL)
#define USBHS_DIEPINT15_NAKINTRPT_POS                  (13U)
#define USBHS_DIEPINT15_NAKINTRPT                      (0x00002000UL)
#define USBHS_DIEPINT15_NYETINTRPT_POS                 (14U)
#define USBHS_DIEPINT15_NYETINTRPT                     (0x00004000UL)

