levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DIEPTSIZ15 register  */
#define USBHS_DIEPTSIZ15_XFERSIZE_POS                  (0U)
#define USBHS_DIEPTSIZ15_XFERSIZE                      (0x0007FFFFUL)
#define USBHS_DIEPTSIZ15_XFERSIZE_0                    (0x00000001UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_1                    (0x00000002UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_2                    (0x00000004UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_3                    (0x00000008UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_4                    (0x00000010UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_5                    (0x00000020UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_6                    (0x00000040UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_7                    (0x00000080UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_8                    (0x00000100UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_9                    (0x00000200UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_10                   (0x00000400UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_11                   (0x00000800UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_12                   (0x00001000UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_13                   (0x00002000UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_14                   (0x00004000UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_15                   (0x00008000UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_16                   (0x00010000UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_17                   (0x00020000UL)
#define USBHS_DIEPTSIZ15_XFERSIZE_18                   (0x00040000UL)
#define USBHS_DIEPTSIZ15_PKTCNT_POS                    (19U)
#define USBHS_DIEPTSIZ15_PKTCNT                        (0x1FF80000UL)
#define USBHS_DIEPTSIZ15_PKTCNT_0                      (0x00080000UL)
#define USBHS_DIEPTSIZ15_PKTCNT_1                      (0x00100000UL)
#define USBHS_DIEPTSIZ15_PKTCNT_2                      (0x00200000UL)
#define USBHS_DIEPTSIZ15_PKTCNT_3                      (0x00400000UL)
#define USBHS_DIEPTSIZ15_PKTCNT_4                      (0x00800000UL)
#define USBHS_DIEPTSIZ15_PKTCNT_5                      (0x01000000UL)
#define USBHS_DIEPTSIZ15_PKTCNT_6                      (0x02000000UL)
#define USBHS_DIEPTSIZ15_PKTCNT_7                      (0x04000000UL)
#define USBHS_DIEPTSIZ15_PKTCNT_8                      (0x08000000UL)
#define USBHS_DIEPTSIZ15_PKTCNT_9                      (0x10000000UL)
#define USBHS_DIEPTSIZ15_MC_POS                        (29U)
#define USBHS_DIEPTSIZ15_MC                            (0x60000000UL)
#define USBHS_DIEPTSIZ15_MC_0                          (0x20000000UL)
#define USBHS_DIEPTSIZ15_MC_1                          (0x40000000UL)

/*  Bit definition for USBHS_DIEPDMA15 register  */
#define USBHS_DIEPDMA15                                (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DTXFSTS15 register  */
#define USBHS_DTXFSTS15_INEPTXFSPCAVAIL                (0x0000FFFFUL)

/*  Bit definition for USBHS_DOEPCTL0 register  */
#define USBHS_DOEPCTL0_MPS_POS                         (0U)
#define USBHS_DOEPCTL0_MPS                             (0x00000003UL)
#define USBHS_DOEPCTL0_MPS_0                           (0x00000001UL)
#define USBHS_DOEPCTL0_MPS_1                           (0x00000002UL)
#define USBHS_DOEPCTL0_USBACTEP_POS                    (15U)
#define USBHS_DOEPCTL0_USBACTEP                        (0x00008000UL)
#define USBHS_DOEPCTL0_NAKSTS_POS                      (17U)
#define USBHS_DOEPCTL0_NAKSTS                          (0x00020000UL)
#define USBHS_DOEPCTL0_EPTYPE_POS                      (18U)
#define USBHS_DOEPCTL0_EPTYPE                          (0x000C0000UL)
#define USBHS_DOEPCTL0_EPTYPE_0                        (0x00040000UL)
#define USBHS_DOEPCTL0_EPTYPE_1                        (0x00080000UL)
#define USBHS_DOEPCTL0_SNP_POS                         (20U)
#define USBHS_DOEPCTL0_SNP                             (0x00100000UL)
#define USBHS_DOEPCTL0_STALL_POS                       (21U)
#define USBHS_DOEPCTL0_STALL                           (0x00200000UL)
#define USBHS_DOEPCTL0_CNAK_POS                        (26U)
#define USBHS_DOEPCTL0_CNAK                            (0x04000000UL)
#define USBHS_DOEPCTL0_SNAK_POS                        (27U)
#define USBHS_DOEPCTL0_SNAK                            (0x08000000UL)
#define USBHS_DOEPCTL0_EPDIS_POS                       (30U)
#define USBHS_DOEPCTL0_EPDIS                           (0x40000000UL)
#define USBHS_DOEPCTL0_EPENA_POS                       (31U)
#define USBHS_DOEPCTL0_EPENA                           (0x80000000UL)

/*  Bit definition for USBHS_DOEPINT0 register  */
#define USBHS_DOEPINT0_XFERCOMPL_POS                   (0U)
#define USBHS_DOEPINT0_XFERCOMPL                       (0x00000001UL)
#define USBHS_DOEPINT0_EPDISBLD_POS                    (1U)
#define USBHS_DOEPINT0_EPDISBLD                        (0x00000002UL)
#define USBHS_DOEPINT0_AHBERR_POS                      (2U)
#define USBHS_DOEPINT0_AHBERR                          (0x00000004UL)
#define USBHS_DOEPINT0_SETUP_POS                       (3U)
#define USBHS_DOEPINT0_SETUP                           (0x00000008UL)
#define USBHS_DOEPINT0_OUTTKNEPDIS_POS                 (4U)
#define USBHS_DOEPINT0_OUTTKNEPDIS                     (0x00000010UL)
#define USBHS_DOEPINT0_STSPHSERCVD_POS                 (5U)
#define USBHS_DOEPINT0_STSPHSERCVD                     (0x00000020UL)
#define USBHS_DOEPINT0_BACK2BACKSETUP_POS              (6U)
#define USBHS_DOEPINT0_BACK2BACKSETUP                  (0x00000040UL)
#define USBHS_DOEPINT0_OUTPKTERR_POS                   (8U)
#define USBHS_DOEPINT0_OUTPKTERR                       (0x00000100UL)
#define USBHS_DOEPINT0_BNAINTR_POS                     (9U)
#define USBHS_DOEPINT0_BNAINTR                         (0x00000200UL)
#define USBHS_DOEPINT0_PKTDRPSTS_POS                   (11U)
#define USBHS_DOEPINT0_PKTDRPSTS                       (0x00000800UL)
#define USBHS_DOEPINT0_BBLEERR_POS                     (12U)
#define USBHS_DOEPINT0_BBLEERR                         (0x00001000UL)
#define USBHS_DOEPINT0_NAKINTRPT_POS                   (13U)
#define USBHS_DOEPINT0_NAKINTRPT                       (0x00002000UL)
#define USBHS_DOEPINT0_NYETINTRPT_POS                  (14U)
#define USBHS_DOEPINT0_NYETINTRPT                      (0x00004000UL)
#define USBHS_DOEPINT0_STUPPKTRCVD_POS                 (15U)
#define USBHS_DOEPINT0_STUPPKTRCVD                     (0x00008000UL)

/*  Bit definition for USBHS_DOEPTSIZ0 register  */
#define USBHS_DOEPTSIZ0_XFERSIZE_POS                   (0U)
#define USBHS_DOEPTSIZ0_XFERSIZE                       (0x0000007FUL)
#define USBHS_DOEPTSIZ0_XFERSIZE_0                     (0x00000001UL)
#define USBHS_DOEPTSIZ0_XFERSIZE_1                     (0x00000002UL)
#define USBHS_DOEPTSIZ0_XFERSIZE_2                     (0x00000004UL)
#define USBHS_DOEPTSIZ0_XFERSIZE_3                     (0x00000008UL)
#define USBHS_DOEPTSIZ0_XFERSIZE_4                     (0x00000010UL)
#define USBHS_DOEPTSIZ0_XFERSIZE_5                     (0x00000020UL)
#define USBHS_DOEPTSIZ0_XFERSIZE_6                     (0x00000040UL)
#define USBHS_DOEPTSIZ0_PKTCNT_POS                     (19U)
#define USBHS_DOEPTSIZ0_PKTCNT                         (0x00080000UL)
#define USBHS_DOEPTSIZ0_SUPCNT_POS                     (29U)
#define USBHS_DOEPTSIZ0_SUPCNT                         (0x60000000UL)
#define USBHS_DOEPTSIZ0_SUPCNT_0                       (0x20000000UL)
#define USBHS_DOEPTSIZ0_SUPCNT_1                       (0x40000000UL)

