levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DOEPDMA0 register  */
#define USBHS_DOEPDMA0                                 (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DOEPCTL1 register  */
#define USBHS_DOEPCTL1_MPS_POS                         (0U)
#define USBHS_DOEPCTL1_MPS                             (0x000007FFUL)
#define USBHS_DOEPCTL1_MPS_0                           (0x00000001UL)
#define USBHS_DOEPCTL1_MPS_1                           (0x00000002UL)
#define USBHS_DOEPCTL1_MPS_2                           (0x00000004UL)
#define USBHS_DOEPCTL1_MPS_3                           (0x00000008UL)
#define USBHS_DOEPCTL1_MPS_4                           (0x00000010UL)
#define USBHS_DOEPCTL1_MPS_5                           (0x00000020UL)
#define USBHS_DOEPCTL1_MPS_6                           (0x00000040UL)
#define USBHS_DOEPCTL1_MPS_7                           (0x00000080UL)
#define USBHS_DOEPCTL1_MPS_8                           (0x00000100UL)
#define USBHS_DOEPCTL1_MPS_9                           (0x00000200UL)
#define USBHS_DOEPCTL1_MPS_10                          (0x00000400UL)
#define USBHS_DOEPCTL1_USBACTEP_POS                    (15U)
#define USBHS_DOEPCTL1_USBACTEP                        (0x00008000UL)
#define USBHS_DOEPCTL1_DPID_POS                        (16U)
#define USBHS_DOEPCTL1_DPID                            (0x00010000UL)
#define USBHS_DOEPCTL1_NAKSTS_POS                      (17U)
#define USBHS_DOEPCTL1_NAKSTS                          (0x00020000UL)
#define USBHS_DOEPCTL1_EPTYPE_POS                      (18U)
#define USBHS_DOEPCTL1_EPTYPE                          (0x000C0000UL)
#define USBHS_DOEPCTL1_EPTYPE_0                        (0x00040000UL)
#define USBHS_DOEPCTL1_EPTYPE_1                        (0x00080000UL)
#define USBHS_DOEPCTL1_SNP_POS                         (20U)
#define USBHS_DOEPCTL1_SNP                             (0x00100000UL)
#define USBHS_DOEPCTL1_STALL_POS                       (21U)
#define USBHS_DOEPCTL1_STALL                           (0x00200000UL)
#define USBHS_DOEPCTL1_CNAK_POS                        (26U)
#define USBHS_DOEPCTL1_CNAK                            (0x04000000UL)
#define USBHS_DOEPCTL1_SNAK_POS                        (27U)
#define USBHS_DOEPCTL1_SNAK                            (0x08000000UL)
#define USBHS_DOEPCTL1_SETD0PID_POS                    (28U)
#define USBHS_DOEPCTL1_SETD0PID                        (0x10000000UL)
#define USBHS_DOEPCTL1_SETD1PID_POS                    (29U)
#define USBHS_DOEPCTL1_SETD1PID                        (0x20000000UL)
#define USBHS_DOEPCTL1_EPDIS_POS                       (30U)
#define USBHS_DOEPCTL1_EPDIS                           (0x40000000UL)
#define USBHS_DOEPCTL1_EPENA_POS                       (31U)
#define USBHS_DOEPCTL1_EPENA                           (0x80000000UL)

/*  Bit definition for USBHS_DOEPINT1 register  */
#define USBHS_DOEPINT1_XFERCOMPL_POS                   (0U)
#define USBHS_DOEPINT1_XFERCOMPL                       (0x00000001UL)
#define USBHS_DOEPINT1_EPDISBLD_POS                    (1U)
#define USBHS_DOEPINT1_EPDISBLD                        (0x00000002UL)
#define USBHS_DOEPINT1_AHBERR_POS                      (2U)
#define USBHS_DOEPINT1_AHBERR                          (0x00000004UL)
#define USBHS_DOEPINT1_SETUP_POS                       (3U)
#define USBHS_DOEPINT1_SETUP                           (0x00000008UL)
#define USBHS_DOEPINT1_OUTTKNEPDIS_POS                 (4U)
#define USBHS_DOEPINT1_OUTTKNEPDIS                     (0x00000010UL)
#define USBHS_DOEPINT1_STSPHSERCVD_POS                 (5U)
#define USBHS_DOEPINT1_STSPHSERCVD                     (0x00000020UL)
#define USBHS_DOEPINT1_BACK2BACKSETUP_POS              (6U)
#define USBHS_DOEPINT1_BACK2BACKSETUP                  (0x00000040UL)
#define USBHS_DOEPINT1_OUTPKTERR_POS                   (8U)
#define USBHS_DOEPINT1_OUTPKTERR                       (0x00000100UL)
#define USBHS_DOEPINT1_BNAINTR_POS                     (9U)
#define USBHS_DOEPINT1_BNAINTR                         (0x00000200UL)
#define USBHS_DOEPINT1_PKTDRPSTS_POS                   (11U)
#define USBHS_DOEPINT1_PKTDRPSTS                       (0x00000800UL)
#define USBHS_DOEPINT1_BBLEERR_POS                     (12U)
#define USBHS_DOEPINT1_BBLEERR                         (0x00001000UL)
#define USBHS_DOEPINT1_NAKINTRPT_POS                   (13U)
#define USBHS_DOEPINT1_NAKINTRPT                       (0x00002000UL)
#define USBHS_DOEPINT1_NYETINTRPT_POS                  (14U)
#define USBHS_DOEPINT1_NYETINTRPT                      (0x00004000UL)
#define USBHS_DOEPINT1_STUPPKTRCVD_POS                 (15U)
#define USBHS_DOEPINT1_STUPPKTRCVD                     (0x00008000UL)

/*  Bit definition for USBHS_DOEPTSIZ1 register  */
#define USBHS_DOEPTSIZ1_XFERSIZE_POS                   (0U)
#define USBHS_DOEPTSIZ1_XFERSIZE                       (0x0007FFFFUL)
#define USBHS_DOEPTSIZ1_XFERSIZE_0                     (0x00000001UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_1                     (0x00000002UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_2                     (0x00000004UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_3                     (0x00000008UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_4                     (0x00000010UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_5                     (0x00000020UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_6                     (0x00000040UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_7                     (0x00000080UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_8                     (0x00000100UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_9                     (0x00000200UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_10                    (0x00000400UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_11                    (0x00000800UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_12                    (0x00001000UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_13                    (0x00002000UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_14                    (0x00004000UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_15                    (0x00008000UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_16                    (0x00010000UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_17                    (0x00020000UL)
#define USBHS_DOEPTSIZ1_XFERSIZE_18                    (0x00040000UL)
#define USBHS_DOEPTSIZ1_PKTCNT_POS                     (19U)
#define USBHS_DOEPTSIZ1_PKTCNT                         (0x1FF80000UL)
#define USBHS_DOEPTSIZ1_PKTCNT_0                       (0x00080000UL)
#define USBHS_DOEPTSIZ1_PKTCNT_1                       (0x00100000UL)
#define USBHS_DOEPTSIZ1_PKTCNT_2                       (0x00200000UL)
#define USBHS_DOEPTSIZ1_PKTCNT_3                       (0x00400000UL)
#define USBHS_DOEPTSIZ1_PKTCNT_4                       (0x00800000UL)
#define USBHS_DOEPTSIZ1_PKTCNT_5                       (0x01000000UL)
#define USBHS_DOEPTSIZ1_PKTCNT_6                       (0x02000000UL)
#define USBHS_DOEPTSIZ1_PKTCNT_7                       (0x04000000UL)
#define USBHS_DOEPTSIZ1_PKTCNT_8                       (0x08000000UL)
#define USBHS_DOEPTSIZ1_PKTCNT_9                       (0x10000000UL)
#define USBHS_DOEPTSIZ1_RXDPID_POS                     (29U)
#define USBHS_DOEPTSIZ1_RXDPID                         (0x60000000UL)
#define USBHS_DOEPTSIZ1_RXDPID_0                       (0x20000000UL)
#define USBHS_DOEPTSIZ1_RXDPID_1                       (0x40000000UL)

/*  Bit definition for USBHS_DOEPDMA1 register  */
#define USBHS_DOEPDMA1                                 (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DOEPCTL2 register  */
#define USBHS_DOEPCTL2_MPS_POS                         (0U)
#define USBHS_DOEPCTL2_MPS                             (0x000007FFUL)
#define USBHS_DOEPCTL2_MPS_0                           (0x00000001UL)
#define USBHS_DOEPCTL2_MPS_1                           (0x00000002UL)
#define USBHS_DOEPCTL2_MPS_2                           (0x00000004UL)
#define USBHS_DOEPCTL2_MPS_3                           (0x00000008UL)
#define USBHS_DOEPCTL2_MPS_4                           (0x00000010UL)
#define USBHS_DOEPCTL2_MPS_5                           (0x00000020UL)
#define USBHS_DOEPCTL2_MPS_6                           (0x00000040UL)
#define USBHS_DOEPCTL2_MPS_7                           (0x00000080UL)
#define USBHS_DOEPCTL2_MPS_8                           (0x00000100UL)
#define USBHS_DOEPCTL2_MPS_9                           (0x00000200UL)
#define USBHS_DOEPCTL2_MPS_10                          (0x00000400UL)
#define USBHS_DOEPCTL2_USBACTEP_POS                    (15U)
#define USBHS_DOEPCTL2_USBACTEP                        (0x00008000UL)
#define USBHS_DOEPCTL2_DPID_POS                        (16U)
#define USBHS_DOEPCTL2_DPID                            (0x00010000UL)
#define USBHS_DOEPCTL2_NAKSTS_POS                      (17U)
#define USBHS_DOEPCTL2_NAKSTS                          (0x00020000UL)
#define USBHS_DOEPCTL2_EPTYPE_POS                      (18U)
#define USBHS_DOEPCTL2_EPTYPE                          (0x000C0000UL)
#define USBHS_DOEPCTL2_EPTYPE_0                        (0x00040000UL)
#define USBHS_DOEPCTL2_EPTYPE_1                        (0x00080000UL)
#define USBHS_DOEPCTL2_SNP_POS                         (20U)
#define USBHS_DOEPCTL2_SNP                             (0x00100000UL)
#define USBHS_DOEPCTL2_STALL_POS                       (21U)
#define USBHS_DOEPCTL2_STALL                           (0x00200000UL)
#define USBHS_DOEPCTL2_CNAK_POS                        (26U)
#define USBHS_DOEPCTL2_CNAK                            (0x04000000UL)
#define USBHS_DOEPCTL2_SNAK_POS                        (27U)
#define USBHS_DOEPCTL2_SNAK                            (0x08000000UL)
#define USBHS_DOEPCTL2_SETD0PID_POS                    (28U)
#define USBHS_DOEPCTL2_SETD0PID                        (0x10000000UL)
#define USBHS_DOEPCTL2_SETD1PID_POS                    (29U)
#define USBHS_DOEPCTL2_SETD1PID                        (0x20000000UL)
#define USBHS_DOEPCTL2_EPDIS_POS                       (30U)
#define USBHS_DOEPCTL2_EPDIS                           (0x40000000UL)
#define USBHS_DOEPCTL2_EPENA_POS                       (31U)
#define USBHS_DOEPCTL2_EPENA                           (0x80000000UL)

/*  Bit definition for USBHS_DOEPINT2 register  */
#define USBHS_DOEPINT2_XFERCOMPL_POS                   (0U)
#define USBHS_DOEPINT2_XFERCOMPL                       (0x00000001UL)
#define USBHS_DOEPINT2_EPDISBLD_POS                    (1U)
#define USBHS_DOEPINT2_EPDISBLD                        (0x00000002UL)
#define USBHS_DOEPINT2_AHBERR_POS                      (2U)
#define USBHS_DOEPINT2_AHBERR                          (0x00000004UL)
#define USBHS_DOEPINT2_SETUP_POS                       (3U)
#define USBHS_DOEPINT2_SETUP                           (0x00000008UL)
#define USBHS_DOEPINT2_OUTTKNEPDIS_POS                 (4U)
#define USBHS_DOEPINT2_OUTTKNEPDIS                     (0x00000010UL)
#define USBHS_DOEPINT2_STSPHSERCVD_POS                 (5U)
#define USBHS_DOEPINT2_STSPHSERCVD                     (0x00000020UL)
#define USBHS_DOEPINT2_BACK2BACKSETUP_POS              (6U)
#define USBHS_DOEPINT2_BACK2BACKSETUP                  (0x00000040UL)
#define USBHS_DOEPINT2_OUTPKTERR_POS                   (8U)
#define USBHS_DOEPINT2_OUTPKTERR                       (0x00000100UL)
#define USBHS_DOEPINT2_BNAINTR_POS                     (9U)
#define USBHS_DOEPINT2_BNAINTR                         (0x00000200UL)
#define USBHS_DOEPINT2_PKTDRPSTS_POS                   (11U)
#define USBHS_DOEPINT2_PKTDRPSTS                       (0x00000800UL)
#define USBHS_DOEPINT2_BBLEERR_POS                     (12U)
#define USBHS_DOEPINT2_BBLEERR                         (0x00001000UL)
#define USBHS_DOEPINT2_NAKINTRPT_POS                   (13U)
#define USBHS_DOEPINT2_NAKINTRPT                       (0x00002000UL)
#define USBHS_DOEPINT2_NYETINTRPT_POS                  (14U)
#define USBHS_DOEPINT2_NYETINTRPT                      (0x00004000UL)
#define USBHS_DOEPINT2_STUPPKTRCVD_POS                 (15U)
#define USBHS_DOEPINT2_STUPPKTRCVD                     (0x00008000UL)

/*  Bit definition for USBHS_DOEPTSIZ2 register  */
#define USBHS_DOEPTSIZ2_XFERSIZE_POS                   (0U)
#define USBHS_DOEPTSIZ2_XFERSIZE                       (0x0007FFFFUL)
#define USBHS_DOEPTSIZ2_XFERSIZE_0                     (0x00000001UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_1                     (0x00000002UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_2                     (0x00000004UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_3                     (0x00000008UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_4                     (0x00000010UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_5                     (0x00000020UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_6                     (0x00000040UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_7                     (0x00000080UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_8                     (0x00000100UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_9                     (0x00000200UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_10                    (0x00000400UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_11                    (0x00000800UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_12                    (0x00001000UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_13                    (0x00002000UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_14                    (0x00004000UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_15                    (0x00008000UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_16                    (0x00010000UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_17                    (0x00020000UL)
#define USBHS_DOEPTSIZ2_XFERSIZE_18                    (0x00040000UL)
#define USBHS_DOEPTSIZ2_PKTCNT_POS                     (19U)
#define USBHS_DOEPTSIZ2_PKTCNT                         (0x1FF80000UL)
#define USBHS_DOEPTSIZ2_PKTCNT_0                       (0x00080000UL)
#define USBHS_DOEPTSIZ2_PKTCNT_1                       (0x00100000UL)
#define USBHS_DOEPTSIZ2_PKTCNT_2                       (0x00200000UL)
#define USBHS_DOEPTSIZ2_PKTCNT_3                       (0x00400000UL)
#define USBHS_DOEPTSIZ2_PKTCNT_4                       (0x00800000UL)
#define USBHS_DOEPTSIZ2_PKTCNT_5                       (0x01000000UL)
#define USBHS_DOEPTSIZ2_PKTCNT_6                       (0x02000000UL)
#define USBHS_DOEPTSIZ2_PKTCNT_7                       (0x04000000UL)
#define USBHS_DOEPTSIZ2_PKTCNT_8                       (0x08000000UL)
#define USBHS_DOEPTSIZ2_PKTCNT_9                       (0x10000000UL)
#define USBHS_DOEPTSIZ2_RXDPID_POS                     (29U)
#define USBHS_DOEPTSIZ2_RXDPID                         (0x60000000UL)
#define USBHS_DOEPTSIZ2_RXDPID_0                       (0x20000000UL)
#define USBHS_DOEPTSIZ2_RXDPID_1                       (0x40000000UL)

/*  Bit definition for USBHS_DOEPDMA2 register  */
#define USBHS_DOEPDMA2                                 (0xFFFFFFFFUL)

