levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DOEPINT10 register  */
#define USBHS_DOEPINT10_XFERCOMPL_POS                  (0U)
#define USBHS_DOEPINT10_XFERCOMPL                      (0x00000001UL)
#define USBHS_DOEPINT10_EPDISBLD_POS                   (1U)
#define USBHS_DOEPINT10_EPDISBLD                       (0x00000002UL)
#define USBHS_DOEPINT10_AHBERR_POS                     (2U)
#define USBHS_DOEPINT10_AHBERR                         (0x00000004UL)
#define USBHS_DOEPINT10_SETUP_POS                      (3U)
#define USBHS_DOEPINT10_SETUP                          (0x00000008UL)
#define USBHS_DOEPINT10_OUTTKNEPDIS_POS                (4U)
#define USBHS_DOEPINT10_OUTTKNEPDIS                    (0x00000010UL)
#define USBHS_DOEPINT10_STSPHSERCVD_POS                (5U)
#define USBHS_DOEPINT10_STSPHSERCVD                    (0x00000020UL)
#define USBHS_DOEPINT10_BACK2BACKSETUP_POS             (6U)
#define USBHS_DOEPINT10_BACK2BACKSETUP                 (0x00000040UL)
#define USBHS_DOEPINT10_OUTPKTERR_POS                  (8U)
#define USBHS_DOEPINT10_OUTPKTERR                      (0x00000100UL)
#define USBHS_DOEPINT10_BNAINTR_POS                    (9U)
#define USBHS_DOEPINT10_BNAINTR                        (0x00000200UL)
#define USBHS_DOEPINT10_PKTDRPSTS_POS                  (11U)
#define USBHS_DOEPINT10_PKTDRPSTS                      (0x00000800UL)
#define USBHS_DOEPINT10_BBLEERR_POS                    (12U)
#define USBHS_DOEPINT10_BBLEERR                        (0x00001000UL)
#define USBHS_DOEPINT10_NAKINTRPT_POS                  (13U)
#define USBHS_DOEPINT10_NAKINTRPT                      (0x00002000UL)
#define USBHS_DOEPINT10_NYETINTRPT_POS                 (14U)
#define USBHS_DOEPINT10_NYETINTRPT                     (0x00004000UL)
#define USBHS_DOEPINT10_STUPPKTRCVD_POS                (15U)
#define USBHS_DOEPINT10_STUPPKTRCVD                    (0x00008000UL)

/*  Bit definition for USBHS_DOEPTSIZ10 register  */
#define USBHS_DOEPTSIZ10_XFERSIZE_POS                  (0U)
#define USBHS_DOEPTSIZ10_XFERSIZE                      (0x0007FFFFUL)
#define USBHS_DOEPTSIZ10_XFERSIZE_0                    (0x00000001UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_1                    (0x00000002UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_2                    (0x00000004UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_3                    (0x00000008UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_4                    (0x00000010UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_5                    (0x00000020UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_6                    (0x00000040UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_7                    (0x00000080UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_8                    (0x00000100UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_9                    (0x00000200UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_10                   (0x00000400UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_11                   (0x00000800UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_12                   (0x00001000UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_13                   (0x00002000UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_14                   (0x00004000UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_15                   (0x00008000UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_16                   (0x00010000UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_17                   (0x00020000UL)
#define USBHS_DOEPTSIZ10_XFERSIZE_18                   (0x00040000UL)
#define USBHS_DOEPTSIZ10_PKTCNT_POS                    (19U)
#define USBHS_DOEPTSIZ10_PKTCNT                        (0x1FF80000UL)
#define USBHS_DOEPTSIZ10_PKTCNT_0                      (0x00080000UL)
#define USBHS_DOEPTSIZ10_PKTCNT_1                      (0x00100000UL)
#define USBHS_DOEPTSIZ10_PKTCNT_2                      (0x00200000UL)
#define USBHS_DOEPTSIZ10_PKTCNT_3                      (0x00400000UL)
#define USBHS_DOEPTSIZ10_PKTCNT_4                      (0x00800000UL)
#define USBHS_DOEPTSIZ10_PKTCNT_5                      (0x01000000UL)
#define USBHS_DOEPTSIZ10_PKTCNT_6                      (0x02000000UL)
#define USBHS_DOEPTSIZ10_PKTCNT_7                      (0x04000000UL)
#define USBHS_DOEPTSIZ10_PKTCNT_8                      (0x08000000UL)
#define USBHS_DOEPTSIZ10_PKTCNT_9                      (0x10000000UL)
#define USBHS_DOEPTSIZ10_RXDPID_POS                    (29U)
#define USBHS_DOEPTSIZ10_RXDPID                        (0x60000000UL)
#define USBHS_DOEPTSIZ10_RXDPID_0                      (0x20000000UL)
#define USBHS_DOEPTSIZ10_RXDPID_1                      (0x40000000UL)

/*  Bit definition for USBHS_DOEPDMA10 register  */
#define USBHS_DOEPDMA10                                (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DOEPCTL11 register  */
#define USBHS_DOEPCTL11_MPS_POS                        (0U)
#define USBHS_DOEPCTL11_MPS                            (0x000007FFUL)
#define USBHS_DOEPCTL11_MPS_0                          (0x00000001UL)
#define USBHS_DOEPCTL11_MPS_1                          (0x00000002UL)
#define USBHS_DOEPCTL11_MPS_2                          (0x00000004UL)
#define USBHS_DOEPCTL11_MPS_3                          (0x00000008UL)
#define USBHS_DOEPCTL11_MPS_4                          (0x00000010UL)
#define USBHS_DOEPCTL11_MPS_5                          (0x00000020UL)
#define USBHS_DOEPCTL11_MPS_6                          (0x00000040UL)
#define USBHS_DOEPCTL11_MPS_7                          (0x00000080UL)
#define USBHS_DOEPCTL11_MPS_8                          (0x00000100UL)
#define USBHS_DOEPCTL11_MPS_9                          (0x00000200UL)
#define USBHS_DOEPCTL11_MPS_10                         (0x00000400UL)
#define USBHS_DOEPCTL11_USBACTEP_POS                   (15U)
#define USBHS_DOEPCTL11_USBACTEP                       (0x00008000UL)
#define USBHS_DOEPCTL11_DPID_POS                       (16U)
#define USBHS_DOEPCTL11_DPID                           (0x00010000UL)
#define USBHS_DOEPCTL11_NAKSTS_POS                     (17U)
#define USBHS_DOEPCTL11_NAKSTS                         (0x00020000UL)
#define USBHS_DOEPCTL11_EPTYPE_POS                     (18U)
#define USBHS_DOEPCTL11_EPTYPE                         (0x000C0000UL)
#define USBHS_DOEPCTL11_EPTYPE_0                       (0x00040000UL)
#define USBHS_DOEPCTL11_EPTYPE_1                       (0x00080000UL)
#define USBHS_DOEPCTL11_SNP_POS                        (20U)
#define USBHS_DOEPCTL11_SNP                            (0x00100000UL)
#define USBHS_DOEPCTL11_STALL_POS                      (21U)
#define USBHS_DOEPCTL11_STALL                          (0x00200000UL)
#define USBHS_DOEPCTL11_CNAK_POS                       (26U)
#define USBHS_DOEPCTL11_CNAK                           (0x04000000UL)
#define USBHS_DOEPCTL11_SNAK_POS                       (27U)
#define USBHS_DOEPCTL11_SNAK                           (0x08000000UL)
#define USBHS_DOEPCTL11_SETD0PID_POS                   (28U)
#define USBHS_DOEPCTL11_SETD0PID                       (0x10000000UL)
#define USBHS_DOEPCTL11_SETD1PID_POS                   (29U)
#define USBHS_DOEPCTL11_SETD1PID                       (0x20000000UL)
#define USBHS_DOEPCTL11_EPDIS_POS                      (30U)
#define USBHS_DOEPCTL11_EPDIS                          (0x40000000UL)
#define USBHS_DOEPCTL11_EPENA_POS                      (31U)
#define USBHS_DOEPCTL11_EPENA                          (0x80000000UL)

/*  Bit definition for USBHS_DOEPINT11 register  */
#define USBHS_DOEPINT11_XFERCOMPL_POS                  (0U)
#define USBHS_DOEPINT11_XFERCOMPL                      (0x00000001UL)
#define USBHS_DOEPINT11_EPDISBLD_POS                   (1U)
#define USBHS_DOEPINT11_EPDISBLD                       (0x00000002UL)
#define USBHS_DOEPINT11_AHBERR_POS                     (2U)
#define USBHS_DOEPINT11_AHBERR                         (0x00000004UL)
#define USBHS_DOEPINT11_SETUP_POS                      (3U)
#define USBHS_DOEPINT11_SETUP                          (0x00000008UL)
#define USBHS_DOEPINT11_OUTTKNEPDIS_POS                (4U)
#define USBHS_DOEPINT11_OUTTKNEPDIS                    (0x00000010UL)
#define USBHS_DOEPINT11_STSPHSERCVD_POS                (5U)
#define USBHS_DOEPINT11_STSPHSERCVD                    (0x00000020UL)
#define USBHS_DOEPINT11_BACK2BACKSETUP_POS             (6U)
#define USBHS_DOEPINT11_BACK2BACKSETUP                 (0x00000040UL)
#define USBHS_DOEPINT11_OUTPKTERR_POS                  (8U)
#define USBHS_DOEPINT11_OUTPKTERR                      (0x00000100UL)
#define USBHS_DOEPINT11_BNAINTR_POS                    (9U)
#define USBHS_DOEPINT11_BNAINTR                        (0x00000200UL)
#define USBHS_DOEPINT11_PKTDRPSTS_POS                  (11U)
#define USBHS_DOEPINT11_PKTDRPSTS                      (0x00000800UL)
#define USBHS_DOEPINT11_BBLEERR_POS                    (12U)
#define USBHS_DOEPINT11_BBLEERR                        (0x00001000UL)
#define USBHS_DOEPINT11_NAKINTRPT_POS                  (13U)
#define USBHS_DOEPINT11_NAKINTRPT                      (0x00002000UL)
#define USBHS_DOEPINT11_NYETINTRPT_POS                 (14U)
#define USBHS_DOEPINT11_NYETINTRPT                     (0x00004000UL)
#define USBHS_DOEPINT11_STUPPKTRCVD_POS                (15U)
#define USBHS_DOEPINT11_STUPPKTRCVD                    (0x00008000UL)

/*  Bit definition for USBHS_DOEPTSIZ11 register  */
#define USBHS_DOEPTSIZ11_XFERSIZE_POS                  (0U)
#define USBHS_DOEPTSIZ11_XFERSIZE                      (0x0007FFFFUL)
#define USBHS_DOEPTSIZ11_XFERSIZE_0                    (0x00000001UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_1                    (0x00000002UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_2                    (0x00000004UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_3                    (0x00000008UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_4                    (0x00000010UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_5                    (0x00000020UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_6                    (0x00000040UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_7                    (0x00000080UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_8                    (0x00000100UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_9                    (0x00000200UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_10                   (0x00000400UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_11                   (0x00000800UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_12                   (0x00001000UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_13                   (0x00002000UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_14                   (0x00004000UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_15                   (0x00008000UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_16                   (0x00010000UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_17                   (0x00020000UL)
#define USBHS_DOEPTSIZ11_XFERSIZE_18                   (0x00040000UL)
#define USBHS_DOEPTSIZ11_PKTCNT_POS                    (19U)
#define USBHS_DOEPTSIZ11_PKTCNT                        (0x1FF80000UL)
#define USBHS_DOEPTSIZ11_PKTCNT_0                      (0x00080000UL)
#define USBHS_DOEPTSIZ11_PKTCNT_1                      (0x00100000UL)
#define USBHS_DOEPTSIZ11_PKTCNT_2                      (0x00200000UL)
#define USBHS_DOEPTSIZ11_PKTCNT_3                      (0x00400000UL)
#define USBHS_DOEPTSIZ11_PKTCNT_4                      (0x00800000UL)
#define USBHS_DOEPTSIZ11_PKTCNT_5                      (0x01000000UL)
#define USBHS_DOEPTSIZ11_PKTCNT_6                      (0x02000000UL)
#define USBHS_DOEPTSIZ11_PKTCNT_7                      (0x04000000UL)
#define USBHS_DOEPTSIZ11_PKTCNT_8                      (0x08000000UL)
#define USBHS_DOEPTSIZ11_PKTCNT_9                      (0x10000000UL)
#define USBHS_DOEPTSIZ11_RXDPID_POS                    (29U)
#define USBHS_DOEPTSIZ11_RXDPID                        (0x60000000UL)
#define USBHS_DOEPTSIZ11_RXDPID_0                      (0x20000000UL)
#define USBHS_DOEPTSIZ11_RXDPID_1                      (0x40000000UL)

/*  Bit definition for USBHS_DOEPDMA11 register  */
#define USBHS_DOEPDMA11                                (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DOEPCTL12 register  */
#define USBHS_DOEPCTL12_MPS_POS                        (0U)
#define USBHS_DOEPCTL12_MPS                            (0x000007FFUL)
#define USBHS_DOEPCTL12_MPS_0                          (0x00000001UL)
#define USBHS_DOEPCTL12_MPS_1                          (0x00000002UL)
#define USBHS_DOEPCTL12_MPS_2                          (0x00000004UL)
#define USBHS_DOEPCTL12_MPS_3                          (0x00000008UL)
#define USBHS_DOEPCTL12_MPS_4                          (0x00000010UL)
#define USBHS_DOEPCTL12_MPS_5                          (0x00000020UL)
#define USBHS_DOEPCTL12_MPS_6                          (0x00000040UL)
#define USBHS_DOEPCTL12_MPS_7                          (0x00000080UL)
#define USBHS_DOEPCTL12_MPS_8                          (0x00000100UL)
#define USBHS_DOEPCTL12_MPS_9                          (0x00000200UL)
#define USBHS_DOEPCTL12_MPS_10                         (0x00000400UL)
#define USBHS_DOEPCTL12_USBACTEP_POS                   (15U)
#define USBHS_DOEPCTL12_USBACTEP                       (0x00008000UL)
#define USBHS_DOEPCTL12_DPID_POS                       (16U)
#define USBHS_DOEPCTL12_DPID                           (0x00010000UL)
#define USBHS_DOEPCTL12_NAKSTS_POS                     (17U)
#define USBHS_DOEPCTL12_NAKSTS                         (0x00020000UL)
#define USBHS_DOEPCTL12_EPTYPE_POS                     (18U)
#define USBHS_DOEPCTL12_EPTYPE                         (0x000C0000UL)
#define USBHS_DOEPCTL12_EPTYPE_0                       (0x00040000UL)
#define USBHS_DOEPCTL12_EPTYPE_1                       (0x00080000UL)
#define USBHS_DOEPCTL12_SNP_POS                        (20U)
#define USBHS_DOEPCTL12_SNP                            (0x00100000UL)
#define USBHS_DOEPCTL12_STALL_POS                      (21U)
#define USBHS_DOEPCTL12_STALL                          (0x00200000UL)
#define USBHS_DOEPCTL12_CNAK_POS                       (26U)
#define USBHS_DOEPCTL12_CNAK                           (0x04000000UL)
#define USBHS_DOEPCTL12_SNAK_POS                       (27U)
#define USBHS_DOEPCTL12_SNAK                           (0x08000000UL)
#define USBHS_DOEPCTL12_SETD0PID_POS                   (28U)
#define USBHS_DOEPCTL12_SETD0PID                       (0x10000000UL)
#define USBHS_DOEPCTL12_SETD1PID_POS                   (29U)
#define USBHS_DOEPCTL12_SETD1PID                       (0x20000000UL)
#define USBHS_DOEPCTL12_EPDIS_POS                      (30U)
#define USBHS_DOEPCTL12_EPDIS                          (0x40000000UL)
#define USBHS_DOEPCTL12_EPENA_POS                      (31U)
#define USBHS_DOEPCTL12_EPENA                          (0x80000000UL)

/*  Bit definition for USBHS_DOEPINT12 register  */
#define USBHS_DOEPINT12_XFERCOMPL_POS                  (0U)
#define USBHS_DOEPINT12_XFERCOMPL                      (0x00000001UL)
#define USBHS_DOEPINT12_EPDISBLD_POS                   (1U)
#define USBHS_DOEPINT12_EPDISBLD                       (0x00000002UL)
#define USBHS_DOEPINT12_AHBERR_POS                     (2U)
#define USBHS_DOEPINT12_AHBERR                         (0x00000004UL)
#define USBHS_DOEPINT12_SETUP_POS                      (3U)
#define USBHS_DOEPINT12_SETUP                          (0x00000008UL)
#define USBHS_DOEPINT12_OUTTKNEPDIS_POS                (4U)
#define USBHS_DOEPINT12_OUTTKNEPDIS                    (0x00000010UL)
#define USBHS_DOEPINT12_STSPHSERCVD_POS                (5U)
#define USBHS_DOEPINT12_STSPHSERCVD                    (0x00000020UL)
#define USBHS_DOEPINT12_BACK2BACKSETUP_POS             (6U)
#define USBHS_DOEPINT12_BACK2BACKSETUP                 (0x00000040UL)
#define USBHS_DOEPINT12_OUTPKTERR_POS                  (8U)
#define USBHS_DOEPINT12_OUTPKTERR                      (0x00000100UL)
#define USBHS_DOEPINT12_BNAINTR_POS                    (9U)
#define USBHS_DOEPINT12_BNAINTR                        (0x00000200UL)
#define USBHS_DOEPINT12_PKTDRPSTS_POS                  (11U)
#define USBHS_DOEPINT12_PKTDRPSTS                      (0x00000800UL)
#define USBHS_DOEPINT12_BBLEERR_POS                    (12U)
#define USBHS_DOEPINT12_BBLEERR                        (0x00001000UL)
#define USBHS_DOEPINT12_NAKINTRPT_POS                  (13U)
#define USBHS_DOEPINT12_NAKINTRPT                      (0x00002000UL)
#define USBHS_DOEPINT12_NYETINTRPT_POS                 (14U)
#define USBHS_DOEPINT12_NYETINTRPT                     (0x00004000UL)
#define USBHS_DOEPINT12_STUPPKTRCVD_POS                (15U)
#define USBHS_DOEPINT12_STUPPKTRCVD                    (0x00008000UL)

