levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*  Bit definition for USBHS_DOEPTSIZ12 register  */
#define USBHS_DOEPTSIZ12_XFERSIZE_POS                  (0U)
#define USBHS_DOEPTSIZ12_XFERSIZE                      (0x0007FFFFUL)
#define USBHS_DOEPTSIZ12_XFERSIZE_0                    (0x00000001UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_1                    (0x00000002UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_2                    (0x00000004UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_3                    (0x00000008UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_4                    (0x00000010UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_5                    (0x00000020UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_6                    (0x00000040UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_7                    (0x00000080UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_8                    (0x00000100UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_9                    (0x00000200UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_10                   (0x00000400UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_11                   (0x00000800UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_12                   (0x00001000UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_13                   (0x00002000UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_14                   (0x00004000UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_15                   (0x00008000UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_16                   (0x00010000UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_17                   (0x00020000UL)
#define USBHS_DOEPTSIZ12_XFERSIZE_18                   (0x00040000UL)
#define USBHS_DOEPTSIZ12_PKTCNT_POS                    (19U)
#define USBHS_DOEPTSIZ12_PKTCNT                        (0x1FF80000UL)
#define USBHS_DOEPTSIZ12_PKTCNT_0                      (0x00080000UL)
#define USBHS_DOEPTSIZ12_PKTCNT_1                      (0x00100000UL)
#define USBHS_DOEPTSIZ12_PKTCNT_2                      (0x00200000UL)
#define USBHS_DOEPTSIZ12_PKTCNT_3                      (0x00400000UL)
#define USBHS_DOEPTSIZ12_PKTCNT_4                      (0x00800000UL)
#define USBHS_DOEPTSIZ12_PKTCNT_5                      (0x01000000UL)
#define USBHS_DOEPTSIZ12_PKTCNT_6                      (0x02000000UL)
#define USBHS_DOEPTSIZ12_PKTCNT_7                      (0x04000000UL)
#define USBHS_DOEPTSIZ12_PKTCNT_8                      (0x08000000UL)
#define USBHS_DOEPTSIZ12_PKTCNT_9                      (0x10000000UL)
#define USBHS_DOEPTSIZ12_RXDPID_POS                    (29U)
#define USBHS_DOEPTSIZ12_RXDPID                        (0x60000000UL)
#define USBHS_DOEPTSIZ12_RXDPID_0                      (0x20000000UL)
#define USBHS_DOEPTSIZ12_RXDPID_1                      (0x40000000UL)

/*  Bit definition for USBHS_DOEPDMA12 register  */
#define USBHS_DOEPDMA12                                (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DOEPCTL13 register  */
#define USBHS_DOEPCTL13_MPS_POS                        (0U)
#define USBHS_DOEPCTL13_MPS                            (0x000007FFUL)
#define USBHS_DOEPCTL13_MPS_0                          (0x00000001UL)
#define USBHS_DOEPCTL13_MPS_1                          (0x00000002UL)
#define USBHS_DOEPCTL13_MPS_2                          (0x00000004UL)
#define USBHS_DOEPCTL13_MPS_3                          (0x00000008UL)
#define USBHS_DOEPCTL13_MPS_4                          (0x00000010UL)
#define USBHS_DOEPCTL13_MPS_5                          (0x00000020UL)
#define USBHS_DOEPCTL13_MPS_6                          (0x00000040UL)
#define USBHS_DOEPCTL13_MPS_7                          (0x00000080UL)
#define USBHS_DOEPCTL13_MPS_8                          (0x00000100UL)
#define USBHS_DOEPCTL13_MPS_9                          (0x00000200UL)
#define USBHS_DOEPCTL13_MPS_10                         (0x00000400UL)
#define USBHS_DOEPCTL13_USBACTEP_POS                   (15U)
#define USBHS_DOEPCTL13_USBACTEP                       (0x00008000UL)
#define USBHS_DOEPCTL13_DPID_POS                       (16U)
#define USBHS_DOEPCTL13_DPID                           (0x00010000UL)
#define USBHS_DOEPCTL13_NAKSTS_POS                     (17U)
#define USBHS_DOEPCTL13_NAKSTS                         (0x00020000UL)
#define USBHS_DOEPCTL13_EPTYPE_POS                     (18U)
#define USBHS_DOEPCTL13_EPTYPE                         (0x000C0000UL)
#define USBHS_DOEPCTL13_EPTYPE_0                       (0x00040000UL)
#define USBHS_DOEPCTL13_EPTYPE_1                       (0x00080000UL)
#define USBHS_DOEPCTL13_SNP_POS                        (20U)
#define USBHS_DOEPCTL13_SNP                            (0x00100000UL)
#define USBHS_DOEPCTL13_STALL_POS                      (21U)
#define USBHS_DOEPCTL13_STALL                          (0x00200000UL)
#define USBHS_DOEPCTL13_CNAK_POS                       (26U)
#define USBHS_DOEPCTL13_CNAK                           (0x04000000UL)
#define USBHS_DOEPCTL13_SNAK_POS                       (27U)
#define USBHS_DOEPCTL13_SNAK                           (0x08000000UL)
#define USBHS_DOEPCTL13_SETD0PID_POS                   (28U)
#define USBHS_DOEPCTL13_SETD0PID                       (0x10000000UL)
#define USBHS_DOEPCTL13_SETD1PID_POS                   (29U)
#define USBHS_DOEPCTL13_SETD1PID                       (0x20000000UL)
#define USBHS_DOEPCTL13_EPDIS_POS                      (30U)
#define USBHS_DOEPCTL13_EPDIS                          (0x40000000UL)
#define USBHS_DOEPCTL13_EPENA_POS                      (31U)
#define USBHS_DOEPCTL13_EPENA                          (0x80000000UL)

/*  Bit definition for USBHS_DOEPINT13 register  */
#define USBHS_DOEPINT13_XFERCOMPL_POS                  (0U)
#define USBHS_DOEPINT13_XFERCOMPL                      (0x00000001UL)
#define USBHS_DOEPINT13_EPDISBLD_POS                   (1U)
#define USBHS_DOEPINT13_EPDISBLD                       (0x00000002UL)
#define USBHS_DOEPINT13_AHBERR_POS                     (2U)
#define USBHS_DOEPINT13_AHBERR                         (0x00000004UL)
#define USBHS_DOEPINT13_SETUP_POS                      (3U)
#define USBHS_DOEPINT13_SETUP                          (0x00000008UL)
#define USBHS_DOEPINT13_OUTTKNEPDIS_POS                (4U)
#define USBHS_DOEPINT13_OUTTKNEPDIS                    (0x00000010UL)
#define USBHS_DOEPINT13_STSPHSERCVD_POS                (5U)
#define USBHS_DOEPINT13_STSPHSERCVD                    (0x00000020UL)
#define USBHS_DOEPINT13_BACK2BACKSETUP_POS             (6U)
#define USBHS_DOEPINT13_BACK2BACKSETUP                 (0x00000040UL)
#define USBHS_DOEPINT13_OUTPKTERR_POS                  (8U)
#define USBHS_DOEPINT13_OUTPKTERR                      (0x00000100UL)
#define USBHS_DOEPINT13_BNAINTR_POS                    (9U)
#define USBHS_DOEPINT13_BNAINTR                        (0x00000200UL)
#define USBHS_DOEPINT13_PKTDRPSTS_POS                  (11U)
#define USBHS_DOEPINT13_PKTDRPSTS                      (0x00000800UL)
#define USBHS_DOEPINT13_BBLEERR_POS                    (12U)
#define USBHS_DOEPINT13_BBLEERR                        (0x00001000UL)
#define USBHS_DOEPINT13_NAKINTRPT_POS                  (13U)
#define USBHS_DOEPINT13_NAKINTRPT                      (0x00002000UL)
#define USBHS_DOEPINT13_NYETINTRPT_POS                 (14U)
#define USBHS_DOEPINT13_NYETINTRPT                     (0x00004000UL)
#define USBHS_DOEPINT13_STUPPKTRCVD_POS                (15U)
#define USBHS_DOEPINT13_STUPPKTRCVD                    (0x00008000UL)

/*  Bit definition for USBHS_DOEPTSIZ13 register  */
#define USBHS_DOEPTSIZ13_XFERSIZE_POS                  (0U)
#define USBHS_DOEPTSIZ13_XFERSIZE                      (0x0007FFFFUL)
#define USBHS_DOEPTSIZ13_XFERSIZE_0                    (0x00000001UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_1                    (0x00000002UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_2                    (0x00000004UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_3                    (0x00000008UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_4                    (0x00000010UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_5                    (0x00000020UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_6                    (0x00000040UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_7                    (0x00000080UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_8                    (0x00000100UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_9                    (0x00000200UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_10                   (0x00000400UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_11                   (0x00000800UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_12                   (0x00001000UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_13                   (0x00002000UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_14                   (0x00004000UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_15                   (0x00008000UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_16                   (0x00010000UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_17                   (0x00020000UL)
#define USBHS_DOEPTSIZ13_XFERSIZE_18                   (0x00040000UL)
#define USBHS_DOEPTSIZ13_PKTCNT_POS                    (19U)
#define USBHS_DOEPTSIZ13_PKTCNT                        (0x1FF80000UL)
#define USBHS_DOEPTSIZ13_PKTCNT_0                      (0x00080000UL)
#define USBHS_DOEPTSIZ13_PKTCNT_1                      (0x00100000UL)
#define USBHS_DOEPTSIZ13_PKTCNT_2                      (0x00200000UL)
#define USBHS_DOEPTSIZ13_PKTCNT_3                      (0x00400000UL)
#define USBHS_DOEPTSIZ13_PKTCNT_4                      (0x00800000UL)
#define USBHS_DOEPTSIZ13_PKTCNT_5                      (0x01000000UL)
#define USBHS_DOEPTSIZ13_PKTCNT_6                      (0x02000000UL)
#define USBHS_DOEPTSIZ13_PKTCNT_7                      (0x04000000UL)
#define USBHS_DOEPTSIZ13_PKTCNT_8                      (0x08000000UL)
#define USBHS_DOEPTSIZ13_PKTCNT_9                      (0x10000000UL)
#define USBHS_DOEPTSIZ13_RXDPID_POS                    (29U)
#define USBHS_DOEPTSIZ13_RXDPID                        (0x60000000UL)
#define USBHS_DOEPTSIZ13_RXDPID_0                      (0x20000000UL)
#define USBHS_DOEPTSIZ13_RXDPID_1                      (0x40000000UL)

