levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
/*******************************************************************************
                Bit definition for Peripheral WDT
*******************************************************************************/
/*  Bit definition for WDT_CR register  */
#define WDT_CR_PERI_POS                                (0U)
#define WDT_CR_PERI                                    (0x00000003UL)
#define WDT_CR_PERI_0                                  (0x00000001UL)
#define WDT_CR_PERI_1                                  (0x00000002UL)
#define WDT_CR_CKS_POS                                 (4U)
#define WDT_CR_CKS                                     (0x000000F0UL)
#define WDT_CR_CKS_0                                   (0x00000010UL)
#define WDT_CR_CKS_1                                   (0x00000020UL)
#define WDT_CR_CKS_2                                   (0x00000040UL)
#define WDT_CR_CKS_3                                   (0x00000080UL)
#define WDT_CR_WDPT_POS                                (8U)
#define WDT_CR_WDPT                                    (0x00000F00UL)
#define WDT_CR_WDPT_0                                  (0x00000100UL)
#define WDT_CR_WDPT_1                                  (0x00000200UL)
#define WDT_CR_WDPT_2                                  (0x00000400UL)
#define WDT_CR_WDPT_3                                  (0x00000800UL)
#define WDT_CR_SLPOFF_POS                              (16U)
#define WDT_CR_SLPOFF                                  (0x00010000UL)
#define WDT_CR_ITS_POS                                 (31U)
#define WDT_CR_ITS                                     (0x80000000UL)

/*  Bit definition for WDT_SR register  */
#define WDT_SR_CNT_POS                                 (0U)
#define WDT_SR_CNT                                     (0x0000FFFFUL)
#define WDT_SR_UDF_POS                                 (16U)
#define WDT_SR_UDF                                     (0x00010000UL)
#define WDT_SR_REF_POS                                 (17U)
#define WDT_SR_REF                                     (0x00020000UL)

/*  Bit definition for WDT_RR register  */
#define WDT_RR_RF                                      (0x0000FFFFUL)


/******************************************************************************/
/*             Device Specific Registers bit_band structure                   */
/******************************************************************************/

typedef struct
{
    __IO uint32_t STRT;
    uint32_t RESERVED0[7];
} stc_adc_str_bit_t;

typedef struct
{
    __IO uint32_t MS0;
    __IO uint32_t MS1;
    uint32_t RESERVED0[2];
    __IO uint32_t ACCSEL0;
    __IO uint32_t ACCSEL1;
    __IO uint32_t CLREN;
    __IO uint32_t DFMT;
    __IO uint32_t AVCNT0;
    __IO uint32_t AVCNT1;
    __IO uint32_t AVCNT2;
    uint32_t RESERVED1[5];
} stc_adc_cr0_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t RSCHSEL;
    uint32_t RESERVED1[13];
} stc_adc_cr1_bit_t;

typedef struct
{
    __IO uint32_t TRGSELA0;
    __IO uint32_t TRGSELA1;
    uint32_t RESERVED0[5];
    __IO uint32_t TRGENA;
    __IO uint32_t TRGSELB0;
    __IO uint32_t TRGSELB1;
    uint32_t RESERVED1[5];
    __IO uint32_t TRGENB;
} stc_adc_trgsr_bit_t;

typedef struct
{
    __IO uint32_t CHSELA0;
    __IO uint32_t CHSELA1;
    __IO uint32_t CHSELA2;
    __IO uint32_t CHSELA3;
    __IO uint32_t CHSELA4;
    __IO uint32_t CHSELA5;
    __IO uint32_t CHSELA6;
    __IO uint32_t CHSELA7;
    __IO uint32_t CHSELA8;
    __IO uint32_t CHSELA9;
    __IO uint32_t CHSELA10;
    __IO uint32_t CHSELA11;
    __IO uint32_t CHSELA12;
    __IO uint32_t CHSELA13;
    __IO uint32_t CHSELA14;
    __IO uint32_t CHSELA15;
    __IO uint32_t CHSELA16;
    __IO uint32_t CHSELA17;
    __IO uint32_t CHSELA18;
    __IO uint32_t CHSELA19;
    uint32_t RESERVED0[12];
} stc_adc_chselra_bit_t;

typedef struct
{
    __IO uint32_t CHSELB0;
    __IO uint32_t CHSELB1;
    __IO uint32_t CHSELB2;
    __IO uint32_t CHSELB3;
    __IO uint32_t CHSELB4;
    __IO uint32_t CHSELB5;
    __IO uint32_t CHSELB6;
    __IO uint32_t CHSELB7;
    __IO uint32_t CHSELB8;
    __IO uint32_t CHSELB9;
    __IO uint32_t CHSELB10;
    __IO uint32_t CHSELB11;
    __IO uint32_t CHSELB12;
    __IO uint32_t CHSELB13;
    __IO uint32_t CHSELB14;
    __IO uint32_t CHSELB15;
    __IO uint32_t CHSELB16;
    __IO uint32_t CHSELB17;
    __IO uint32_t CHSELB18;
    __IO uint32_t CHSELB19;
    uint32_t RESERVED0[12];
} stc_adc_chselrb_bit_t;

typedef struct
{
    __IO uint32_t AVCHSEL0;
    __IO uint32_t AVCHSEL1;
    __IO uint32_t AVCHSEL2;
    __IO uint32_t AVCHSEL3;
    __IO uint32_t AVCHSEL4;
    __IO uint32_t AVCHSEL5;
    __IO uint32_t AVCHSEL6;
    __IO uint32_t AVCHSEL7;
    __IO uint32_t AVCHSEL8;
    __IO uint32_t AVCHSEL9;
    __IO uint32_t AVCHSEL10;
    __IO uint32_t AVCHSEL11;
    __IO uint32_t AVCHSEL12;
    __IO uint32_t AVCHSEL13;
    __IO uint32_t AVCHSEL14;
    __IO uint32_t AVCHSEL15;
    __IO uint32_t AVCHSEL16;
    __IO uint32_t AVCHSEL17;
    __IO uint32_t AVCHSEL18;
    __IO uint32_t AVCHSEL19;
    uint32_t RESERVED0[12];
} stc_adc_avchselr_bit_t;

typedef struct
{
    __IO uint32_t EXCHSEL;
    uint32_t RESERVED0[7];
} stc_adc_exchselr_bit_t;

typedef struct
{
    __IO uint32_t SHSST0;
    __IO uint32_t SHSST1;
    __IO uint32_t SHSST2;
    __IO uint32_t SHSST3;
    __IO uint32_t SHSST4;
    __IO uint32_t SHSST5;
    __IO uint32_t SHSST6;
    __IO uint32_t SHSST7;
    __IO uint32_t SHSEL0;
    __IO uint32_t SHSEL1;
    __IO uint32_t SHSEL2;
    uint32_t RESERVED0[5];
} stc_adc_shcr_bit_t;

typedef struct
{
    __IO uint32_t CH00MUX0;
    __IO uint32_t CH00MUX1;
    __IO uint32_t CH00MUX2;
    __IO uint32_t CH00MUX3;
    __IO uint32_t CH01MUX0;
    __IO uint32_t CH01MUX1;
    __IO uint32_t CH01MUX2;
    __IO uint32_t CH01MUX3;
    __IO uint32_t CH02MUX0;
    __IO uint32_t CH02MUX1;
    __IO uint32_t CH02MUX2;
    __IO uint32_t CH02MUX3;
    __IO uint32_t CH03MUX0;
    __IO uint32_t CH03MUX1;
    __IO uint32_t CH03MUX2;
    __IO uint32_t CH03MUX3;
} stc_adc_chmuxr0_bit_t;

typedef struct
{
    __IO uint32_t CH04MUX0;
    __IO uint32_t CH04MUX1;
    __IO uint32_t CH04MUX2;
    __IO uint32_t CH04MUX3;
    __IO uint32_t CH05MUX0;
    __IO uint32_t CH05MUX1;
    __IO uint32_t CH05MUX2;
    __IO uint32_t CH05MUX3;
    __IO uint32_t CH06MUX0;
    __IO uint32_t CH06MUX1;
    __IO uint32_t CH06MUX2;
    __IO uint32_t CH06MUX3;
    __IO uint32_t CH07MUX0;
    __IO uint32_t CH07MUX1;
    __IO uint32_t CH07MUX2;
    __IO uint32_t CH07MUX3;
} stc_adc_chmuxr1_bit_t;

typedef struct
{
    __IO uint32_t CH08MUX0;
    __IO uint32_t CH08MUX1;
    __IO uint32_t CH08MUX2;
    __IO uint32_t CH08MUX3;
    __IO uint32_t CH09MUX0;
    __IO uint32_t CH09MUX1;
    __IO uint32_t CH09MUX2;
    __IO uint32_t CH09MUX3;
    __IO uint32_t CH10MUX0;
    __IO uint32_t CH10MUX1;
    __IO uint32_t CH10MUX2;
    __IO uint32_t CH10MUX3;
    __IO uint32_t CH11MUX0;
    __IO uint32_t CH11MUX1;
    __IO uint32_t CH11MUX2;
    __IO uint32_t CH11MUX3;
} stc_adc_chmuxr2_bit_t;

typedef struct
{
    __IO uint32_t CH12MUX0;
    __IO uint32_t CH12MUX1;
    __IO uint32_t CH12MUX2;
    __IO uint32_t CH12MUX3;
    __IO uint32_t CH13MUX0;
    __IO uint32_t CH13MUX1;
    __IO uint32_t CH13MUX2;
    __IO uint32_t CH13MUX3;
    __IO uint32_t CH14MUX0;
    __IO uint32_t CH14MUX1;
    __IO uint32_t CH14MUX2;
    __IO uint32_t CH14MUX3;
    __IO uint32_t CH15MUX0;
    __IO uint32_t CH15MUX1;
    __IO uint32_t CH15MUX2;
    __IO uint32_t CH15MUX3;
} stc_adc_chmuxr3_bit_t;

typedef struct
{
    __IO uint32_t EOCAF;
    __IO uint32_t EOCBF;
    uint32_t RESERVED0[2];
    __IO uint32_t SASTPDF;
    uint32_t RESERVED1[3];
} stc_adc_isr_bit_t;

typedef struct
{
    __IO uint32_t EOCAIEN;
    __IO uint32_t EOCBIEN;
    uint32_t RESERVED0[6];
} stc_adc_icr_bit_t;

typedef struct
{
    __IO uint32_t CLREOCAF;
    __IO uint32_t CLREOCBF;
    uint32_t RESERVED0[2];
    __IO uint32_t CLRSASTPDF;
    uint32_t RESERVED1[3];
} stc_adc_isclrr_bit_t;

typedef struct
{
    __IO uint32_t SYNCEN;
    uint32_t RESERVED0[3];
    __IO uint32_t SYNCMD0;
    __IO uint32_t SYNCMD1;
    __IO uint32_t SYNCMD2;
    uint32_t RESERVED1[1];
    __IO uint32_t SYNCDLY0;
    __IO uint32_t SYNCDLY1;
    __IO uint32_t SYNCDLY2;
    __IO uint32_t SYNCDLY3;
    __IO uint32_t SYNCDLY4;
    __IO uint32_t SYNCDLY5;
    __IO uint32_t SYNCDLY6;
    __IO uint32_t SYNCDLY7;
} stc_adc_synccr_bit_t;

typedef struct
{
    __IO uint32_t AWD0EN;
    __IO uint32_t AWD0IEN;
    __IO uint32_t AWD0MD;
    uint32_t RESERVED0[1];
    __IO uint32_t AWD1EN;
    __IO uint32_t AWD1IEN;
    __IO uint32_t AWD1MD;
    uint32_t RESERVED1[1];
    __IO uint32_t AWDCM0;
    __IO uint32_t AWDCM1;
    uint32_t RESERVED2[6];
} stc_adc_awdcr_bit_t;

typedef struct
{
    __IO uint32_t AWD0F;
    __IO uint32_t AWD1F;
    uint32_t RESERVED0[2];
    __IO uint32_t AWDCMF;
    uint32_t RESERVED1[3];
} stc_adc_awdsr_bit_t;

typedef struct
{
    __IO uint32_t CLRAWD0F;
    __IO uint32_t CLRAWD1F;
    uint32_t RESERVED0[2];
    __IO uint32_t CLRAWDCMF;
    uint32_t RESERVED1[3];
} stc_adc_awdsclrr_bit_t;

typedef struct
{
    __IO uint32_t AWDCH0;
    __IO uint32_t AWDCH1;
    __IO uint32_t AWDCH2;
    __IO uint32_t AWDCH3;
    __IO uint32_t AWDCH4;
    uint32_t RESERVED0[11];
} stc_adc_awd0chsr_bit_t;

typedef struct
{
    __IO uint32_t AWDCH0;
    __IO uint32_t AWDCH1;
    __IO uint32_t AWDCH2;
    __IO uint32_t AWDCH3;
    __IO uint32_t AWDCH4;
    uint32_t RESERVED0[11];
} stc_adc_awd1chsr_bit_t;

typedef struct
{
    __IO uint32_t PGACTL0;
    __IO uint32_t PGACTL1;
    __IO uint32_t PGACTL2;
    __IO uint32_t PGACTL3;
    __IO uint32_t PGAGAIN0;
    __IO uint32_t PGAGAIN1;
    __IO uint32_t PGAGAIN2;
    __IO uint32_t PGAGAIN3;
} stc_adc_pgacr1_bit_t;

typedef struct
{
    __IO uint32_t PGACTL0;
    __IO uint32_t PGACTL1;
    __IO uint32_t PGACTL2;
    __IO uint32_t PGACTL3;
    __IO uint32_t PGAGAIN0;
    __IO uint32_t PGAGAIN1;
    __IO uint32_t PGAGAIN2;
    __IO uint32_t PGAGAIN3;
} stc_adc_pgacr2_bit_t;

typedef struct
{
    __IO uint32_t PGACTL0;
    __IO uint32_t PGACTL1;
    __IO uint32_t PGACTL2;
    __IO uint32_t PGACTL3;
    __IO uint32_t PGAGAIN0;
    __IO uint32_t PGAGAIN1;
    __IO uint32_t PGAGAIN2;
    __IO uint32_t PGAGAIN3;
} stc_adc_pgacr3_bit_t;

typedef struct
{
    __IO uint32_t PGAVSSEN0;
    __IO uint32_t PGAVSSEN1;
    __IO uint32_t PGAVSSEN2;
    uint32_t RESERVED0[5];
} stc_adc_pgavssenr_bit_t;

typedef struct
{
    __IO uint32_t START;
    __IO uint32_t MODE;
    uint32_t RESERVED0[30];
} stc_aes_cr_bit_t;

typedef struct
{
    __IO uint32_t STRG;
    uint32_t RESERVED0[31];
} stc_aos_int_sfttrg_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_dcu_1_trgsel_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_dcu_2_trgsel_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_dcu_3_trgsel_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_dcu_4_trgsel_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_dma_1_trgsel_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_dma_2_trgsel_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_dma_trgselrc_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_tmr6_htssr_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_port_pevnttrgsr12_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_port_pevnttrgsr34_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_tmr0_htssr_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_tmr2_htssr_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_hash_itrgsela_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_hash_itrgselb_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_tmra_htssr_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_ots_trg_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_adc_1_itrgselr_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_adc_2_itrgselr_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_adc_3_itrgselr_bit_t;

typedef struct
{
    __IO uint32_t PDIR0;
    __IO uint32_t PDIR1;
    __IO uint32_t PDIR2;
    __IO uint32_t PDIR3;
    __IO uint32_t PDIR4;
    __IO uint32_t PDIR5;
    __IO uint32_t PDIR6;
    __IO uint32_t PDIR7;
    __IO uint32_t PDIR8;
    __IO uint32_t PDIR9;
    __IO uint32_t PDIR10;
    __IO uint32_t PDIR11;
    __IO uint32_t PDIR12;
    __IO uint32_t PDIR13;
    __IO uint32_t PDIR14;
    __IO uint32_t PDIR15;
    uint32_t RESERVED0[16];
} stc_aos_gpio_pevntdirr_bit_t;

typedef struct
{
    __IO uint32_t PIN0;
    __IO uint32_t PIN1;
    __IO uint32_t PIN2;
    __IO uint32_t PIN3;
    __IO uint32_t PIN4;
    __IO uint32_t PIN5;
    __IO uint32_t PIN6;
    __IO uint32_t PIN7;
    __IO uint32_t PIN8;
    __IO uint32_t PIN9;
    __IO uint32_t PIN10;
    __IO uint32_t PIN11;
    __IO uint32_t PIN12;
    __IO uint32_t PIN13;
    __IO uint32_t PIN14;
    __IO uint32_t PIN15;
    uint32_t RESERVED0[16];
} stc_aos_gpio_pevntidr_bit_t;

typedef struct
{
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    __IO uint32_t POUT3;
    __IO uint32_t POUT4;
    __IO uint32_t POUT5;
    __IO uint32_t POUT6;
    __IO uint32_t POUT7;
    __IO uint32_t POUT8;
    __IO uint32_t POUT9;
    __IO uint32_t POUT10;
    __IO uint32_t POUT11;
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    __IO uint32_t POUT14;
    __IO uint32_t POUT15;
    uint32_t RESERVED0[16];
} stc_aos_gpio_pevntodr_bit_t;

typedef struct
{
    __IO uint32_t POR0;
    __IO uint32_t POR1;
    __IO uint32_t POR2;
    __IO uint32_t POR3;
    __IO uint32_t POR4;
    __IO uint32_t POR5;
    __IO uint32_t POR6;
    __IO uint32_t POR7;
    __IO uint32_t POR8;
    __IO uint32_t POR9;
    __IO uint32_t POR10;
    __IO uint32_t POR11;
    __IO uint32_t POR12;
    __IO uint32_t POR13;
    __IO uint32_t POR14;
    __IO uint32_t POR15;
    uint32_t RESERVED0[16];
} stc_aos_gpio_pevntorr_bit_t;

typedef struct
{
    __IO uint32_t POS0;
    __IO uint32_t POS1;
    __IO uint32_t POS2;
    __IO uint32_t POS3;
    __IO uint32_t POS4;
    __IO uint32_t POS5;
    __IO uint32_t POS6;
    __IO uint32_t POS7;
    __IO uint32_t POS8;
    __IO uint32_t POS9;
    __IO uint32_t POS10;
    __IO uint32_t POS11;
    __IO uint32_t POS12;
    __IO uint32_t POS13;
    __IO uint32_t POS14;
    __IO uint32_t POS15;
    uint32_t RESERVED0[16];
} stc_aos_gpio_pevntosr_bit_t;

typedef struct
{
    __IO uint32_t RIS0;
    __IO uint32_t RIS1;
    __IO uint32_t RIS2;
    __IO uint32_t RIS3;
    __IO uint32_t RIS4;
    __IO uint32_t RIS5;
    __IO uint32_t RIS6;
    __IO uint32_t RIS7;
    __IO uint32_t RIS8;
    __IO uint32_t RIS9;
    __IO uint32_t RIS10;
    __IO uint32_t RIS11;
    __IO uint32_t RIS12;
    __IO uint32_t RIS13;
    __IO uint32_t RIS14;
    __IO uint32_t RIS15;
    uint32_t RESERVED0[16];
} stc_aos_gpio_pevntrisr_bit_t;

typedef struct
{
    __IO uint32_t FAL0;
    __IO uint32_t FAL1;
    __IO uint32_t FAL2;
    __IO uint32_t FAL3;
    __IO uint32_t FAL4;
    __IO uint32_t FAL5;
    __IO uint32_t FAL6;
    __IO uint32_t FAL7;
    __IO uint32_t FAL8;
    __IO uint32_t FAL9;
    __IO uint32_t FAL10;
    __IO uint32_t FAL11;
    __IO uint32_t FAL12;
    __IO uint32_t FAL13;
    __IO uint32_t FAL14;
    __IO uint32_t FAL15;
    uint32_t RESERVED0[16];
} stc_aos_gpio_pevntfal_bit_t;

typedef struct
{
    __IO uint32_t NFEN1;
    uint32_t RESERVED0[7];
    __IO uint32_t NFEN2;
    uint32_t RESERVED1[7];
    __IO uint32_t NFEN3;
    uint32_t RESERVED2[7];
    __IO uint32_t NFEN4;
    uint32_t RESERVED3[7];
} stc_aos_gpio_pevntnfcr_bit_t;

typedef struct
{
    __IO uint32_t BUSOFF;
    __IO uint32_t TACTIVE;
    __IO uint32_t RACTIVE;
    __IO uint32_t TSSS;
    __IO uint32_t TPSS;
    __IO uint32_t LBMI;
    __IO uint32_t LBME;
    __IO uint32_t RESET;
} stc_can_cfg_stat_bit_t;

typedef struct
{
    __IO uint32_t TSA;
    __IO uint32_t TSALL;
    __IO uint32_t TSONE;
    __IO uint32_t TPA;
    __IO uint32_t TPE;
    uint32_t RESERVED0[1];
    __IO uint32_t LOM;
    __IO uint32_t TBSEL;
} stc_can_tcmd_bit_t;

typedef struct
{
    __IO uint32_t TSSTAT0;
    __IO uint32_t TSSTAT1;
    uint32_t RESERVED0[2];
    __IO uint32_t TTTBM;
    __IO uint32_t TSMODE;
    __IO uint32_t TSNEXT;
    __IO uint32_t FD_ISO;
} stc_can_tctrl_bit_t;

typedef struct
{
    __IO uint32_t RSTAT0;
    __IO uint32_t RSTAT1;
    uint32_t RESERVED0[1];
    __IO uint32_t RBALL;
    __IO uint32_t RREL;
    __IO uint32_t ROV;
    __IO uint32_t ROM;
    __IO uint32_t SACK;
} stc_can_rctrl_bit_t;

typedef struct
{
    __IO uint32_t TSFF;
    __IO uint32_t EIE;
    __IO uint32_t TSIE;
    __IO uint32_t TPIE;
    __IO uint32_t RAFIE;
    __IO uint32_t RFIE;
    __IO uint32_t ROIE;
    __IO uint32_t RIE;
} stc_can_rtie_bit_t;

typedef struct
{
    __IO uint32_t AIF;
    __IO uint32_t EIF;
    __IO uint32_t TSIF;
    __IO uint32_t TPIF;
    __IO uint32_t RAFIF;
    __IO uint32_t RFIF;
    __IO uint32_t ROIF;
    __IO uint32_t RIF;
} stc_can_rtif_bit_t;

typedef struct
{
    __IO uint32_t BEIF;
    __IO uint32_t BEIE;
    __IO uint32_t ALIF;
    __IO uint32_t ALIE;
    __IO uint32_t EPIF;
    __IO uint32_t EPIE;
    __IO uint32_t EPASS;
    __IO uint32_t EWARN;
} stc_can_errint_bit_t;

typedef struct
{
    __IO uint32_t EWL0;
    __IO uint32_t EWL1;
    __IO uint32_t EWL2;
    __IO uint32_t EWL3;
    __IO uint32_t AFWL0;
    __IO uint32_t AFWL1;
    __IO uint32_t AFWL2;
    __IO uint32_t AFWL3;
} stc_can_limit_bit_t;

typedef struct
{
    __IO uint32_t S_SEG_10;
    __IO uint32_t S_SEG_11;
    __IO uint32_t S_SEG_12;
    __IO uint32_t S_SEG_13;
    __IO uint32_t S_SEG_14;
    __IO uint32_t S_SEG_15;
    __IO uint32_t S_SEG_16;
    __IO uint32_t S_SEG_17;
    __IO uint32_t S_SEG_20;
    __IO uint32_t S_SEG_21;
    __IO uint32_t S_SEG_22;
    __IO uint32_t S_SEG_23;
    __IO uint32_t S_SEG_24;
    __IO uint32_t S_SEG_25;
    __IO uint32_t S_SEG_26;
    uint32_t RESERVED0[1];
    __IO uint32_t S_SJW0;
    __IO uint32_t S_SJW1;
    __IO uint32_t S_SJW2;
    __IO uint32_t S_SJW3;
    __IO uint32_t S_SJW4;
    __IO uint32_t S_SJW5;
    __IO uint32_t S_SJW6;
    uint32_t RESERVED1[1];
    __IO uint32_t S_PRESC0;
    __IO uint32_t S_PRESC1;
    __IO uint32_t S_PRESC2;
    __IO uint32_t S_PRESC3;
    __IO uint32_t S_PRESC4;
    __IO uint32_t S_PRESC5;
    __IO uint32_t S_PRESC6;
    __IO uint32_t S_PRESC7;
} stc_can_sbt_bit_t;

typedef struct
{
    __IO uint32_t F_SEG_10;
    __IO uint32_t F_SEG_11;
    __IO uint32_t F_SEG_12;
    __IO uint32_t F_SEG_13;
    __IO uint32_t F_SEG_14;
    uint32_t RESERVED0[3];
    __IO uint32_t F_SEG_20;
    __IO uint32_t F_SEG_21;
    __IO uint32_t F_SEG_22;
    __IO uint32_t F_SEG_23;
    uint32_t RESERVED1[4];
    __IO uint32_t F_SJW0;
    __IO uint32_t F_SJW1;
    __IO uint32_t F_SJW2;
    __IO uint32_t F_SJW3;
    uint32_t RESERVED2[4];
    __IO uint32_t F_PRESC0;
    __IO uint32_t F_PRESC1;
    __IO uint32_t F_PRESC2;
    __IO uint32_t F_PRESC3;
    __IO uint32_t F_PRESC4;
    __IO uint32_t F_PRESC5;
    __IO uint32_t F_PRESC6;
    __IO uint32_t F_PRESC7;
} stc_can_fbt_bit_t;

typedef struct
{
    __IO uint32_t ALC0;
    __IO uint32_t ALC1;
    __IO uint32_t ALC2;
    __IO uint32_t ALC3;
    __IO uint32_t ALC4;
    __IO uint32_t KOER0;
    __IO uint32_t KOER1;
    __IO uint32_t KOER2;
} stc_can_ealcap_bit_t;

typedef struct
{
    __IO uint32_t SSPOFF0;
    __IO uint32_t SSPOFF1;
    __IO uint32_t SSPOFF2;
    __IO uint32_t SSPOFF3;
    __IO uint32_t SSPOFF4;
    __IO uint32_t SSPOFF5;
    __IO uint32_t SSPOFF6;
    __IO uint32_t TDCEN;
} stc_can_tdc_bit_t;

typedef struct
{
    __IO uint32_t ACFADR0;
    __IO uint32_t ACFADR1;
    __IO uint32_t ACFADR2;
    __IO uint32_t ACFADR3;
    uint32_t RESERVED0[1];
    __IO uint32_t SELMASK;
    uint32_t RESERVED1[2];
} stc_can_acfctrl_bit_t;

typedef struct
{
    __IO uint32_t AE_1;
    __IO uint32_t AE_2;
    __IO uint32_t AE_3;
    __IO uint32_t AE_4;
    __IO uint32_t AE_5;
    __IO uint32_t AE_6;
    __IO uint32_t AE_7;
    __IO uint32_t AE_8;
    __IO uint32_t AE_9;
    __IO uint32_t AE_10;
    __IO uint32_t AE_11;
    __IO uint32_t AE_12;
    __IO uint32_t AE_13;
    __IO uint32_t AE_14;
    __IO uint32_t AE_15;
    __IO uint32_t AE_16;
} stc_can_acfen_bit_t;

typedef struct
{
    __IO uint32_t ACODEORAMASK0;
    __IO uint32_t ACODEORAMASK1;
    __IO uint32_t ACODEORAMASK2;
    __IO uint32_t ACODEORAMASK3;
    __IO uint32_t ACODEORAMASK4;
    __IO uint32_t ACODEORAMASK5;
    __IO uint32_t ACODEORAMASK6;
    __IO uint32_t ACODEORAMASK7;
    __IO uint32_t ACODEORAMASK8;
    __IO uint32_t ACODEORAMASK9;
    __IO uint32_t ACODEORAMASK10;
    __IO uint32_t ACODEORAMASK11;
    __IO uint32_t ACODEORAMASK12;
    __IO uint32_t ACODEORAMASK13;
    __IO uint32_t ACODEORAMASK14;
    __IO uint32_t ACODEORAMASK15;
    __IO uint32_t ACODEORAMASK16;
    __IO uint32_t ACODEORAMASK17;
    __IO uint32_t ACODEORAMASK18;
    __IO uint32_t ACODEORAMASK19;
    __IO uint32_t ACODEORAMASK20;
    __IO uint32_t ACODEORAMASK21;
    __IO uint32_t ACODEORAMASK22;
    __IO uint32_t ACODEORAMASK23;
    __IO uint32_t ACODEORAMASK24;
    __IO uint32_t ACODEORAMASK25;
    __IO uint32_t ACODEORAMASK26;
    __IO uint32_t ACODEORAMASK27;
    __IO uint32_t ACODEORAMASK28;
    __IO uint32_t AIDE;
    __IO uint32_t AIDEE;
    uint32_t RESERVED0[1];
} stc_can_acf_bit_t;

typedef struct
{
    __IO uint32_t TBPTR0;
    __IO uint32_t TBPTR1;
    __IO uint32_t TBPTR2;
    __IO uint32_t TBPTR3;
    __IO uint32_t TBPTR4;
    __IO uint32_t TBPTR5;
    __IO uint32_t TBF;
    __IO uint32_t TBE;
} stc_can_tbslot_bit_t;

typedef struct
{
    __IO uint32_t TTEN;
    __IO uint32_t T_PRESC0;
    __IO uint32_t T_PRESC1;
    __IO uint32_t TTIF;
    __IO uint32_t TTIE;
    __IO uint32_t TEIF;
    __IO uint32_t WTIF;
    __IO uint32_t WTIE;
} stc_can_ttcfg_bit_t;

typedef struct
{
    __IO uint32_t REF_ID0;
    __IO uint32_t REF_ID1;
    __IO uint32_t REF_ID2;
    __IO uint32_t REF_ID3;
    __IO uint32_t REF_ID4;
    __IO uint32_t REF_ID5;
    __IO uint32_t REF_ID6;
    __IO uint32_t REF_ID7;
    __IO uint32_t REF_ID8;
    __IO uint32_t REF_ID9;
    __IO uint32_t REF_ID10;
    __IO uint32_t REF_ID11;
    __IO uint32_t REF_ID12;
    __IO uint32_t REF_ID13;
    __IO uint32_t REF_ID14;
    __IO uint32_t REF_ID15;
    __IO uint32_t REF_ID16;
    __IO uint32_t REF_ID17;
    __IO uint32_t REF_ID18;
    __IO uint32_t REF_ID19;
    __IO uint32_t REF_ID20;
    __IO uint32_t REF_ID21;
    __IO uint32_t REF_ID22;
    __IO uint32_t REF_ID23;
    __IO uint32_t REF_ID24;
    __IO uint32_t REF_ID25;
    __IO uint32_t REF_ID26;
    __IO uint32_t REF_ID27;
    __IO uint32_t REF_ID28;
    uint32_t RESERVED0[2];
    __IO uint32_t REF_IDE;
} stc_can_ref_msg_bit_t;

