levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    __IO uint32_t TTPTR0;
    __IO uint32_t TTPTR1;
    __IO uint32_t TTPTR2;
    __IO uint32_t TTPTR3;
    __IO uint32_t TTPTR4;
    __IO uint32_t TTPTR5;
    uint32_t RESERVED0[2];
    __IO uint32_t TTYPE0;
    __IO uint32_t TTYPE1;
    __IO uint32_t TTYPE2;
    uint32_t RESERVED1[1];
    __IO uint32_t TEW0;
    __IO uint32_t TEW1;
    __IO uint32_t TEW2;
    __IO uint32_t TEW3;
} stc_can_trg_cfg_bit_t;

typedef struct
{
    __IO uint32_t CENB;
    __IO uint32_t CWDE;
    uint32_t RESERVED0[5];
    __IO uint32_t CMON;
} stc_cmp_mdr_bit_t;

typedef struct
{
    __IO uint32_t FCKS0;
    __IO uint32_t FCKS1;
    uint32_t RESERVED0[2];
    __IO uint32_t EDGS0;
    __IO uint32_t EDGS1;
    __IO uint32_t CIEN;
    uint32_t RESERVED1[1];
} stc_cmp_fir_bit_t;

typedef struct
{
    __IO uint32_t COEN;
    __IO uint32_t COPS;
    __IO uint32_t CPOE;
    __IO uint32_t TWOE;
    __IO uint32_t TWOL;
    uint32_t RESERVED0[3];
} stc_cmp_ocr_bit_t;

typedef struct
{
    __IO uint32_t RVSL0;
    __IO uint32_t RVSL1;
    __IO uint32_t RVSL2;
    __IO uint32_t RVSL3;
    __IO uint32_t CVSL0;
    __IO uint32_t CVSL1;
    __IO uint32_t CVSL2;
    __IO uint32_t CVSL3;
} stc_cmp_pmsr_bit_t;

typedef struct
{
    __IO uint32_t CTWS0;
    __IO uint32_t CTWS1;
    __IO uint32_t CTWS2;
    __IO uint32_t CTWS3;
    __IO uint32_t CTWS4;
    __IO uint32_t CTWS5;
    __IO uint32_t CTWS6;
    __IO uint32_t CTWS7;
    __IO uint32_t CTWS8;
    __IO uint32_t CTWS9;
    __IO uint32_t CTWS10;
    __IO uint32_t CTWS11;
    __IO uint32_t CTWS12;
    __IO uint32_t CTWS13;
    __IO uint32_t CTWS14;
    __IO uint32_t CTWS15;
} stc_cmp_twsr_bit_t;

typedef struct
{
    __IO uint32_t CTWP0;
    __IO uint32_t CTWP1;
    __IO uint32_t CTWP2;
    __IO uint32_t CTWP3;
    __IO uint32_t CTWP4;
    __IO uint32_t CTWP5;
    __IO uint32_t CTWP6;
    __IO uint32_t CTWP7;
    __IO uint32_t CTWP8;
    __IO uint32_t CTWP9;
    __IO uint32_t CTWP10;
    __IO uint32_t CTWP11;
    __IO uint32_t CTWP12;
    __IO uint32_t CTWP13;
    __IO uint32_t CTWP14;
    __IO uint32_t CTWP15;
} stc_cmp_twpr_bit_t;

typedef struct
{
    __IO uint32_t P2SL0;
    __IO uint32_t P2SL1;
    __IO uint32_t P2SL2;
    uint32_t RESERVED0[1];
    __IO uint32_t P3SL0;
    __IO uint32_t P3SL1;
    uint32_t RESERVED1[10];
} stc_cmp_visr_bit_t;

typedef struct
{
    __IO uint32_t XTAL32STP;
    uint32_t RESERVED0[7];
} stc_cmu_xtal32cr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_cmu_xtal32cfgr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_cmu_xtal32nfr_bit_t;

typedef struct
{
    __IO uint32_t LRCSTP;
    uint32_t RESERVED0[7];
} stc_cmu_lrccr_bit_t;

typedef struct
{
    __IO uint32_t RTCLRCSTP;
    uint32_t RESERVED0[7];
} stc_cmu_rtclrccr_bit_t;

typedef struct
{
    uint32_t RESERVED0[6];
    __IO uint32_t XTALMS;
    uint32_t RESERVED1[1];
} stc_cmu_xtalcfgr_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
} stc_cmu_pericksel_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
} stc_cmu_i2scksel_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_cmu_canckcfgr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_cmu_usbckcfgr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_cmu_ckswr_bit_t;

typedef struct
{
    __IO uint32_t PLLHOFF;
    uint32_t RESERVED0[7];
} stc_cmu_pllhcr_bit_t;

typedef struct
{
    __IO uint32_t PLLAOFF;
    uint32_t RESERVED0[7];
} stc_cmu_pllacr_bit_t;

typedef struct
{
    __IO uint32_t XTALSTP;
    uint32_t RESERVED0[7];
} stc_cmu_xtalcr_bit_t;

typedef struct
{
    __IO uint32_t HRCSTP;
    uint32_t RESERVED0[7];
} stc_cmu_hrccr_bit_t;

typedef struct
{
    __IO uint32_t MRCSTP;
    uint32_t RESERVED0[7];
} stc_cmu_mrccr_bit_t;

typedef struct
{
    __IO uint32_t HRCSTBF;
    uint32_t RESERVED0[2];
    __IO uint32_t XTALSTBF;
    uint32_t RESERVED1[1];
    __IO uint32_t PLLHSTBF;
    __IO uint32_t PLLASTBF;
    __IO uint32_t PLLBSTBF;
} stc_cmu_oscstbsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t MCO1EN;
} stc_cmu_mco1cfgr_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t MCO2EN;
} stc_cmu_mco2cfgr_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t TPIUCKOE;
} stc_cmu_tpiuckcfgr_bit_t;

typedef struct
{
    __IO uint32_t XTALSTDIE;
    __IO uint32_t XTALSTDRE;
    __IO uint32_t XTALSTDRIS;
    uint32_t RESERVED0[4];
    __IO uint32_t XTALSTDE;
} stc_cmu_xtalstdcr_bit_t;

typedef struct
{
    __IO uint32_t XTALSTDF;
    uint32_t RESERVED0[7];
} stc_cmu_xtalstdsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_cmu_xtalstbcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t PLLSRC;
    uint32_t RESERVED1[24];
} stc_cmu_pllhcfgr_bit_t;

typedef struct
{
    __IO uint32_t CR;
    __IO uint32_t FLAG;
    uint32_t RESERVED0[30];
} stc_crc_cr_bit_t;

typedef struct
{
    __IO uint32_t REFPSC0;
    __IO uint32_t REFPSC1;
    __IO uint32_t REFPSC2;
    uint32_t RESERVED0[1];
    __IO uint32_t REFCKS0;
    __IO uint32_t REFCKS1;
    __IO uint32_t ERRIE;
    __IO uint32_t CTCEN;
    uint32_t RESERVED1[24];
} stc_ctc_cr1_bit_t;

typedef struct
{
    __IO uint32_t OFSVAL0;
    __IO uint32_t OFSVAL1;
    __IO uint32_t OFSVAL2;
    __IO uint32_t OFSVAL3;
    __IO uint32_t OFSVAL4;
    __IO uint32_t OFSVAL5;
    __IO uint32_t OFSVAL6;
    __IO uint32_t OFSVAL7;
    uint32_t RESERVED0[24];
} stc_ctc_cr2_bit_t;

typedef struct
{
    __IO uint32_t TRIMOK;
    __IO uint32_t TRMOVF;
    __IO uint32_t TRMUDF;
    __IO uint32_t CTCBSY;
    uint32_t RESERVED0[28];
} stc_ctc_str_bit_t;

typedef struct
{
    __IO uint32_t DR0;
    __IO uint32_t DR1;
    __IO uint32_t DR2;
    __IO uint32_t DR3;
    __IO uint32_t DL0R4;
    __IO uint32_t DL1R5;
    __IO uint32_t DL2R6;
    __IO uint32_t DL3R7;
    __IO uint32_t DL4R8;
    __IO uint32_t DL5R9;
    __IO uint32_t DL6R10;
    __IO uint32_t DL7R11;
    __IO uint32_t DL8;
    __IO uint32_t DL9;
    __IO uint32_t DL10;
    __IO uint32_t DL11;
} stc_dac_dadr1_bit_t;

typedef struct
{
    __IO uint32_t DR0;
    __IO uint32_t DR1;
    __IO uint32_t DR2;
    __IO uint32_t DR3;
    __IO uint32_t DL0R4;
    __IO uint32_t DL1R5;
    __IO uint32_t DL2R6;
    __IO uint32_t DL3R7;
    __IO uint32_t DL4R8;
    __IO uint32_t DL5R9;
    __IO uint32_t DL6R10;
    __IO uint32_t DL7R11;
    __IO uint32_t DL8;
    __IO uint32_t DL9;
    __IO uint32_t DL10;
    __IO uint32_t DL11;
} stc_dac_dadr2_bit_t;

typedef struct
{
    __IO uint32_t DAE;
    __IO uint32_t DA1E;
    __IO uint32_t DA2E;
    uint32_t RESERVED0[5];
    __IO uint32_t DPSEL;
    __IO uint32_t DAAMP1;
    __IO uint32_t DAAMP2;
    __IO uint32_t EXTDSL1;
    __IO uint32_t EXTDSL2;
    uint32_t RESERVED1[3];
} stc_dac_dacr_bit_t;

typedef struct
{
    __IO uint32_t ADPSL1;
    __IO uint32_t ADPSL2;
    __IO uint32_t ADPSL3;
    uint32_t RESERVED0[5];
    __IO uint32_t DA1SF;
    __IO uint32_t DA2SF;
    uint32_t RESERVED1[5];
    __IO uint32_t ADPEN;
} stc_dac_daadpcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t DAODIS1;
    __IO uint32_t DAODIS2;
} stc_dac_daocr_bit_t;

typedef struct
{
    __IO uint32_t AUTH;
    __IO uint32_t REMVLOCK;
    __IO uint32_t SAFTYLOCK1;
    __IO uint32_t SAFTYLOCK2;
    uint32_t RESERVED0[4];
    __IO uint32_t CPUSTOP;
    __IO uint32_t CPUSLEEP;
    uint32_t RESERVED1[22];
} stc_dbgc_mcustat_bit_t;

typedef struct
{
    __IO uint32_t EDBGRQ;
    __IO uint32_t RESTART;
    uint32_t RESERVED0[6];
    __IO uint32_t DIRQ;
    uint32_t RESERVED1[23];
} stc_dbgc_mcuctl_bit_t;

typedef struct
{
    __IO uint32_t ERASEREQ;
    __IO uint32_t ERASEACK;
    __IO uint32_t ERASEERR;
    uint32_t RESERVED0[29];
} stc_dbgc_fmcctl_bit_t;

typedef struct
{
    __IO uint32_t CDBGPWRUPREQ;
    __IO uint32_t CDBGPWRUPACK;
    uint32_t RESERVED0[30];
} stc_dbgc_mcudbgcstat_bit_t;

typedef struct
{
    __IO uint32_t SWDTSTP;
    __IO uint32_t WDTSTP;
    __IO uint32_t RTCSTP;
    __IO uint32_t PVD0STP;
    __IO uint32_t PVD1STP;
    __IO uint32_t PVD2STP;
    __IO uint32_t M06STP;
    __IO uint32_t M07STP;
    __IO uint32_t M08STP;
    __IO uint32_t M09STP;
    __IO uint32_t M10STP;
    __IO uint32_t M11STP;
    __IO uint32_t M12STP;
    __IO uint32_t M13STP;
    __IO uint32_t M14STP;
    __IO uint32_t M15STP;
    __IO uint32_t M16STP;
    __IO uint32_t M17STP;
    __IO uint32_t M18STP;
    __IO uint32_t M19STP;
    __IO uint32_t M20STP;
    __IO uint32_t M21STP;
    __IO uint32_t M22STP;
    __IO uint32_t M23STP;
    __IO uint32_t M24STP;
    __IO uint32_t M25STP;
    __IO uint32_t M26STP;
    __IO uint32_t M27STP;
    __IO uint32_t M28STP;
    __IO uint32_t M29STP;
    __IO uint32_t M30STP;
    __IO uint32_t M31STP;
} stc_dbgc_mcustpctl_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t TRACEIOEN;
    uint32_t RESERVED1[29];
} stc_dbgc_mcutracectl_bit_t;

typedef struct
{
    __IO uint32_t M32STP;
    __IO uint32_t M33STP;
    __IO uint32_t M34STP;
    __IO uint32_t M35STP;
    __IO uint32_t M36STP;
    __IO uint32_t M37STP;
    __IO uint32_t M38STP;
    __IO uint32_t M39STP;
    __IO uint32_t M40STP;
    __IO uint32_t M41STP;
    __IO uint32_t M42STP;
    __IO uint32_t M43STP;
    __IO uint32_t M44STP;
    __IO uint32_t M45STP;
    __IO uint32_t M46STP;
    __IO uint32_t M47STP;
    __IO uint32_t M48STP;
    __IO uint32_t M49STP;
    __IO uint32_t M50STP;
    __IO uint32_t M51STP;
    __IO uint32_t M52STP;
    __IO uint32_t M53STP;
    __IO uint32_t M54STP;
    __IO uint32_t M55STP;
    __IO uint32_t M56STP;
    __IO uint32_t M57STP;
    __IO uint32_t M58STP;
    __IO uint32_t M59STP;
    __IO uint32_t M60STP;
    __IO uint32_t M61STP;
    __IO uint32_t M62STP;
    __IO uint32_t M63STP;
} stc_dbgc_mcustpctl2_bit_t;

typedef struct
{
    __IO uint32_t MODE0;
    __IO uint32_t MODE1;
    __IO uint32_t MODE2;
    __IO uint32_t MODE3;
    __IO uint32_t DATASIZE0;
    __IO uint32_t DATASIZE1;
    uint32_t RESERVED0[2];
    __IO uint32_t COMP_TRG;
    uint32_t RESERVED1[22];
    __IO uint32_t INTEN;
} stc_dcu_ctl_bit_t;

typedef struct
{
    __IO uint32_t FLAG_OP;
    __IO uint32_t FLAG_LS2;
    __IO uint32_t FLAG_EQ2;
    __IO uint32_t FLAG_GT2;
    __IO uint32_t FLAG_LS1;
    __IO uint32_t FLAG_EQ1;
    __IO uint32_t FLAG_GT1;
    uint32_t RESERVED0[2];
    __IO uint32_t FLAG_RLD;
    __IO uint32_t FLAG_BTM;
    __IO uint32_t FLAG_TOP;
    uint32_t RESERVED1[20];
} stc_dcu_flag_bit_t;

typedef struct
{
    __IO uint32_t CLR_OP;
    __IO uint32_t CLR_LS2;
    __IO uint32_t CLR_EQ2;
    __IO uint32_t CLR_GT2;
    __IO uint32_t CLR_LS1;
    __IO uint32_t CLR_EQ1;
    __IO uint32_t CLR_GT1;
    uint32_t RESERVED0[2];
    __IO uint32_t CLR_RLD;
    __IO uint32_t CLR_BTM;
    __IO uint32_t CLR_TOP;
    uint32_t RESERVED1[20];
} stc_dcu_flagclr_bit_t;

typedef struct
{
    __IO uint32_t SEL_OP;
    __IO uint32_t SEL_LS2;
    __IO uint32_t SEL_EQ2;
    __IO uint32_t SEL_GT2;
    __IO uint32_t SEL_LS1;
    __IO uint32_t SEL_EQ1;
    __IO uint32_t SEL_GT1;
    __IO uint32_t SEL_WIN0;
    __IO uint32_t SEL_WIN1;
    __IO uint32_t SEL_RLD;
    __IO uint32_t SEL_BTM;
    __IO uint32_t SEL_TOP;
    uint32_t RESERVED0[20];
} stc_dcu_intevtsel_bit_t;

typedef struct
{
    __IO uint32_t EN;
    uint32_t RESERVED0[31];
} stc_dma_en_bit_t;

typedef struct
{
    __IO uint32_t TRNERR0;
    __IO uint32_t TRNERR1;
    __IO uint32_t TRNERR2;
    __IO uint32_t TRNERR3;
    __IO uint32_t TRNERR4;
    __IO uint32_t TRNERR5;
    __IO uint32_t TRNERR6;
    __IO uint32_t TRNERR7;
    uint32_t RESERVED0[8];
    __IO uint32_t REQERR0;
    __IO uint32_t REQERR1;
    __IO uint32_t REQERR2;
    __IO uint32_t REQERR3;
    __IO uint32_t REQERR4;
    __IO uint32_t REQERR5;
    __IO uint32_t REQERR6;
    __IO uint32_t REQERR7;
    uint32_t RESERVED1[8];
} stc_dma_intstat0_bit_t;

typedef struct
{
    __IO uint32_t TC0;
    __IO uint32_t TC1;
    __IO uint32_t TC2;
    __IO uint32_t TC3;
    __IO uint32_t TC4;
    __IO uint32_t TC5;
    __IO uint32_t TC6;
    __IO uint32_t TC7;
    uint32_t RESERVED0[8];
    __IO uint32_t BTC0;
    __IO uint32_t BTC1;
    __IO uint32_t BTC2;
    __IO uint32_t BTC3;
    __IO uint32_t BTC4;
    __IO uint32_t BTC5;
    __IO uint32_t BTC6;
    __IO uint32_t BTC7;
    uint32_t RESERVED1[8];
} stc_dma_intstat1_bit_t;

typedef struct
{
    __IO uint32_t MSKTRNERR0;
    __IO uint32_t MSKTRNERR1;
    __IO uint32_t MSKTRNERR2;
    __IO uint32_t MSKTRNERR3;
    __IO uint32_t MSKTRNERR4;
    __IO uint32_t MSKTRNERR5;
    __IO uint32_t MSKTRNERR6;
    __IO uint32_t MSKTRNERR7;
    uint32_t RESERVED0[8];
    __IO uint32_t MSKREQERR0;
    __IO uint32_t MSKREQERR1;
    __IO uint32_t MSKREQERR2;
    __IO uint32_t MSKREQERR3;
    __IO uint32_t MSKREQERR4;
    __IO uint32_t MSKREQERR5;
    __IO uint32_t MSKREQERR6;
    __IO uint32_t MSKREQERR7;
    uint32_t RESERVED1[8];
} stc_dma_intmask0_bit_t;

typedef struct
{
    __IO uint32_t MSKTC0;
    __IO uint32_t MSKTC1;
    __IO uint32_t MSKTC2;
    __IO uint32_t MSKTC3;
    __IO uint32_t MSKTC4;
    __IO uint32_t MSKTC5;
    __IO uint32_t MSKTC6;
    __IO uint32_t MSKTC7;
    uint32_t RESERVED0[8];
    __IO uint32_t MSKBTC0;
    __IO uint32_t MSKBTC1;
    __IO uint32_t MSKBTC2;
    __IO uint32_t MSKBTC3;
    __IO uint32_t MSKBTC4;
    __IO uint32_t MSKBTC5;
    __IO uint32_t MSKBTC6;
    __IO uint32_t MSKBTC7;
    uint32_t RESERVED1[8];
} stc_dma_intmask1_bit_t;

typedef struct
{
    __IO uint32_t CLRTRNERR0;
    __IO uint32_t CLRTRNERR1;
    __IO uint32_t CLRTRNERR2;
    __IO uint32_t CLRTRNERR3;
    __IO uint32_t CLRTRNERR4;
    __IO uint32_t CLRTRNERR5;
    __IO uint32_t CLRTRNERR6;
    __IO uint32_t CLRTRNERR7;
    uint32_t RESERVED0[8];
    __IO uint32_t CLRREQERR0;
    __IO uint32_t CLRREQERR1;
    __IO uint32_t CLRREQERR2;
    __IO uint32_t CLRREQERR3;
    __IO uint32_t CLRREQERR4;
    __IO uint32_t CLRREQERR5;
    __IO uint32_t CLRREQERR6;
    __IO uint32_t CLRREQERR7;
    uint32_t RESERVED1[8];
} stc_dma_intclr0_bit_t;

typedef struct
{
    __IO uint32_t CLRTC0;
    __IO uint32_t CLRTC1;
    __IO uint32_t CLRTC2;
    __IO uint32_t CLRTC3;
    __IO uint32_t CLRTC4;
    __IO uint32_t CLRTC5;
    __IO uint32_t CLRTC6;
    __IO uint32_t CLRTC7;
    uint32_t RESERVED0[8];
    __IO uint32_t CLRBTC0;
    __IO uint32_t CLRBTC1;
    __IO uint32_t CLRBTC2;
    __IO uint32_t CLRBTC3;
    __IO uint32_t CLRBTC4;
    __IO uint32_t CLRBTC5;
    __IO uint32_t CLRBTC6;
    __IO uint32_t CLRBTC7;
    uint32_t RESERVED1[8];
} stc_dma_intclr1_bit_t;

typedef struct
{
    __IO uint32_t CHEN0;
    __IO uint32_t CHEN1;
    __IO uint32_t CHEN2;
    __IO uint32_t CHEN3;
    __IO uint32_t CHEN4;
    __IO uint32_t CHEN5;
    __IO uint32_t CHEN6;
    __IO uint32_t CHEN7;
    uint32_t RESERVED0[24];
} stc_dma_chen_bit_t;

typedef struct
{
    __IO uint32_t CHREQ0;
    __IO uint32_t CHREQ1;
    __IO uint32_t CHREQ2;
    __IO uint32_t CHREQ3;
    __IO uint32_t CHREQ4;
    __IO uint32_t CHREQ5;
    __IO uint32_t CHREQ6;
    __IO uint32_t CHREQ7;
    uint32_t RESERVED0[7];
    __IO uint32_t RCFGREQ;
    uint32_t RESERVED1[16];
} stc_dma_reqstat_bit_t;

typedef struct
{
    __IO uint32_t DMAACT;
    __IO uint32_t RCFGACT;
    uint32_t RESERVED0[14];
    __IO uint32_t CHACT0;
    __IO uint32_t CHACT1;
    __IO uint32_t CHACT2;
    __IO uint32_t CHACT3;
    __IO uint32_t CHACT4;
    __IO uint32_t CHACT5;
    __IO uint32_t CHACT6;
    __IO uint32_t CHACT7;
    uint32_t RESERVED1[8];
} stc_dma_chstat_bit_t;

typedef struct
{
    __IO uint32_t RCFGEN;
    __IO uint32_t RCFGLLP;
    uint32_t RESERVED0[14];
    __IO uint32_t SARMD0;
    __IO uint32_t SARMD1;
    __IO uint32_t DARMD0;
    __IO uint32_t DARMD1;
    __IO uint32_t CNTMD0;
    __IO uint32_t CNTMD1;
    uint32_t RESERVED1[10];
} stc_dma_rcfgctl_bit_t;

typedef struct
{
    __IO uint32_t CHENCLR0;
    __IO uint32_t CHENCLR1;
    __IO uint32_t CHENCLR2;
    __IO uint32_t CHENCLR3;
    __IO uint32_t CHENCLR4;
    __IO uint32_t CHENCLR5;
    __IO uint32_t CHENCLR6;
    __IO uint32_t CHENCLR7;
    uint32_t RESERVED0[24];
} stc_dma_chenclr_bit_t;

typedef struct
{
    __IO uint32_t SINC0;
    __IO uint32_t SINC1;
    __IO uint32_t DINC0;
    __IO uint32_t DINC1;
    __IO uint32_t SRTPEN;
    __IO uint32_t DRPTEN;
    __IO uint32_t SNSEQEN;
    __IO uint32_t DNSEQEN;
    __IO uint32_t HSIZE0;
    __IO uint32_t HSIZE1;
    __IO uint32_t LLPEN;
    __IO uint32_t LLPRUN;
    __IO uint32_t IE;
    uint32_t RESERVED0[19];
} stc_dma_chctl_bit_t;

typedef struct
{
    __IO uint32_t CAPEN;
    __IO uint32_t CAPMD;
    __IO uint32_t CROPEN;
    __IO uint32_t JPEGEN;
    __IO uint32_t SWSYNC;
    __IO uint32_t PIXCKSEL;
    __IO uint32_t HSYNCSEL;
    __IO uint32_t VSYNCSEL;
    __IO uint32_t CAPFRC0;
    __IO uint32_t CAPFRC1;
    __IO uint32_t BITSEL0;
    __IO uint32_t BITSEL1;
    uint32_t RESERVED0[2];
    __IO uint32_t DVPEN;
    uint32_t RESERVED1[17];
} stc_dvp_ctr_bit_t;

typedef struct
{
    __IO uint32_t FSF;
    __IO uint32_t LSF;
    __IO uint32_t LEF;
    __IO uint32_t FEF;
    __IO uint32_t SQUERF;
    __IO uint32_t FIFOERF;
    uint32_t RESERVED0[26];
} stc_dvp_str_bit_t;

typedef struct
{
    __IO uint32_t FSIEN;
    __IO uint32_t LSIEN;
    __IO uint32_t LEIEN;
    __IO uint32_t FEIEN;
    __IO uint32_t SQUERIEN;
    __IO uint32_t FIFOERIEN;
    uint32_t RESERVED0[26];
} stc_dvp_ier_bit_t;

typedef struct
{
    __IO uint32_t FAPRT0;
    __IO uint32_t FAPRT1;
    __IO uint32_t FAPRT2;
    __IO uint32_t FAPRT3;
    __IO uint32_t FAPRT4;
    __IO uint32_t FAPRT5;
    __IO uint32_t FAPRT6;
    __IO uint32_t FAPRT7;
    __IO uint32_t FAPRT8;
    __IO uint32_t FAPRT9;
    __IO uint32_t FAPRT10;
    __IO uint32_t FAPRT11;
    __IO uint32_t FAPRT12;
    __IO uint32_t FAPRT13;
    __IO uint32_t FAPRT14;
    __IO uint32_t FAPRT15;
    uint32_t RESERVED0[16];
} stc_efm_faprt_bit_t;

typedef struct
{
    __IO uint32_t F0STP;
    __IO uint32_t F1STP;
    uint32_t RESERVED0[30];
} stc_efm_fstp_bit_t;

typedef struct
{
    __IO uint32_t FLWT0;
    __IO uint32_t FLWT1;
    __IO uint32_t FLWT2;
    __IO uint32_t FLWT3;
    uint32_t RESERVED0[4];
    __IO uint32_t LVM;
    uint32_t RESERVED1[7];
    __IO uint32_t ICACHE;
    __IO uint32_t DCACHE;
    __IO uint32_t PREFE;
    __IO uint32_t CRST;
    uint32_t RESERVED2[12];
} stc_efm_frmc_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
    __IO uint32_t BUSHLDCTL;
    uint32_t RESERVED1[7];
    __IO uint32_t KEY1LOCK;
    __IO uint32_t KEY2LOCK;
    uint32_t RESERVED2[14];
} stc_efm_fwmc_bit_t;

typedef struct
{
    __IO uint32_t OTPWERR0;
    __IO uint32_t PRTWERR0;
    __IO uint32_t PGSZERR0;
    __IO uint32_t MISMTCH0;
    __IO uint32_t OPTEND0;
    __IO uint32_t COLERR0;
    uint32_t RESERVED0[2];
    __IO uint32_t RDY0;
    uint32_t RESERVED1[8];
    __IO uint32_t PRTWERR1;
    __IO uint32_t PGSZERR1;
    __IO uint32_t MISMTCH1;
    __IO uint32_t OPTEND1;
    __IO uint32_t COLERR1;
    uint32_t RESERVED2[2];
    __IO uint32_t RDY1;
    uint32_t RESERVED3[7];
} stc_efm_fsr_bit_t;

typedef struct
{
    __IO uint32_t OTPWERRCLR0;
    __IO uint32_t PRTWERRCLR0;
    __IO uint32_t PGSZERRCLR0;
    __IO uint32_t MISMTCHCLR0;
    __IO uint32_t OPTENDCLR0;
    __IO uint32_t COLERRCLR0;
    uint32_t RESERVED0[11];
    __IO uint32_t PRTWERRCLR1;
    __IO uint32_t PGSZERRCLR1;
    __IO uint32_t MISMTCHCLR1;
    __IO uint32_t OPTENDCLR1;
    __IO uint32_t COLERRCLR1;
    uint32_t RESERVED1[10];
} stc_efm_fsclr_bit_t;

typedef struct
{
    __IO uint32_t PEERRITE;
    __IO uint32_t OPTENDITE;
    __IO uint32_t COLERRITE;
    uint32_t RESERVED0[29];
} stc_efm_fite_bit_t;

typedef struct
{
    __IO uint32_t FSWP;
    uint32_t RESERVED0[31];
} stc_efm_fswp_bit_t;

typedef struct
{
    __IO uint32_t REMPRT0;
    __IO uint32_t REMPRT1;
    __IO uint32_t REMPRT2;
    __IO uint32_t REMPRT3;
    __IO uint32_t REMPRT4;
    __IO uint32_t REMPRT5;
    __IO uint32_t REMPRT6;
    __IO uint32_t REMPRT7;
    __IO uint32_t REMPRT8;
    __IO uint32_t REMPRT9;
    __IO uint32_t REMPRT10;
    __IO uint32_t REMPRT11;
    __IO uint32_t REMPRT12;
    __IO uint32_t REMPRT13;
    __IO uint32_t REMPRT14;
    __IO uint32_t REMPRT15;
    uint32_t RESERVED0[16];
} stc_mmf_remprt_bit_t;

typedef struct
{
    __IO uint32_t RM0SIZE0;
    __IO uint32_t RM0SIZE1;
    __IO uint32_t RM0SIZE2;
    __IO uint32_t RM0SIZE3;
    __IO uint32_t RM0SIZE4;
    uint32_t RESERVED0[7];
    __IO uint32_t RM0TADDR0;
    __IO uint32_t RM0TADDR1;
    __IO uint32_t RM0TADDR2;
    __IO uint32_t RM0TADDR3;
    __IO uint32_t RM0TADDR4;
    __IO uint32_t RM0TADDR5;
    __IO uint32_t RM0TADDR6;
    __IO uint32_t RM0TADDR7;
    __IO uint32_t RM0TADDR8;
    __IO uint32_t RM0TADDR9;
    __IO uint32_t RM0TADDR10;
    __IO uint32_t RM0TADDR11;
    __IO uint32_t RM0TADDR12;
    __IO uint32_t RM0TADDR13;
    __IO uint32_t RM0TADDR14;
    __IO uint32_t RM0TADDR15;
    __IO uint32_t RM0TADDR16;
    uint32_t RESERVED1[2];
    __IO uint32_t EN0;
} stc_mmf_remcr0_bit_t;

typedef struct
{
    __IO uint32_t RM1SIZE0;
    __IO uint32_t RM1SIZE1;
    __IO uint32_t RM1SIZE2;
    __IO uint32_t RM1SIZE3;
    __IO uint32_t RM1SIZE4;
    uint32_t RESERVED0[7];
    __IO uint32_t RM1TADDR0;
    __IO uint32_t RM1TADDR1;
    __IO uint32_t RM1TADDR2;
    __IO uint32_t RM1TADDR3;
    __IO uint32_t RM1TADDR4;
    __IO uint32_t RM1TADDR5;
    __IO uint32_t RM1TADDR6;
    __IO uint32_t RM1TADDR7;
    __IO uint32_t RM1TADDR8;
    __IO uint32_t RM1TADDR9;
    __IO uint32_t RM1TADDR10;
    __IO uint32_t RM1TADDR11;
    __IO uint32_t RM1TADDR12;
    __IO uint32_t RM1TADDR13;
    __IO uint32_t RM1TADDR14;
    __IO uint32_t RM1TADDR15;
    __IO uint32_t RM1TADDR16;
    uint32_t RESERVED1[2];
    __IO uint32_t EN1;
} stc_mmf_remcr1_bit_t;

typedef struct
{
    __IO uint32_t WLOCK0;
    __IO uint32_t WLOCK1;
    __IO uint32_t WLOCK2;
    __IO uint32_t WLOCK3;
    __IO uint32_t WLOCK4;
    __IO uint32_t WLOCK5;
    __IO uint32_t WLOCK6;
    __IO uint32_t WLOCK7;
    uint32_t RESERVED0[24];
} stc_efm_wlock_bit_t;

typedef struct
{
    __IO uint32_t CMPEN0;
    __IO uint32_t CMPEN1;
    __IO uint32_t CMPEN2;
    __IO uint32_t CMPEN3;
    __IO uint32_t OSCSTPEN;
    __IO uint32_t PWMSEN0;
    __IO uint32_t PWMSEN1;
    __IO uint32_t PWMSEN2;
    __IO uint32_t PWMSEN3;
    __IO uint32_t PWMSEN4;
    __IO uint32_t PWMSEN5;
    __IO uint32_t PWMSEN6;
    __IO uint32_t PWMSEN7;
    uint32_t RESERVED0[3];
    __IO uint32_t PORTINEN1;
    __IO uint32_t PORTINEN2;
    __IO uint32_t PORTINEN3;
    __IO uint32_t PORTINEN4;
    uint32_t RESERVED1[2];
    __IO uint32_t INVSEL1;
    __IO uint32_t INVSEL2;
    __IO uint32_t INVSEL3;
    __IO uint32_t INVSEL4;
    uint32_t RESERVED2[6];
} stc_emb_ctl1_bit_t;

typedef struct
{
    __IO uint32_t PWMLV0;
    __IO uint32_t PWMLV1;
    __IO uint32_t PWMLV2;
    __IO uint32_t PWMLV3;
    __IO uint32_t PWMLV4;
    __IO uint32_t PWMLV5;
    __IO uint32_t PWMLV6;
    __IO uint32_t PWMLV7;
    uint32_t RESERVED0[8];
    __IO uint32_t NFSEL10;
    __IO uint32_t NFSEL11;
    __IO uint32_t NFEN1;
    __IO uint32_t NFSEL20;
    __IO uint32_t NFSEL21;
    __IO uint32_t NFEN2;
    __IO uint32_t NFSEL30;
    __IO uint32_t NFSEL31;
    __IO uint32_t NFEN3;
    __IO uint32_t NFSEL40;
    __IO uint32_t NFSEL41;
    __IO uint32_t NFEN4;
    uint32_t RESERVED1[4];
} stc_emb_ctl2_bit_t;

typedef struct
{
    __IO uint32_t SOE;
    uint32_t RESERVED0[31];
} stc_emb_soe_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t PWMSF;
    __IO uint32_t CMPF;
    __IO uint32_t OSF;
    uint32_t RESERVED1[1];
    __IO uint32_t PWMST;
    __IO uint32_t CMPST;
    __IO uint32_t OSST;
    __IO uint32_t PORTINF1;
    __IO uint32_t PORTINF2;
    __IO uint32_t PORTINF3;
    __IO uint32_t PORTINF4;
    uint32_t RESERVED2[2];
    __IO uint32_t PORTINST1;
    __IO uint32_t PORTINST2;
    __IO uint32_t PORTINST3;
    __IO uint32_t PORTINST4;
    uint32_t RESERVED3[14];
} stc_emb_stat_bit_t;

