levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t PWMSFCLR;
    __IO uint32_t CMPFCLR;
    __IO uint32_t OSFCLR;
    uint32_t RESERVED1[4];
    __IO uint32_t PORTINFCLR1;
    __IO uint32_t PORTINFCLR2;
    __IO uint32_t PORTINFCLR3;
    __IO uint32_t PORTINFCLR4;
    uint32_t RESERVED2[20];
} stc_emb_statclr_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t PWMSINTEN;
    __IO uint32_t CMPINTEN;
    __IO uint32_t OSINTEN;
    uint32_t RESERVED1[4];
    __IO uint32_t PORTINTEN1;
    __IO uint32_t PORTINTEN2;
    __IO uint32_t PORTINTEN3;
    __IO uint32_t PORTINTEN4;
    uint32_t RESERVED2[20];
} stc_emb_inten_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t PWMRSEL;
    __IO uint32_t CMPRSEL;
    __IO uint32_t OSRSEL;
    uint32_t RESERVED1[4];
    __IO uint32_t PORTINRSEL1;
    __IO uint32_t PORTINRSEL2;
    __IO uint32_t PORTINRSEL3;
    __IO uint32_t PORTINRSEL4;
    uint32_t RESERVED2[20];
} stc_emb_rlssel_bit_t;

typedef struct
{
    __IO uint32_t IFSEL;
    uint32_t RESERVED0[3];
    __IO uint32_t RCKINV;
    __IO uint32_t TCKINV;
    uint32_t RESERVED1[26];
} stc_eth_mac_ifconfr_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t RE;
    __IO uint32_t TE;
    __IO uint32_t DC;
    __IO uint32_t BL0;
    __IO uint32_t BL1;
    __IO uint32_t ACS;
    uint32_t RESERVED1[1];
    __IO uint32_t DRTY;
    __IO uint32_t IPCO;
    __IO uint32_t DM;
    __IO uint32_t LM;
    __IO uint32_t DO;
    __IO uint32_t FES;
    uint32_t RESERVED2[1];
    __IO uint32_t DCRS;
    __IO uint32_t IFG0;
    __IO uint32_t IFG1;
    __IO uint32_t IFG2;
    uint32_t RESERVED3[2];
    __IO uint32_t MJB;
    __IO uint32_t MWD;
    uint32_t RESERVED4[1];
    __IO uint32_t CST;
    uint32_t RESERVED5[2];
    __IO uint32_t SAIRC0;
    __IO uint32_t SAIRC1;
    __IO uint32_t SAIRC2;
    uint32_t RESERVED6[1];
} stc_eth_mac_configr_bit_t;

typedef struct
{
    __IO uint32_t PR;
    __IO uint32_t HUC;
    __IO uint32_t HMC;
    __IO uint32_t DAIF;
    __IO uint32_t PMF;
    __IO uint32_t DBF;
    __IO uint32_t PCF0;
    __IO uint32_t PCF1;
    __IO uint32_t SAIF;
    __IO uint32_t SAF;
    __IO uint32_t HPF;
    uint32_t RESERVED0[5];
    __IO uint32_t VTFE;
    uint32_t RESERVED1[3];
    __IO uint32_t IPFE;
    __IO uint32_t DNTU;
    uint32_t RESERVED2[9];
    __IO uint32_t RA;
} stc_eth_mac_fltctlr_bit_t;

typedef struct
{
    __IO uint32_t SMIB;
    __IO uint32_t SMIW;
    __IO uint32_t SMIC0;
    __IO uint32_t SMIC1;
    __IO uint32_t SMIC2;
    __IO uint32_t SMIC3;
    __IO uint32_t SMIR0;
    __IO uint32_t SMIR1;
    __IO uint32_t SMIR2;
    __IO uint32_t SMIR3;
    __IO uint32_t SMIR4;
    __IO uint32_t SMIA0;
    __IO uint32_t SMIA1;
    __IO uint32_t SMIA2;
    __IO uint32_t SMIA3;
    __IO uint32_t SMIA4;
    uint32_t RESERVED0[16];
} stc_eth_mac_smiaddr_bit_t;

typedef struct
{
    __IO uint32_t FCA_BPA;
    __IO uint32_t TFE;
    __IO uint32_t RFE;
    __IO uint32_t UNP;
    __IO uint32_t PLT0;
    __IO uint32_t PLT1;
    uint32_t RESERVED0[1];
    __IO uint32_t DZPQ;
    uint32_t RESERVED1[24];
} stc_eth_mac_floctlr_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
    __IO uint32_t VTAL;
    __IO uint32_t VTIM;
    uint32_t RESERVED1[1];
    __IO uint32_t VTHM;
    uint32_t RESERVED2[12];
} stc_eth_mac_vtafltr_bit_t;

typedef struct
{
    __IO uint32_t MREA;
    __IO uint32_t MRS0;
    __IO uint32_t MRS1;
    uint32_t RESERVED0[1];
    __IO uint32_t RFWA;
    __IO uint32_t RFRS0;
    __IO uint32_t RFRS1;
    uint32_t RESERVED1[1];
    __IO uint32_t RFFL0;
    __IO uint32_t RFFL1;
    uint32_t RESERVED2[6];
    __IO uint32_t MTEA;
    __IO uint32_t MTS0;
    __IO uint32_t MTS1;
    __IO uint32_t MTP;
    __IO uint32_t TFRS0;
    __IO uint32_t TFRS1;
    __IO uint32_t TFWA;
    uint32_t RESERVED3[1];
    __IO uint32_t TFNE;
    __IO uint32_t TFF;
    uint32_t RESERVED4[6];
} stc_eth_mac_macstsr_bit_t;

typedef struct
{
    __IO uint32_t PWDN;
    __IO uint32_t MPEN;
    __IO uint32_t WKEN;
    uint32_t RESERVED0[2];
    __IO uint32_t MPFR;
    __IO uint32_t WKFR;
    uint32_t RESERVED1[2];
    __IO uint32_t GLUB;
    __IO uint32_t RTWKTR;
    uint32_t RESERVED2[13];
    __IO uint32_t RTWKPT0;
    __IO uint32_t RTWKPT1;
    __IO uint32_t RTWKPT2;
    uint32_t RESERVED3[4];
    __IO uint32_t RTWKFR;
} stc_eth_mac_pmtctlr_bit_t;

typedef struct
{
    uint32_t RESERVED0[3];
    __IO uint32_t PMTIS;
    __IO uint32_t MMCIS;
    __IO uint32_t MMCRXIS;
    __IO uint32_t MMCTXIS;
    uint32_t RESERVED1[2];
    __IO uint32_t TSPIS;
    uint32_t RESERVED2[22];
} stc_eth_mac_intstsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[3];
    __IO uint32_t PMTIM;
    uint32_t RESERVED1[5];
    __IO uint32_t TSPIM;
    uint32_t RESERVED2[22];
} stc_eth_mac_intmskr_bit_t;

typedef struct
{
    uint32_t RESERVED0[31];
    __IO uint32_t AE0;
} stc_eth_mac_macadhr0_bit_t;

typedef struct
{
    uint32_t RESERVED0[24];
    __IO uint32_t MBC10;
    __IO uint32_t MBC11;
    __IO uint32_t MBC12;
    __IO uint32_t MBC13;
    __IO uint32_t MBC14;
    __IO uint32_t MBC15;
    __IO uint32_t SA1;
    __IO uint32_t AE1;
} stc_eth_mac_macadhr1_bit_t;

typedef struct
{
    uint32_t RESERVED0[24];
    __IO uint32_t MBC20;
    __IO uint32_t MBC21;
    __IO uint32_t MBC22;
    __IO uint32_t MBC23;
    __IO uint32_t MBC24;
    __IO uint32_t MBC25;
    __IO uint32_t SA2;
    __IO uint32_t AE2;
} stc_eth_mac_macadhr2_bit_t;

typedef struct
{
    uint32_t RESERVED0[24];
    __IO uint32_t MBC30;
    __IO uint32_t MBC31;
    __IO uint32_t MBC32;
    __IO uint32_t MBC33;
    __IO uint32_t MBC34;
    __IO uint32_t MBC35;
    __IO uint32_t SA3;
    __IO uint32_t AE3;
} stc_eth_mac_macadhr3_bit_t;

typedef struct
{
    uint32_t RESERVED0[24];
    __IO uint32_t MBC40;
    __IO uint32_t MBC41;
    __IO uint32_t MBC42;
    __IO uint32_t MBC43;
    __IO uint32_t MBC44;
    __IO uint32_t MBC45;
    __IO uint32_t SA4;
    __IO uint32_t AE4;
} stc_eth_mac_macadhr4_bit_t;

typedef struct
{
    __IO uint32_t CRST;
    __IO uint32_t COS;
    __IO uint32_t ROR;
    __IO uint32_t MCF;
    __IO uint32_t MCPSET;
    __IO uint32_t MCPSEL;
    uint32_t RESERVED0[26];
} stc_eth_mmc_mmcctlr_bit_t;

typedef struct
{
    uint32_t RESERVED0[3];
    __IO uint32_t RXBGIS;
    __IO uint32_t RXMGIS;
    __IO uint32_t RXCEIS;
    __IO uint32_t RXAEIS;
    __IO uint32_t RXREIS;
    uint32_t RESERVED1[9];
    __IO uint32_t RXUGIS;
    __IO uint32_t RXLEIS;
    __IO uint32_t RXOEIS;
    uint32_t RESERVED2[12];
} stc_eth_mmc_revstsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t TXBGIS;
    __IO uint32_t TXMGIS;
    uint32_t RESERVED1[12];
    __IO uint32_t TXDEEIS;
    __IO uint32_t TXLCEIS;
    __IO uint32_t TXECEIS;
    __IO uint32_t TXCAEIS;
    uint32_t RESERVED2[1];
    __IO uint32_t TXUGIS;
    __IO uint32_t TXEDEIS;
    uint32_t RESERVED3[9];
} stc_eth_mmc_trsstsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[3];
    __IO uint32_t RXBGIM;
    __IO uint32_t RXMGIM;
    __IO uint32_t RXCEIM;
    __IO uint32_t RXAEIM;
    __IO uint32_t RXREIM;
    uint32_t RESERVED1[9];
    __IO uint32_t RXUGIM;
    __IO uint32_t RXLEIM;
    __IO uint32_t RXOEIM;
    uint32_t RESERVED2[12];
} stc_eth_mmc_ritctlr_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t TXBGIM;
    __IO uint32_t TXMGIM;
    uint32_t RESERVED1[12];
    __IO uint32_t TXDEEIM;
    __IO uint32_t TXLCEIM;
    __IO uint32_t TXECEIM;
    __IO uint32_t TXCAEIM;
    uint32_t RESERVED2[1];
    __IO uint32_t TXUGIM;
    __IO uint32_t TXEDEIM;
    uint32_t RESERVED3[9];
} stc_eth_mmc_titctlr_bit_t;

typedef struct
{
    __IO uint32_t L3PEN;
    uint32_t RESERVED0[1];
    __IO uint32_t L3SAM;
    __IO uint32_t L3SAIM;
    __IO uint32_t L3DAM;
    __IO uint32_t L3DAIM;
    __IO uint32_t L3HSBM0;
    __IO uint32_t L3HSBM1;
    __IO uint32_t L3HSBM2;
    __IO uint32_t L3HSBM3;
    __IO uint32_t L3HSBM4;
    __IO uint32_t L3HDBM0;
    __IO uint32_t L3HDBM1;
    __IO uint32_t L3HDBM2;
    __IO uint32_t L3HDBM3;
    __IO uint32_t L3HDBM4;
    __IO uint32_t L4PEN;
    uint32_t RESERVED1[1];
    __IO uint32_t L4SPM;
    __IO uint32_t L4SPIM;
    __IO uint32_t L4DPM;
    __IO uint32_t L4DPIM;
    uint32_t RESERVED2[10];
} stc_eth_mac_l34ctlr_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
    __IO uint32_t VLANC0;
    __IO uint32_t VLANC1;
    __IO uint32_t VLANS;
    uint32_t RESERVED1[13];
} stc_eth_mac_vtactlr_bit_t;

typedef struct
{
    __IO uint32_t TSPEN;
    __IO uint32_t TSPUPSEL;
    __IO uint32_t TSPINI;
    __IO uint32_t TSPUP;
    __IO uint32_t TSPINT;
    __IO uint32_t TSPADUP;
    uint32_t RESERVED0[2];
    __IO uint32_t TSPEALL;
    __IO uint32_t TSPSSR;
    __IO uint32_t TSPVER;
    __IO uint32_t TSPOVETH;
    __IO uint32_t TSPOVIPV6;
    __IO uint32_t TSPOVIPV4;
    __IO uint32_t TSPMTSEL0;
    __IO uint32_t TSPMTSEL1;
    __IO uint32_t TSPMTSEL2;
    __IO uint32_t TSPMTSEL3;
    __IO uint32_t TSPADF;
    uint32_t RESERVED1[13];
} stc_eth_ptp_tspctlr_bit_t;

typedef struct
{
    uint32_t RESERVED0[31];
    __IO uint32_t TSPUPNS;
} stc_eth_ptp_tmunser_bit_t;

typedef struct
{
    __IO uint32_t TSOVF;
    __IO uint32_t TSTAR0;
    uint32_t RESERVED0[1];
    __IO uint32_t TSERR0;
    __IO uint32_t TSTAR1;
    __IO uint32_t TSERR1;
    uint32_t RESERVED1[26];
} stc_eth_ptp_tspstsr_bit_t;

typedef struct
{
    __IO uint32_t PPSFRE00;
    __IO uint32_t PPSFRE01;
    __IO uint32_t PPSFRE02;
    __IO uint32_t PPSFRE03;
    __IO uint32_t PPSOMD;
    __IO uint32_t TT0SEL0;
    __IO uint32_t TT0SEL1;
    uint32_t RESERVED0[1];
    __IO uint32_t PPSFRE10;
    __IO uint32_t PPSFRE11;
    __IO uint32_t PPSFRE12;
    uint32_t RESERVED1[2];
    __IO uint32_t TT1SEL0;
    __IO uint32_t TT1SEL1;
    uint32_t RESERVED2[17];
} stc_eth_ptp_ppsctlr_bit_t;

typedef struct
{
    __IO uint32_t SWR;
    __IO uint32_t DMAA;
    __IO uint32_t DSL0;
    __IO uint32_t DSL1;
    __IO uint32_t DSL2;
    __IO uint32_t DSL3;
    __IO uint32_t DSL4;
    __IO uint32_t DSEN;
    __IO uint32_t TPBL0;
    __IO uint32_t TPBL1;
    __IO uint32_t TPBL2;
    __IO uint32_t TPBL3;
    __IO uint32_t TPBL4;
    __IO uint32_t TPBL5;
    __IO uint32_t PRAT0;
    __IO uint32_t PRAT1;
    __IO uint32_t FBST;
    __IO uint32_t RPBL0;
    __IO uint32_t RPBL1;
    __IO uint32_t RPBL2;
    __IO uint32_t RPBL3;
    __IO uint32_t RPBL4;
    __IO uint32_t RPBL5;
    __IO uint32_t SPBL;
    __IO uint32_t M8PBL;
    __IO uint32_t AAL;
    __IO uint32_t MBST;
    __IO uint32_t TXPR;
    uint32_t RESERVED0[4];
} stc_eth_dma_busmodr_bit_t;

typedef struct
{
    __IO uint32_t TIS;
    __IO uint32_t TSS;
    __IO uint32_t TUS;
    __IO uint32_t TJS;
    __IO uint32_t OVS;
    __IO uint32_t UNS;
    __IO uint32_t RIS;
    __IO uint32_t RUS;
    __IO uint32_t RSS;
    __IO uint32_t RWS;
    __IO uint32_t ETS;
    uint32_t RESERVED0[2];
    __IO uint32_t FBS;
    __IO uint32_t ERS;
    __IO uint32_t AIS;
    __IO uint32_t NIS;
    __IO uint32_t RSTS0;
    __IO uint32_t RSTS1;
    __IO uint32_t RSTS2;
    __IO uint32_t TSTS0;
    __IO uint32_t TSTS1;
    __IO uint32_t TSTS2;
    __IO uint32_t EBUS0;
    __IO uint32_t EBUS1;
    __IO uint32_t EBUS2;
    uint32_t RESERVED1[1];
    __IO uint32_t MMCS;
    __IO uint32_t PMTS;
    __IO uint32_t PTPS;
    uint32_t RESERVED2[2];
} stc_eth_dma_dmastsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t STR;
    __IO uint32_t OSF;
    __IO uint32_t RTC0;
    __IO uint32_t RTC1;
    __IO uint32_t DGF;
    __IO uint32_t FUF;
    __IO uint32_t FEF;
    uint32_t RESERVED1[5];
    __IO uint32_t STT;
    __IO uint32_t TTC0;
    __IO uint32_t TTC1;
    __IO uint32_t TTC2;
    uint32_t RESERVED2[3];
    __IO uint32_t FTF;
    __IO uint32_t TSF;
    uint32_t RESERVED3[2];
    __IO uint32_t DFRF;
    __IO uint32_t RSF;
    __IO uint32_t DTCOE;
    uint32_t RESERVED4[5];
} stc_eth_dma_oprmodr_bit_t;

typedef struct
{
    __IO uint32_t TIE;
    __IO uint32_t TSE;
    __IO uint32_t TUE;
    __IO uint32_t TJE;
    __IO uint32_t OVE;
    __IO uint32_t UNE;
    __IO uint32_t RIE;
    __IO uint32_t RUE;
    __IO uint32_t RSE;
    __IO uint32_t RWE;
    __IO uint32_t ETE;
    uint32_t RESERVED0[2];
    __IO uint32_t FBE;
    __IO uint32_t ERE;
    __IO uint32_t AIE;
    __IO uint32_t NIE;
    uint32_t RESERVED1[15];
} stc_eth_dma_intenar_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
    __IO uint32_t UNAOVF;
    uint32_t RESERVED1[11];
    __IO uint32_t OVFOVF;
    uint32_t RESERVED2[3];
} stc_eth_dma_rfrcntr_bit_t;

typedef struct
{
    __IO uint32_t START;
    uint32_t RESERVED0[31];
} stc_fcm_str_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t INEXS;
    __IO uint32_t DNFS0;
    __IO uint32_t DNFS1;
    uint32_t RESERVED1[2];
    __IO uint32_t EDGES0;
    __IO uint32_t EDGES1;
    uint32_t RESERVED2[1];
    __IO uint32_t EXREFE;
    uint32_t RESERVED3[16];
} stc_fcm_rccr_bit_t;

typedef struct
{
    __IO uint32_t ERRIE;
    __IO uint32_t MENDIE;
    __IO uint32_t OVFIE;
    uint32_t RESERVED0[1];
    __IO uint32_t ERRINTRS;
    uint32_t RESERVED1[2];
    __IO uint32_t ERRE;
    uint32_t RESERVED2[24];
} stc_fcm_rier_bit_t;

typedef struct
{
    __IO uint32_t ERRF;
    __IO uint32_t MENDF;
    __IO uint32_t OVF;
    uint32_t RESERVED0[29];
} stc_fcm_sr_bit_t;

typedef struct
{
    __IO uint32_t ERRFCLR;
    __IO uint32_t MENDFCLR;
    __IO uint32_t OVFCLR;
    uint32_t RESERVED0[29];
} stc_fcm_clr_bit_t;

typedef struct
{
    __IO uint32_t FMACEN;
    uint32_t RESERVED0[31];
} stc_fmac_enr_bit_t;

typedef struct
{
    __IO uint32_t STAGE_NUM0;
    __IO uint32_t STAGE_NUM1;
    __IO uint32_t STAGE_NUM2;
    __IO uint32_t STAGE_NUM3;
    __IO uint32_t STAGE_NUM4;
    uint32_t RESERVED0[3];
    __IO uint32_t SHIFT0;
    __IO uint32_t SHIFT1;
    __IO uint32_t SHIFT2;
    __IO uint32_t SHIFT3;
    __IO uint32_t SHIFT4;
    uint32_t RESERVED1[19];
} stc_fmac_ctr_bit_t;

typedef struct
{
    __IO uint32_t INTEN;
    uint32_t RESERVED0[31];
} stc_fmac_ier_bit_t;

typedef struct
{
    __IO uint32_t DIN0;
    __IO uint32_t DIN1;
    __IO uint32_t DIN2;
    __IO uint32_t DIN3;
    __IO uint32_t DIN4;
    __IO uint32_t DIN5;
    __IO uint32_t DIN6;
    __IO uint32_t DIN7;
    __IO uint32_t DIN8;
    __IO uint32_t DIN9;
    __IO uint32_t DIN10;
    __IO uint32_t DIN11;
    __IO uint32_t DIN12;
    __IO uint32_t DIN13;
    __IO uint32_t DIN14;
    __IO uint32_t DIN15;
    uint32_t RESERVED0[16];
} stc_fmac_dtr_bit_t;

typedef struct
{
    uint32_t RESERVED0[31];
    __IO uint32_t READY;
} stc_fmac_str_bit_t;

typedef struct
{
    __IO uint32_t CIN00;
    __IO uint32_t CIN01;
    __IO uint32_t CIN02;
    __IO uint32_t CIN03;
    __IO uint32_t CIN04;
    __IO uint32_t CIN05;
    __IO uint32_t CIN06;
    __IO uint32_t CIN07;
    __IO uint32_t CIN08;
    __IO uint32_t CIN09;
    __IO uint32_t CIN010;
    __IO uint32_t CIN011;
    __IO uint32_t CIN012;
    __IO uint32_t CIN013;
    __IO uint32_t CIN014;
    __IO uint32_t CIN015;
    uint32_t RESERVED0[16];
} stc_fmac_cor0_bit_t;

typedef struct
{
    __IO uint32_t CIN10;
    __IO uint32_t CIN11;
    __IO uint32_t CIN12;
    __IO uint32_t CIN13;
    __IO uint32_t CIN14;
    __IO uint32_t CIN15;
    __IO uint32_t CIN16;
    __IO uint32_t CIN17;
    __IO uint32_t CIN18;
    __IO uint32_t CIN19;
    __IO uint32_t CIN110;
    __IO uint32_t CIN111;
    __IO uint32_t CIN112;
    __IO uint32_t CIN113;
    __IO uint32_t CIN114;
    __IO uint32_t CIN115;
    uint32_t RESERVED0[16];
} stc_fmac_cor1_bit_t;

typedef struct
{
    __IO uint32_t CIN20;
    __IO uint32_t CIN21;
    __IO uint32_t CIN22;
    __IO uint32_t CIN23;
    __IO uint32_t CIN24;
    __IO uint32_t CIN25;
    __IO uint32_t CIN26;
    __IO uint32_t CIN27;
    __IO uint32_t CIN28;
    __IO uint32_t CIN29;
    __IO uint32_t CIN210;
    __IO uint32_t CIN211;
    __IO uint32_t CIN212;
    __IO uint32_t CIN213;
    __IO uint32_t CIN214;
    __IO uint32_t CIN215;
    uint32_t RESERVED0[16];
} stc_fmac_cor2_bit_t;

typedef struct
{
    __IO uint32_t CIN30;
    __IO uint32_t CIN31;
    __IO uint32_t CIN32;
    __IO uint32_t CIN33;
    __IO uint32_t CIN34;
    __IO uint32_t CIN35;
    __IO uint32_t CIN36;
    __IO uint32_t CIN37;
    __IO uint32_t CIN38;
    __IO uint32_t CIN39;
    __IO uint32_t CIN310;
    __IO uint32_t CIN311;
    __IO uint32_t CIN312;
    __IO uint32_t CIN313;
    __IO uint32_t CIN314;
    __IO uint32_t CIN315;
    uint32_t RESERVED0[16];
} stc_fmac_cor3_bit_t;

typedef struct
{
    __IO uint32_t CIN40;
    __IO uint32_t CIN41;
    __IO uint32_t CIN42;
    __IO uint32_t CIN43;
    __IO uint32_t CIN44;
    __IO uint32_t CIN45;
    __IO uint32_t CIN46;
    __IO uint32_t CIN47;
    __IO uint32_t CIN48;
    __IO uint32_t CIN49;
    __IO uint32_t CIN410;
    __IO uint32_t CIN411;
    __IO uint32_t CIN412;
    __IO uint32_t CIN413;
    __IO uint32_t CIN414;
    __IO uint32_t CIN415;
    uint32_t RESERVED0[16];
} stc_fmac_cor4_bit_t;

typedef struct
{
    __IO uint32_t CIN50;
    __IO uint32_t CIN51;
    __IO uint32_t CIN52;
    __IO uint32_t CIN53;
    __IO uint32_t CIN54;
    __IO uint32_t CIN55;
    __IO uint32_t CIN56;
    __IO uint32_t CIN57;
    __IO uint32_t CIN58;
    __IO uint32_t CIN59;
    __IO uint32_t CIN510;
    __IO uint32_t CIN511;
    __IO uint32_t CIN512;
    __IO uint32_t CIN513;
    __IO uint32_t CIN514;
    __IO uint32_t CIN515;
    uint32_t RESERVED0[16];
} stc_fmac_cor5_bit_t;

typedef struct
{
    __IO uint32_t CIN60;
    __IO uint32_t CIN61;
    __IO uint32_t CIN62;
    __IO uint32_t CIN63;
    __IO uint32_t CIN64;
    __IO uint32_t CIN65;
    __IO uint32_t CIN66;
    __IO uint32_t CIN67;
    __IO uint32_t CIN68;
    __IO uint32_t CIN69;
    __IO uint32_t CIN610;
    __IO uint32_t CIN611;
    __IO uint32_t CIN612;
    __IO uint32_t CIN613;
    __IO uint32_t CIN614;
    __IO uint32_t CIN615;
    uint32_t RESERVED0[16];
} stc_fmac_cor6_bit_t;

typedef struct
{
    __IO uint32_t CIN70;
    __IO uint32_t CIN71;
    __IO uint32_t CIN72;
    __IO uint32_t CIN73;
    __IO uint32_t CIN74;
    __IO uint32_t CIN75;
    __IO uint32_t CIN76;
    __IO uint32_t CIN77;
    __IO uint32_t CIN78;
    __IO uint32_t CIN79;
    __IO uint32_t CIN710;
    __IO uint32_t CIN711;
    __IO uint32_t CIN712;
    __IO uint32_t CIN713;
    __IO uint32_t CIN714;
    __IO uint32_t CIN715;
    uint32_t RESERVED0[16];
} stc_fmac_cor7_bit_t;

typedef struct
{
    __IO uint32_t CIN80;
    __IO uint32_t CIN81;
    __IO uint32_t CIN82;
    __IO uint32_t CIN83;
    __IO uint32_t CIN84;
    __IO uint32_t CIN85;
    __IO uint32_t CIN86;
    __IO uint32_t CIN87;
    __IO uint32_t CIN88;
    __IO uint32_t CIN89;
    __IO uint32_t CIN810;
    __IO uint32_t CIN811;
    __IO uint32_t CIN812;
    __IO uint32_t CIN813;
    __IO uint32_t CIN814;
    __IO uint32_t CIN815;
    uint32_t RESERVED0[16];
} stc_fmac_cor8_bit_t;

typedef struct
{
    __IO uint32_t CIN90;
    __IO uint32_t CIN91;
    __IO uint32_t CIN92;
    __IO uint32_t CIN93;
    __IO uint32_t CIN94;
    __IO uint32_t CIN95;
    __IO uint32_t CIN96;
    __IO uint32_t CIN97;
    __IO uint32_t CIN98;
    __IO uint32_t CIN99;
    __IO uint32_t CIN910;
    __IO uint32_t CIN911;
    __IO uint32_t CIN912;
    __IO uint32_t CIN913;
    __IO uint32_t CIN914;
    __IO uint32_t CIN915;
    uint32_t RESERVED0[16];
} stc_fmac_cor9_bit_t;

typedef struct
{
    __IO uint32_t CIN100;
    __IO uint32_t CIN101;
    __IO uint32_t CIN102;
    __IO uint32_t CIN103;
    __IO uint32_t CIN104;
    __IO uint32_t CIN105;
    __IO uint32_t CIN106;
    __IO uint32_t CIN107;
    __IO uint32_t CIN108;
    __IO uint32_t CIN109;
    __IO uint32_t CIN1010;
    __IO uint32_t CIN1011;
    __IO uint32_t CIN1012;
    __IO uint32_t CIN1013;
    __IO uint32_t CIN1014;
    __IO uint32_t CIN1015;
    uint32_t RESERVED0[16];
} stc_fmac_cor10_bit_t;

typedef struct
{
    __IO uint32_t CIN110;
    __IO uint32_t CIN111;
    __IO uint32_t CIN112;
    __IO uint32_t CIN113;
    __IO uint32_t CIN114;
    __IO uint32_t CIN115;
    __IO uint32_t CIN116;
    __IO uint32_t CIN117;
    __IO uint32_t CIN118;
    __IO uint32_t CIN119;
    __IO uint32_t CIN1110;
    __IO uint32_t CIN1111;
    __IO uint32_t CIN1112;
    __IO uint32_t CIN1113;
    __IO uint32_t CIN1114;
    __IO uint32_t CIN1115;
    uint32_t RESERVED0[16];
} stc_fmac_cor11_bit_t;

typedef struct
{
    __IO uint32_t CIN120;
    __IO uint32_t CIN121;
    __IO uint32_t CIN122;
    __IO uint32_t CIN123;
    __IO uint32_t CIN124;
    __IO uint32_t CIN125;
    __IO uint32_t CIN126;
    __IO uint32_t CIN127;
    __IO uint32_t CIN128;
    __IO uint32_t CIN129;
    __IO uint32_t CIN1210;
    __IO uint32_t CIN1211;
    __IO uint32_t CIN1212;
    __IO uint32_t CIN1213;
    __IO uint32_t CIN1214;
    __IO uint32_t CIN1215;
    uint32_t RESERVED0[16];
} stc_fmac_cor12_bit_t;

typedef struct
{
    __IO uint32_t CIN130;
    __IO uint32_t CIN131;
    __IO uint32_t CIN132;
    __IO uint32_t CIN133;
    __IO uint32_t CIN134;
    __IO uint32_t CIN135;
    __IO uint32_t CIN136;
    __IO uint32_t CIN137;
    __IO uint32_t CIN138;
    __IO uint32_t CIN139;
    __IO uint32_t CIN1310;
    __IO uint32_t CIN1311;
    __IO uint32_t CIN1312;
    __IO uint32_t CIN1313;
    __IO uint32_t CIN1314;
    __IO uint32_t CIN1315;
    uint32_t RESERVED0[16];
} stc_fmac_cor13_bit_t;

typedef struct
{
    __IO uint32_t CIN140;
    __IO uint32_t CIN141;
    __IO uint32_t CIN142;
    __IO uint32_t CIN143;
    __IO uint32_t CIN144;
    __IO uint32_t CIN145;
    __IO uint32_t CIN146;
    __IO uint32_t CIN147;
    __IO uint32_t CIN148;
    __IO uint32_t CIN149;
    __IO uint32_t CIN1410;
    __IO uint32_t CIN1411;
    __IO uint32_t CIN1412;
    __IO uint32_t CIN1413;
    __IO uint32_t CIN1414;
    __IO uint32_t CIN1415;
    uint32_t RESERVED0[16];
} stc_fmac_cor14_bit_t;

typedef struct
{
    __IO uint32_t CIN150;
    __IO uint32_t CIN151;
    __IO uint32_t CIN152;
    __IO uint32_t CIN153;
    __IO uint32_t CIN154;
    __IO uint32_t CIN155;
    __IO uint32_t CIN156;
    __IO uint32_t CIN157;
    __IO uint32_t CIN158;
    __IO uint32_t CIN159;
    __IO uint32_t CIN1510;
    __IO uint32_t CIN1511;
    __IO uint32_t CIN1512;
    __IO uint32_t CIN1513;
    __IO uint32_t CIN1514;
    __IO uint32_t CIN1515;
    uint32_t RESERVED0[16];
} stc_fmac_cor15_bit_t;

typedef struct
{
    __IO uint32_t CIN160;
    __IO uint32_t CIN161;
    __IO uint32_t CIN162;
    __IO uint32_t CIN163;
    __IO uint32_t CIN164;
    __IO uint32_t CIN165;
    __IO uint32_t CIN166;
    __IO uint32_t CIN167;
    __IO uint32_t CIN168;
    __IO uint32_t CIN169;
    __IO uint32_t CIN1610;
    __IO uint32_t CIN1611;
    __IO uint32_t CIN1612;
    __IO uint32_t CIN1613;
    __IO uint32_t CIN1614;
    __IO uint32_t CIN1615;
    uint32_t RESERVED0[16];
} stc_fmac_cor16_bit_t;

typedef struct
{
    __IO uint32_t PIN00;
    __IO uint32_t PIN01;
    __IO uint32_t PIN02;
    __IO uint32_t PIN03;
    __IO uint32_t PIN04;
    __IO uint32_t PIN05;
    __IO uint32_t PIN06;
    __IO uint32_t PIN07;
    __IO uint32_t PIN08;
    __IO uint32_t PIN09;
    __IO uint32_t PIN10;
    __IO uint32_t PIN11;
    __IO uint32_t PIN12;
    __IO uint32_t PIN13;
    __IO uint32_t PIN14;
    __IO uint32_t PIN15;
} stc_gpio_pidra_bit_t;

typedef struct
{
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    __IO uint32_t POUT02;
    __IO uint32_t POUT03;
    __IO uint32_t POUT04;
    __IO uint32_t POUT05;
    __IO uint32_t POUT06;
    __IO uint32_t POUT07;
    __IO uint32_t POUT08;
    __IO uint32_t POUT09;
    __IO uint32_t POUT10;
    __IO uint32_t POUT11;
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    __IO uint32_t POUT14;
    __IO uint32_t POUT15;
} stc_gpio_podra_bit_t;

