levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    __IO uint32_t SRAM123RWT0;
    __IO uint32_t SRAM123RWT1;
    __IO uint32_t SRAM123RWT2;
    uint32_t RESERVED0[1];
    __IO uint32_t SRAM123WWT0;
    __IO uint32_t SRAM123WWT1;
    __IO uint32_t SRAM123WWT2;
    uint32_t RESERVED1[1];
    __IO uint32_t SRAM4RWT0;
    __IO uint32_t SRAM4RWT1;
    __IO uint32_t SRAM4RWT2;
    uint32_t RESERVED2[1];
    __IO uint32_t SRAM4WWT0;
    __IO uint32_t SRAM4WWT1;
    __IO uint32_t SRAM4WWT2;
    uint32_t RESERVED3[1];
    __IO uint32_t SRAMHRWT0;
    __IO uint32_t SRAMHRWT1;
    __IO uint32_t SRAMHRWT2;
    uint32_t RESERVED4[1];
    __IO uint32_t SRAMHWWT0;
    __IO uint32_t SRAMHWWT1;
    __IO uint32_t SRAMHWWT2;
    uint32_t RESERVED5[1];
    __IO uint32_t SRAMBRWT0;
    __IO uint32_t SRAMBRWT1;
    __IO uint32_t SRAMBRWT2;
    uint32_t RESERVED6[1];
    __IO uint32_t SRAMBWWT0;
    __IO uint32_t SRAMBWWT1;
    __IO uint32_t SRAMBWWT2;
    uint32_t RESERVED7[1];
} stc_sramc_wtcr_bit_t;

typedef struct
{
    __IO uint32_t WTPRC;
    __IO uint32_t WTPRKW0;
    __IO uint32_t WTPRKW1;
    __IO uint32_t WTPRKW2;
    __IO uint32_t WTPRKW3;
    __IO uint32_t WTPRKW4;
    __IO uint32_t WTPRKW5;
    __IO uint32_t WTPRKW6;
    uint32_t RESERVED0[24];
} stc_sramc_wtpr_bit_t;

typedef struct
{
    __IO uint32_t PYOAD;
    uint32_t RESERVED0[15];
    __IO uint32_t ECCOAD;
    __IO uint32_t BECCOAD;
    uint32_t RESERVED1[6];
    __IO uint32_t ECCMOD0;
    __IO uint32_t ECCMOD1;
    __IO uint32_t BECCMOD0;
    __IO uint32_t BECCMOD1;
    uint32_t RESERVED2[4];
} stc_sramc_ckcr_bit_t;

typedef struct
{
    __IO uint32_t CKPRC;
    __IO uint32_t CKPRKW0;
    __IO uint32_t CKPRKW1;
    __IO uint32_t CKPRKW2;
    __IO uint32_t CKPRKW3;
    __IO uint32_t CKPRKW4;
    __IO uint32_t CKPRKW5;
    __IO uint32_t CKPRKW6;
    uint32_t RESERVED0[24];
} stc_sramc_ckpr_bit_t;

typedef struct
{
    __IO uint32_t SRAM1_PYERR;
    __IO uint32_t SRAM2_PYERR;
    __IO uint32_t SRAM3_PYERR;
    __IO uint32_t SRAMH_PYERR;
    __IO uint32_t SRAM4_1ERR;
    __IO uint32_t SRAM4_2ERR;
    __IO uint32_t SRAMB_1ERR;
    __IO uint32_t SRAMB_2ERR;
    __IO uint32_t CACHE_PYERR;
    uint32_t RESERVED0[23];
} stc_sramc_cksr_bit_t;

typedef struct
{
    __IO uint32_t PERI0;
    __IO uint32_t PERI1;
    uint32_t RESERVED0[2];
    __IO uint32_t CKS0;
    __IO uint32_t CKS1;
    __IO uint32_t CKS2;
    __IO uint32_t CKS3;
    __IO uint32_t WDPT0;
    __IO uint32_t WDPT1;
    __IO uint32_t WDPT2;
    __IO uint32_t WDPT3;
    uint32_t RESERVED1[4];
    __IO uint32_t SLPOFF;
    uint32_t RESERVED2[14];
    __IO uint32_t ITS;
} stc_swdt_cr_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
    __IO uint32_t UDF;
    __IO uint32_t REF;
    uint32_t RESERVED1[14];
} stc_swdt_sr_bit_t;

typedef struct
{
    __IO uint32_t CNTA0;
    __IO uint32_t CNTA1;
    __IO uint32_t CNTA2;
    __IO uint32_t CNTA3;
    __IO uint32_t CNTA4;
    __IO uint32_t CNTA5;
    __IO uint32_t CNTA6;
    __IO uint32_t CNTA7;
    __IO uint32_t CNTA8;
    __IO uint32_t CNTA9;
    __IO uint32_t CNTA10;
    __IO uint32_t CNTA11;
    __IO uint32_t CNTA12;
    __IO uint32_t CNTA13;
    __IO uint32_t CNTA14;
    __IO uint32_t CNTA15;
    uint32_t RESERVED0[16];
} stc_tmr0_cntar_bit_t;

typedef struct
{
    __IO uint32_t CNTB0;
    __IO uint32_t CNTB1;
    __IO uint32_t CNTB2;
    __IO uint32_t CNTB3;
    __IO uint32_t CNTB4;
    __IO uint32_t CNTB5;
    __IO uint32_t CNTB6;
    __IO uint32_t CNTB7;
    __IO uint32_t CNTB8;
    __IO uint32_t CNTB9;
    __IO uint32_t CNTB10;
    __IO uint32_t CNTB11;
    __IO uint32_t CNTB12;
    __IO uint32_t CNTB13;
    __IO uint32_t CNTB14;
    __IO uint32_t CNTB15;
    uint32_t RESERVED0[16];
} stc_tmr0_cntbr_bit_t;

typedef struct
{
    __IO uint32_t CMPA0;
    __IO uint32_t CMPA1;
    __IO uint32_t CMPA2;
    __IO uint32_t CMPA3;
    __IO uint32_t CMPA4;
    __IO uint32_t CMPA5;
    __IO uint32_t CMPA6;
    __IO uint32_t CMPA7;
    __IO uint32_t CMPA8;
    __IO uint32_t CMPA9;
    __IO uint32_t CMPA10;
    __IO uint32_t CMPA11;
    __IO uint32_t CMPA12;
    __IO uint32_t CMPA13;
    __IO uint32_t CMPA14;
    __IO uint32_t CMPA15;
    uint32_t RESERVED0[16];
} stc_tmr0_cmpar_bit_t;

typedef struct
{
    __IO uint32_t CMPB0;
    __IO uint32_t CMPB1;
    __IO uint32_t CMPB2;
    __IO uint32_t CMPB3;
    __IO uint32_t CMPB4;
    __IO uint32_t CMPB5;
    __IO uint32_t CMPB6;
    __IO uint32_t CMPB7;
    __IO uint32_t CMPB8;
    __IO uint32_t CMPB9;
    __IO uint32_t CMPB10;
    __IO uint32_t CMPB11;
    __IO uint32_t CMPB12;
    __IO uint32_t CMPB13;
    __IO uint32_t CMPB14;
    __IO uint32_t CMPB15;
    uint32_t RESERVED0[16];
} stc_tmr0_cmpbr_bit_t;

typedef struct
{
    __IO uint32_t CSTA;
    __IO uint32_t CAPMDA;
    __IO uint32_t INTENA;
    uint32_t RESERVED0[5];
    __IO uint32_t SYNSA;
    __IO uint32_t SYNCLKA;
    __IO uint32_t ASYNCLKA;
    uint32_t RESERVED1[1];
    __IO uint32_t HSTAA;
    __IO uint32_t HSTPA;
    __IO uint32_t HCLEA;
    __IO uint32_t HICPA;
    __IO uint32_t CSTB;
    __IO uint32_t CAPMDB;
    __IO uint32_t INTENB;
    uint32_t RESERVED2[5];
    __IO uint32_t SYNSB;
    __IO uint32_t SYNCLKB;
    __IO uint32_t ASYNCLKB;
    uint32_t RESERVED3[1];
    __IO uint32_t HSTAB;
    __IO uint32_t HSTPB;
    __IO uint32_t HCLEB;
    __IO uint32_t HICPB;
} stc_tmr0_bconr_bit_t;

typedef struct
{
    __IO uint32_t CMFA;
    uint32_t RESERVED0[15];
    __IO uint32_t CMFB;
    uint32_t RESERVED1[15];
} stc_tmr0_stflr_bit_t;

typedef struct
{
    __IO uint32_t CNTA0;
    __IO uint32_t CNTA1;
    __IO uint32_t CNTA2;
    __IO uint32_t CNTA3;
    __IO uint32_t CNTA4;
    __IO uint32_t CNTA5;
    __IO uint32_t CNTA6;
    __IO uint32_t CNTA7;
    __IO uint32_t CNTA8;
    __IO uint32_t CNTA9;
    __IO uint32_t CNTA10;
    __IO uint32_t CNTA11;
    __IO uint32_t CNTA12;
    __IO uint32_t CNTA13;
    __IO uint32_t CNTA14;
    __IO uint32_t CNTA15;
    uint32_t RESERVED0[16];
} stc_tmr2_cntar_bit_t;

typedef struct
{
    __IO uint32_t CNTB0;
    __IO uint32_t CNTB1;
    __IO uint32_t CNTB2;
    __IO uint32_t CNTB3;
    __IO uint32_t CNTB4;
    __IO uint32_t CNTB5;
    __IO uint32_t CNTB6;
    __IO uint32_t CNTB7;
    __IO uint32_t CNTB8;
    __IO uint32_t CNTB9;
    __IO uint32_t CNTB10;
    __IO uint32_t CNTB11;
    __IO uint32_t CNTB12;
    __IO uint32_t CNTB13;
    __IO uint32_t CNTB14;
    __IO uint32_t CNTB15;
    uint32_t RESERVED0[16];
} stc_tmr2_cntbr_bit_t;

typedef struct
{
    __IO uint32_t CMPA0;
    __IO uint32_t CMPA1;
    __IO uint32_t CMPA2;
    __IO uint32_t CMPA3;
    __IO uint32_t CMPA4;
    __IO uint32_t CMPA5;
    __IO uint32_t CMPA6;
    __IO uint32_t CMPA7;
    __IO uint32_t CMPA8;
    __IO uint32_t CMPA9;
    __IO uint32_t CMPA10;
    __IO uint32_t CMPA11;
    __IO uint32_t CMPA12;
    __IO uint32_t CMPA13;
    __IO uint32_t CMPA14;
    __IO uint32_t CMPA15;
    uint32_t RESERVED0[16];
} stc_tmr2_cmpar_bit_t;

typedef struct
{
    __IO uint32_t CMPB0;
    __IO uint32_t CMPB1;
    __IO uint32_t CMPB2;
    __IO uint32_t CMPB3;
    __IO uint32_t CMPB4;
    __IO uint32_t CMPB5;
    __IO uint32_t CMPB6;
    __IO uint32_t CMPB7;
    __IO uint32_t CMPB8;
    __IO uint32_t CMPB9;
    __IO uint32_t CMPB10;
    __IO uint32_t CMPB11;
    __IO uint32_t CMPB12;
    __IO uint32_t CMPB13;
    __IO uint32_t CMPB14;
    __IO uint32_t CMPB15;
    uint32_t RESERVED0[16];
} stc_tmr2_cmpbr_bit_t;

typedef struct
{
    __IO uint32_t CSTA;
    __IO uint32_t CAPMDA;
    uint32_t RESERVED0[1];
    __IO uint32_t SYNSA;
    __IO uint32_t CKDIVA0;
    __IO uint32_t CKDIVA1;
    __IO uint32_t CKDIVA2;
    __IO uint32_t CKDIVA3;
    __IO uint32_t SYNCLKA0;
    __IO uint32_t SYNCLKA1;
    __IO uint32_t ASYNCLKA0;
    __IO uint32_t ASYNCLKA1;
    __IO uint32_t SYNCLKAT0;
    __IO uint32_t SYNCLKAT1;
    uint32_t RESERVED1[2];
    __IO uint32_t CSTB;
    __IO uint32_t CAPMDB;
    uint32_t RESERVED2[1];
    __IO uint32_t SYNSB;
    __IO uint32_t CKDIVB0;
    __IO uint32_t CKDIVB1;
    __IO uint32_t CKDIVB2;
    __IO uint32_t CKDIVB3;
    __IO uint32_t SYNCLKB0;
    __IO uint32_t SYNCLKB1;
    __IO uint32_t ASYNCLKB0;
    __IO uint32_t ASYNCLKB1;
    __IO uint32_t SYNCLKBT0;
    __IO uint32_t SYNCLKBT1;
    uint32_t RESERVED3[2];
} stc_tmr2_bconr_bit_t;

typedef struct
{
    __IO uint32_t CMENA;
    __IO uint32_t OVENA;
    uint32_t RESERVED0[14];
    __IO uint32_t CMENB;
    __IO uint32_t OVENB;
    uint32_t RESERVED1[6];
    __IO uint32_t RESV;
    uint32_t RESERVED2[7];
} stc_tmr2_iconr_bit_t;

typedef struct
{
    __IO uint32_t STACA0;
    __IO uint32_t STACA1;
    __IO uint32_t STPCA0;
    __IO uint32_t STPCA1;
    __IO uint32_t CMPCA0;
    __IO uint32_t CMPCA1;
    uint32_t RESERVED0[2];
    __IO uint32_t OUTENA;
    uint32_t RESERVED1[3];
    __IO uint32_t NOFIENA;
    __IO uint32_t NOFICKA0;
    __IO uint32_t NOFICKA1;
    uint32_t RESERVED2[1];
    __IO uint32_t STACB0;
    __IO uint32_t STACB1;
    __IO uint32_t STPCB0;
    __IO uint32_t STPCB1;
    __IO uint32_t CMPCB0;
    __IO uint32_t CMPCB1;
    uint32_t RESERVED3[2];
    __IO uint32_t OUTENB;
    uint32_t RESERVED4[3];
    __IO uint32_t NOFIENB;
    __IO uint32_t NOFICKB0;
    __IO uint32_t NOFICKB1;
    uint32_t RESERVED5[1];
} stc_tmr2_pconr_bit_t;

typedef struct
{
    __IO uint32_t HSTAA0;
    __IO uint32_t HSTAA1;
    __IO uint32_t HSTAA2;
    uint32_t RESERVED0[1];
    __IO uint32_t HSTPA0;
    __IO uint32_t HSTPA1;
    __IO uint32_t HSTPA2;
    uint32_t RESERVED1[1];
    __IO uint32_t HCLEA0;
    __IO uint32_t HCLEA1;
    __IO uint32_t HCLEA2;
    uint32_t RESERVED2[1];
    __IO uint32_t HICPA0;
    __IO uint32_t HICPA1;
    __IO uint32_t HICPA2;
    uint32_t RESERVED3[1];
    __IO uint32_t HSTAB0;
    __IO uint32_t HSTAB1;
    __IO uint32_t HSTAB2;
    uint32_t RESERVED4[1];
    __IO uint32_t HSTPB0;
    __IO uint32_t HSTPB1;
    __IO uint32_t HSTPB2;
    uint32_t RESERVED5[1];
    __IO uint32_t HCLEB0;
    __IO uint32_t HCLEB1;
    __IO uint32_t HCLEB2;
    uint32_t RESERVED6[1];
    __IO uint32_t HICPB0;
    __IO uint32_t HICPB1;
    __IO uint32_t HICPB2;
    uint32_t RESERVED7[1];
} stc_tmr2_hconr_bit_t;

typedef struct
{
    __IO uint32_t CMFA;
    __IO uint32_t OVFA;
    uint32_t RESERVED0[14];
    __IO uint32_t CMFB;
    __IO uint32_t OVFB;
    uint32_t RESERVED1[6];
    __IO uint32_t RESV;
    uint32_t RESERVED2[7];
} stc_tmr2_stflr_bit_t;

typedef struct
{
    __IO uint32_t OCEH;
    __IO uint32_t OCEL;
    __IO uint32_t OCPH;
    __IO uint32_t OCPL;
    __IO uint32_t OCIEH;
    __IO uint32_t OCIEL;
    __IO uint32_t OCFH;
    __IO uint32_t OCFL;
    uint32_t RESERVED0[8];
} stc_tmr4_ocsr_bit_t;

typedef struct
{
    __IO uint32_t CHBUFEN0;
    __IO uint32_t CHBUFEN1;
    __IO uint32_t CLBUFEN0;
    __IO uint32_t CLBUFEN1;
    __IO uint32_t MHBUFEN0;
    __IO uint32_t MHBUFEN1;
    __IO uint32_t MLBUFEN0;
    __IO uint32_t MLBUFEN1;
    __IO uint32_t LMCH;
    __IO uint32_t LMCL;
    __IO uint32_t LMMH;
    __IO uint32_t LMML;
    __IO uint32_t MCECH;
    __IO uint32_t MCECL;
    uint32_t RESERVED0[2];
} stc_tmr4_ocer_bit_t;

typedef struct
{
    __IO uint32_t OCFDCH;
    __IO uint32_t OCFPKH;
    __IO uint32_t OCFUCH;
    __IO uint32_t OCFZRH;
    __IO uint32_t OPDCH0;
    __IO uint32_t OPDCH1;
    __IO uint32_t OPPKH0;
    __IO uint32_t OPPKH1;
    __IO uint32_t OPUCH0;
    __IO uint32_t OPUCH1;
    __IO uint32_t OPZRH0;
    __IO uint32_t OPZRH1;
    __IO uint32_t OPNPKH0;
    __IO uint32_t OPNPKH1;
    __IO uint32_t OPNZRH0;
    __IO uint32_t OPNZRH1;
} stc_tmr4_ocmrh_bit_t;

typedef struct
{
    __IO uint32_t OCFDCL;
    __IO uint32_t OCFPKL;
    __IO uint32_t OCFUCL;
    __IO uint32_t OCFZRL;
    __IO uint32_t OPDCL0;
    __IO uint32_t OPDCL1;
    __IO uint32_t OPPKL0;
    __IO uint32_t OPPKL1;
    __IO uint32_t OPUCL0;
    __IO uint32_t OPUCL1;
    __IO uint32_t OPZRL0;
    __IO uint32_t OPZRL1;
    __IO uint32_t OPNPKL0;
    __IO uint32_t OPNPKL1;
    __IO uint32_t OPNZRL0;
    __IO uint32_t OPNZRL1;
    __IO uint32_t EOPNDCL0;
    __IO uint32_t EOPNDCL1;
    __IO uint32_t EOPNUCL0;
    __IO uint32_t EOPNUCL1;
    __IO uint32_t EOPDCL0;
    __IO uint32_t EOPDCL1;
    __IO uint32_t EOPPKL0;
    __IO uint32_t EOPPKL1;
    __IO uint32_t EOPUCL0;
    __IO uint32_t EOPUCL1;
    __IO uint32_t EOPZRL0;
    __IO uint32_t EOPZRL1;
    __IO uint32_t EOPNPKL0;
    __IO uint32_t EOPNPKL1;
    __IO uint32_t EOPNZRL0;
    __IO uint32_t EOPNZRL1;
} stc_tmr4_ocmrl_bit_t;

typedef struct
{
    __IO uint32_t CKDIV0;
    __IO uint32_t CKDIV1;
    __IO uint32_t CKDIV2;
    __IO uint32_t CKDIV3;
    __IO uint32_t CLEAR;
    __IO uint32_t MODE;
    __IO uint32_t STOP;
    __IO uint32_t BUFEN;
    __IO uint32_t IRQPEN;
    __IO uint32_t IRQPF;
    uint32_t RESERVED0[3];
    __IO uint32_t IRQZEN;
    __IO uint32_t IRQZF;
    __IO uint32_t ECKEN;
} stc_tmr4_ccsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
} stc_tmr4_cvpr_bit_t;

typedef struct
{
    __IO uint32_t DIVCK0;
    __IO uint32_t DIVCK1;
    __IO uint32_t DIVCK2;
    uint32_t RESERVED0[1];
    __IO uint32_t PWMMD0;
    __IO uint32_t PWMMD1;
    __IO uint32_t LVLS0;
    __IO uint32_t LVLS1;
    uint32_t RESERVED1[8];
} stc_tmr4_pocr_bit_t;

typedef struct
{
    __IO uint32_t RTIDU;
    __IO uint32_t RTIDV;
    __IO uint32_t RTIDW;
    uint32_t RESERVED0[1];
    __IO uint32_t RTIFU;
    __IO uint32_t RTICU;
    __IO uint32_t RTEU;
    __IO uint32_t RTSU;
    __IO uint32_t RTIFV;
    __IO uint32_t RTICV;
    __IO uint32_t RTEV;
    __IO uint32_t RTSV;
    __IO uint32_t RTIFW;
    __IO uint32_t RTICW;
    __IO uint32_t RTEW;
    __IO uint32_t RTSW;
} stc_tmr4_rcsr_bit_t;

typedef struct
{
    __IO uint32_t BUFEN0;
    __IO uint32_t BUFEN1;
    __IO uint32_t EVTOS0;
    __IO uint32_t EVTOS1;
    __IO uint32_t EVTOS2;
    __IO uint32_t LMC;
    uint32_t RESERVED0[2];
    __IO uint32_t EVTMS;
    __IO uint32_t EVTDS;
    uint32_t RESERVED1[2];
    __IO uint32_t DEN;
    __IO uint32_t PEN;
    __IO uint32_t UEN;
    __IO uint32_t ZEN;
} stc_tmr4_scsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[6];
    __IO uint32_t MZCE;
    __IO uint32_t MPCE;
    uint32_t RESERVED1[8];
} stc_tmr4_scmr_bit_t;

typedef struct
{
    __IO uint32_t OEUH;
    __IO uint32_t OEUL;
    __IO uint32_t OEVH;
    __IO uint32_t OEVL;
    __IO uint32_t OEWH;
    __IO uint32_t OEWL;
    __IO uint32_t ODT0;
    __IO uint32_t ODT1;
    __IO uint32_t MOE;
    __IO uint32_t AOE;
    uint32_t RESERVED0[6];
    __IO uint32_t OSUH0;
    __IO uint32_t OSUH1;
    __IO uint32_t OSUL0;
    __IO uint32_t OSUL1;
    __IO uint32_t OSVH0;
    __IO uint32_t OSVH1;
    __IO uint32_t OSVL0;
    __IO uint32_t OSVL1;
    __IO uint32_t OSWH0;
    __IO uint32_t OSWH1;
    __IO uint32_t OSWL0;
    __IO uint32_t OSWL1;
    uint32_t RESERVED1[4];
} stc_tmr4_pscr_bit_t;

typedef struct
{
    __IO uint32_t EVTRS0;
    __IO uint32_t EVTRS1;
    __IO uint32_t EVTRS2;
    __IO uint32_t PCTS;
    uint32_t RESERVED0[12];
} stc_tmr4_scer_bit_t;

typedef struct
{
    __IO uint32_t START;
    __IO uint32_t DIR;
    __IO uint32_t MODE;
    uint32_t RESERVED0[1];
    __IO uint32_t CKDIV0;
    __IO uint32_t CKDIV1;
    __IO uint32_t CKDIV2;
    __IO uint32_t CKDIV3;
    __IO uint32_t OVSTP;
    uint32_t RESERVED1[7];
    __IO uint32_t ZMSKREV;
    __IO uint32_t ZMSKPOS;
    __IO uint32_t ZMSKVAL0;
    __IO uint32_t ZMSKVAL1;
    uint32_t RESERVED2[12];
} stc_tmr6_gconr_bit_t;

typedef struct
{
    __IO uint32_t INTENA;
    __IO uint32_t INTENB;
    __IO uint32_t INTENC;
    __IO uint32_t INTEND;
    __IO uint32_t INTENE;
    __IO uint32_t INTENF;
    __IO uint32_t INTENOVF;
    __IO uint32_t INTENUDF;
    __IO uint32_t INTENDTE;
    uint32_t RESERVED0[7];
    __IO uint32_t INTENSAU;
    __IO uint32_t INTENSAD;
    __IO uint32_t INTENSBU;
    __IO uint32_t INTENSBD;
    uint32_t RESERVED1[12];
} stc_tmr6_iconr_bit_t;

typedef struct
{
    __IO uint32_t BENA;
    __IO uint32_t BSEA;
    __IO uint32_t BTRUA;
    __IO uint32_t BTRDA;
    __IO uint32_t BENB;
    __IO uint32_t BSEB;
    __IO uint32_t BTRUB;
    __IO uint32_t BTRDB;
    __IO uint32_t BENP;
    __IO uint32_t BSEP;
    __IO uint32_t BTRUP;
    __IO uint32_t BTRDP;
    uint32_t RESERVED0[4];
    __IO uint32_t BENSPA;
    __IO uint32_t BSESPA;
    __IO uint32_t BTRUSPA;
    __IO uint32_t BTRDSPA;
    __IO uint32_t BENSPB;
    __IO uint32_t BSESPB;
    __IO uint32_t BTRUSPB;
    __IO uint32_t BTRDSPB;
    uint32_t RESERVED1[8];
} stc_tmr6_bconr_bit_t;

typedef struct
{
    __IO uint32_t DTCEN;
    __IO uint32_t SEPA;
    uint32_t RESERVED0[2];
    __IO uint32_t DTBENU;
    __IO uint32_t DTBEND;
    __IO uint32_t DTBTRU;
    __IO uint32_t DTBTRD;
    uint32_t RESERVED1[24];
} stc_tmr6_dconr_bit_t;

typedef struct
{
    __IO uint32_t STACA0;
    __IO uint32_t STACA1;
    __IO uint32_t STPCA0;
    __IO uint32_t STPCA1;
    __IO uint32_t OVFCA0;
    __IO uint32_t OVFCA1;
    __IO uint32_t UDFCA0;
    __IO uint32_t UDFCA1;
    __IO uint32_t CMAUCA0;
    __IO uint32_t CMAUCA1;
    __IO uint32_t CMADCA0;
    __IO uint32_t CMADCA1;
    __IO uint32_t CMBUCA0;
    __IO uint32_t CMBUCA1;
    __IO uint32_t CMBDCA0;
    __IO uint32_t CMBDCA1;
    __IO uint32_t FORCA0;
    __IO uint32_t FORCA1;
    uint32_t RESERVED0[2];
    __IO uint32_t EMBCA0;
    __IO uint32_t EMBCA1;
    __IO uint32_t EMBRA0;
    __IO uint32_t EMBRA1;
    __IO uint32_t EMBSA0;
    __IO uint32_t EMBSA1;
    uint32_t RESERVED1[2];
    __IO uint32_t OUTENA;
    uint32_t RESERVED2[2];
    __IO uint32_t CAPMDA;
} stc_tmr6_pcnar_bit_t;

typedef struct
{
    __IO uint32_t STACB0;
    __IO uint32_t STACB1;
    __IO uint32_t STPCB0;
    __IO uint32_t STPCB1;
    __IO uint32_t OVFCB0;
    __IO uint32_t OVFCB1;
    __IO uint32_t UDFCB0;
    __IO uint32_t UDFCB1;
    __IO uint32_t CMAUCB0;
    __IO uint32_t CMAUCB1;
    __IO uint32_t CMADCB0;
    __IO uint32_t CMADCB1;
    __IO uint32_t CMBUCB0;
    __IO uint32_t CMBUCB1;
    __IO uint32_t CMBDCB0;
    __IO uint32_t CMBDCB1;
    __IO uint32_t FORCB0;
    __IO uint32_t FORCB1;
    uint32_t RESERVED0[2];
    __IO uint32_t EMBCB0;
    __IO uint32_t EMBCB1;
    __IO uint32_t EMBRB0;
    __IO uint32_t EMBRB1;
    __IO uint32_t EMBSB0;
    __IO uint32_t EMBSB1;
    uint32_t RESERVED1[2];
    __IO uint32_t OUTENB;
    uint32_t RESERVED2[2];
    __IO uint32_t CAPMDB;
} stc_tmr6_pcnbr_bit_t;

typedef struct
{
    __IO uint32_t NOFIENGA;
    __IO uint32_t NOFICKGA0;
    __IO uint32_t NOFICKGA1;
    uint32_t RESERVED0[1];
    __IO uint32_t NOFIENGB;
    __IO uint32_t NOFICKGB0;
    __IO uint32_t NOFICKGB1;
    uint32_t RESERVED1[25];
} stc_tmr6_fcngr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
    __IO uint32_t SPPERIA;
    __IO uint32_t SPPERIB;
    uint32_t RESERVED1[6];
    __IO uint32_t PCNTE0;
    __IO uint32_t PCNTE1;
    __IO uint32_t PCNTS0;
    __IO uint32_t PCNTS1;
    __IO uint32_t PCNTS2;
    uint32_t RESERVED2[11];
} stc_tmr6_vperr_bit_t;

typedef struct
{
    __IO uint32_t CMAF;
    __IO uint32_t CMBF;
    __IO uint32_t CMCF;
    __IO uint32_t CMDF;
    __IO uint32_t CMEF;
    __IO uint32_t CMFF;
    __IO uint32_t OVFF;
    __IO uint32_t UDFF;
    __IO uint32_t DTEF;
    __IO uint32_t CMSAUF;
    __IO uint32_t CMSADF;
    __IO uint32_t CMSBUF;
    __IO uint32_t CMSBDF;
    uint32_t RESERVED0[8];
    __IO uint32_t VPERNUM0;
    __IO uint32_t VPERNUM1;
    __IO uint32_t VPERNUM2;
    uint32_t RESERVED1[7];
    __IO uint32_t DIRF;
} stc_tmr6_stflr_bit_t;

typedef struct
{
    __IO uint32_t HSTA0;
    __IO uint32_t HSTA1;
    __IO uint32_t HSTA2;
    __IO uint32_t HSTA3;
    uint32_t RESERVED0[3];
    __IO uint32_t STAS;
    __IO uint32_t HSTA8;
    __IO uint32_t HSTA9;
    __IO uint32_t HSTA10;
    __IO uint32_t HSTA11;
    uint32_t RESERVED1[4];
    __IO uint32_t HSTA16;
    __IO uint32_t HSTA17;
    __IO uint32_t HSTA18;
    __IO uint32_t HSTA19;
    __IO uint32_t HSTA20;
    __IO uint32_t HSTA21;
    __IO uint32_t HSTA22;
    __IO uint32_t HSTA23;
    uint32_t RESERVED2[8];
} stc_tmr6_hstar_bit_t;

typedef struct
{
    __IO uint32_t HSTP0;
    __IO uint32_t HSTP1;
    __IO uint32_t HSTP2;
    __IO uint32_t HSTP3;
    uint32_t RESERVED0[3];
    __IO uint32_t STPS;
    __IO uint32_t HSTP8;
    __IO uint32_t HSTP9;
    __IO uint32_t HSTP10;
    __IO uint32_t HSTP11;
    uint32_t RESERVED1[4];
    __IO uint32_t HSTP16;
    __IO uint32_t HSTP17;
    __IO uint32_t HSTP18;
    __IO uint32_t HSTP19;
    __IO uint32_t HSTP20;
    __IO uint32_t HSTP21;
    __IO uint32_t HSTP22;
    __IO uint32_t HSTP23;
    uint32_t RESERVED2[8];
} stc_tmr6_hstpr_bit_t;

typedef struct
{
    __IO uint32_t HCLE0;
    __IO uint32_t HCLE1;
    __IO uint32_t HCLE2;
    __IO uint32_t HCLE3;
    uint32_t RESERVED0[3];
    __IO uint32_t CLES;
    __IO uint32_t HCLE8;
    __IO uint32_t HCLE9;
    __IO uint32_t HCLE10;
    __IO uint32_t HCLE11;
    uint32_t RESERVED1[4];
    __IO uint32_t HCLE16;
    __IO uint32_t HCLE17;
    __IO uint32_t HCLE18;
    __IO uint32_t HCLE19;
    __IO uint32_t HCLE20;
    __IO uint32_t HCLE21;
    __IO uint32_t HCLE22;
    __IO uint32_t HCLE23;
    uint32_t RESERVED2[8];
} stc_tmr6_hclrr_bit_t;

typedef struct
{
    __IO uint32_t HUPD0;
    __IO uint32_t HUPD1;
    __IO uint32_t HUPD2;
    __IO uint32_t HUPD3;
    uint32_t RESERVED0[3];
    __IO uint32_t UPDS;
    __IO uint32_t HUPD8;
    __IO uint32_t HUPD9;
    __IO uint32_t HUPD10;
    __IO uint32_t HUPD11;
    uint32_t RESERVED1[4];
    __IO uint32_t HUPD16;
    __IO uint32_t HUPD17;
    __IO uint32_t HUPD18;
    __IO uint32_t HUPD19;
    __IO uint32_t HUPD20;
    __IO uint32_t HUPD21;
    __IO uint32_t HUPD22;
    __IO uint32_t HUPD23;
    uint32_t RESERVED2[8];
} stc_tmr6_hupdr_bit_t;

typedef struct
{
    __IO uint32_t HCPA0;
    __IO uint32_t HCPA1;
    __IO uint32_t HCPA2;
    __IO uint32_t HCPA3;
    uint32_t RESERVED0[4];
    __IO uint32_t HCPA8;
    __IO uint32_t HCPA9;
    __IO uint32_t HCPA10;
    __IO uint32_t HCPA11;
    uint32_t RESERVED1[4];
    __IO uint32_t HCPA16;
    __IO uint32_t HCPA17;
    __IO uint32_t HCPA18;
    __IO uint32_t HCPA19;
    __IO uint32_t HCPA20;
    __IO uint32_t HCPA21;
    __IO uint32_t HCPA22;
    __IO uint32_t HCPA23;
    uint32_t RESERVED2[8];
} stc_tmr6_hcpar_bit_t;

typedef struct
{
    __IO uint32_t HCPB0;
    __IO uint32_t HCPB1;
    __IO uint32_t HCPB2;
    __IO uint32_t HCPB3;
    uint32_t RESERVED0[4];
    __IO uint32_t HCPB8;
    __IO uint32_t HCPB9;
    __IO uint32_t HCPB10;
    __IO uint32_t HCPB11;
    uint32_t RESERVED1[4];
    __IO uint32_t HCPB16;
    __IO uint32_t HCPB17;
    __IO uint32_t HCPB18;
    __IO uint32_t HCPB19;
    __IO uint32_t HCPB20;
    __IO uint32_t HCPB21;
    __IO uint32_t HCPB22;
    __IO uint32_t HCPB23;
    uint32_t RESERVED2[8];
} stc_tmr6_hcpbr_bit_t;

typedef struct
{
    __IO uint32_t HCUP0;
    __IO uint32_t HCUP1;
    __IO uint32_t HCUP2;
    __IO uint32_t HCUP3;
    __IO uint32_t HCUP4;
    __IO uint32_t HCUP5;
    __IO uint32_t HCUP6;
    __IO uint32_t HCUP7;
    __IO uint32_t HCUP8;
    __IO uint32_t HCUP9;
    __IO uint32_t HCUP10;
    __IO uint32_t HCUP11;
    uint32_t RESERVED0[4];
    __IO uint32_t HCUP16;
    __IO uint32_t HCUP17;
    __IO uint32_t HCUP18;
    __IO uint32_t HCUP19;
    __IO uint32_t HCUP20;
    __IO uint32_t HCUP21;
    __IO uint32_t HCUP22;
    __IO uint32_t HCUP23;
    uint32_t RESERVED1[8];
} stc_tmr6_hcupr_bit_t;

typedef struct
{
    __IO uint32_t HCDO0;
    __IO uint32_t HCDO1;
    __IO uint32_t HCDO2;
    __IO uint32_t HCDO3;
    __IO uint32_t HCDO4;
    __IO uint32_t HCDO5;
    __IO uint32_t HCDO6;
    __IO uint32_t HCDO7;
    __IO uint32_t HCDO8;
    __IO uint32_t HCDO9;
    __IO uint32_t HCDO10;
    __IO uint32_t HCDO11;
    uint32_t RESERVED0[4];
    __IO uint32_t HCDO16;
    __IO uint32_t HCDO17;
    __IO uint32_t HCDO18;
    __IO uint32_t HCDO19;
    __IO uint32_t HCDO20;
    __IO uint32_t HCDO21;
    __IO uint32_t HCDO22;
    __IO uint32_t HCDO23;
    uint32_t RESERVED1[8];
} stc_tmr6_hcdor_bit_t;

