levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    __IO uint32_t NOFIENTA;
    __IO uint32_t NOFICKTA0;
    __IO uint32_t NOFICKTA1;
    uint32_t RESERVED0[1];
    __IO uint32_t NOFIENTB;
    __IO uint32_t NOFICKTB0;
    __IO uint32_t NOFICKTB1;
    uint32_t RESERVED1[1];
    __IO uint32_t NOFIENTC;
    __IO uint32_t NOFICKTC0;
    __IO uint32_t NOFICKTC1;
    uint32_t RESERVED2[1];
    __IO uint32_t NOFIENTD;
    __IO uint32_t NOFICKTD0;
    __IO uint32_t NOFICKTD1;
    uint32_t RESERVED3[17];
} stc_tmr6_fcntr_bit_t;

typedef struct
{
    __IO uint32_t SSTA1;
    __IO uint32_t SSTA2;
    __IO uint32_t SSTA3;
    __IO uint32_t SSTA4;
    __IO uint32_t SSTA5;
    __IO uint32_t SSTA6;
    __IO uint32_t SSTA7;
    __IO uint32_t SSTA8;
    uint32_t RESERVED0[24];
} stc_tmr6_sstar_bit_t;

typedef struct
{
    __IO uint32_t SSTP1;
    __IO uint32_t SSTP2;
    __IO uint32_t SSTP3;
    __IO uint32_t SSTP4;
    __IO uint32_t SSTP5;
    __IO uint32_t SSTP6;
    __IO uint32_t SSTP7;
    __IO uint32_t SSTP8;
    uint32_t RESERVED0[24];
} stc_tmr6_sstpr_bit_t;

typedef struct
{
    __IO uint32_t SCLE1;
    __IO uint32_t SCLE2;
    __IO uint32_t SCLE3;
    __IO uint32_t SCLE4;
    __IO uint32_t SCLE5;
    __IO uint32_t SCLE6;
    __IO uint32_t SCLE7;
    __IO uint32_t SCLE8;
    uint32_t RESERVED0[24];
} stc_tmr6_sclrr_bit_t;

typedef struct
{
    __IO uint32_t SUPD1;
    __IO uint32_t SUPD2;
    __IO uint32_t SUPD3;
    __IO uint32_t SUPD4;
    __IO uint32_t SUPD5;
    __IO uint32_t SUPD6;
    __IO uint32_t SUPD7;
    __IO uint32_t SUPD8;
    uint32_t RESERVED0[24];
} stc_tmr6_supdr_bit_t;

typedef struct
{
    __IO uint32_t CNT0;
    __IO uint32_t CNT1;
    __IO uint32_t CNT2;
    __IO uint32_t CNT3;
    __IO uint32_t CNT4;
    __IO uint32_t CNT5;
    __IO uint32_t CNT6;
    __IO uint32_t CNT7;
    __IO uint32_t CNT8;
    __IO uint32_t CNT9;
    __IO uint32_t CNT10;
    __IO uint32_t CNT11;
    __IO uint32_t CNT12;
    __IO uint32_t CNT13;
    __IO uint32_t CNT14;
    __IO uint32_t CNT15;
    uint32_t RESERVED0[16];
} stc_tmra_cnter_bit_t;

typedef struct
{
    __IO uint32_t PER0;
    __IO uint32_t PER1;
    __IO uint32_t PER2;
    __IO uint32_t PER3;
    __IO uint32_t PER4;
    __IO uint32_t PER5;
    __IO uint32_t PER6;
    __IO uint32_t PER7;
    __IO uint32_t PER8;
    __IO uint32_t PER9;
    __IO uint32_t PER10;
    __IO uint32_t PER11;
    __IO uint32_t PER12;
    __IO uint32_t PER13;
    __IO uint32_t PER14;
    __IO uint32_t PER15;
    uint32_t RESERVED0[16];
} stc_tmra_perar_bit_t;

typedef struct
{
    __IO uint32_t CMP0;
    __IO uint32_t CMP1;
    __IO uint32_t CMP2;
    __IO uint32_t CMP3;
    __IO uint32_t CMP4;
    __IO uint32_t CMP5;
    __IO uint32_t CMP6;
    __IO uint32_t CMP7;
    __IO uint32_t CMP8;
    __IO uint32_t CMP9;
    __IO uint32_t CMP10;
    __IO uint32_t CMP11;
    __IO uint32_t CMP12;
    __IO uint32_t CMP13;
    __IO uint32_t CMP14;
    __IO uint32_t CMP15;
    uint32_t RESERVED0[16];
} stc_tmra_cmpar1_bit_t;

typedef struct
{
    __IO uint32_t CMP0;
    __IO uint32_t CMP1;
    __IO uint32_t CMP2;
    __IO uint32_t CMP3;
    __IO uint32_t CMP4;
    __IO uint32_t CMP5;
    __IO uint32_t CMP6;
    __IO uint32_t CMP7;
    __IO uint32_t CMP8;
    __IO uint32_t CMP9;
    __IO uint32_t CMP10;
    __IO uint32_t CMP11;
    __IO uint32_t CMP12;
    __IO uint32_t CMP13;
    __IO uint32_t CMP14;
    __IO uint32_t CMP15;
    uint32_t RESERVED0[16];
} stc_tmra_cmpar2_bit_t;

typedef struct
{
    __IO uint32_t CMP0;
    __IO uint32_t CMP1;
    __IO uint32_t CMP2;
    __IO uint32_t CMP3;
    __IO uint32_t CMP4;
    __IO uint32_t CMP5;
    __IO uint32_t CMP6;
    __IO uint32_t CMP7;
    __IO uint32_t CMP8;
    __IO uint32_t CMP9;
    __IO uint32_t CMP10;
    __IO uint32_t CMP11;
    __IO uint32_t CMP12;
    __IO uint32_t CMP13;
    __IO uint32_t CMP14;
    __IO uint32_t CMP15;
    uint32_t RESERVED0[16];
} stc_tmra_cmpar3_bit_t;

typedef struct
{
    __IO uint32_t CMP0;
    __IO uint32_t CMP1;
    __IO uint32_t CMP2;
    __IO uint32_t CMP3;
    __IO uint32_t CMP4;
    __IO uint32_t CMP5;
    __IO uint32_t CMP6;
    __IO uint32_t CMP7;
    __IO uint32_t CMP8;
    __IO uint32_t CMP9;
    __IO uint32_t CMP10;
    __IO uint32_t CMP11;
    __IO uint32_t CMP12;
    __IO uint32_t CMP13;
    __IO uint32_t CMP14;
    __IO uint32_t CMP15;
    uint32_t RESERVED0[16];
} stc_tmra_cmpar4_bit_t;

typedef struct
{
    __IO uint32_t START;
    __IO uint32_t DIR;
    __IO uint32_t MODE;
    __IO uint32_t SYNST;
    __IO uint32_t CKDIV0;
    __IO uint32_t CKDIV1;
    __IO uint32_t CKDIV2;
    __IO uint32_t CKDIV3;
    __IO uint32_t OVSTP;
    uint32_t RESERVED0[3];
    __IO uint32_t ITENOVF;
    __IO uint32_t ITENUDF;
    __IO uint32_t OVFF;
    __IO uint32_t UDFF;
    uint32_t RESERVED1[16];
} stc_tmra_bcstr_bit_t;

typedef struct
{
    __IO uint32_t HSTA0;
    __IO uint32_t HSTA1;
    __IO uint32_t HSTA2;
    uint32_t RESERVED0[1];
    __IO uint32_t HSTP0;
    __IO uint32_t HSTP1;
    __IO uint32_t HSTP2;
    uint32_t RESERVED1[1];
    __IO uint32_t HCLE0;
    __IO uint32_t HCLE1;
    __IO uint32_t HCLE2;
    uint32_t RESERVED2[1];
    __IO uint32_t HCLE3;
    __IO uint32_t HCLE4;
    __IO uint32_t HCLE5;
    __IO uint32_t HCLE6;
    uint32_t RESERVED3[16];
} stc_tmra_hconr_bit_t;

typedef struct
{
    __IO uint32_t HCUP0;
    __IO uint32_t HCUP1;
    __IO uint32_t HCUP2;
    __IO uint32_t HCUP3;
    __IO uint32_t HCUP4;
    __IO uint32_t HCUP5;
    __IO uint32_t HCUP6;
    __IO uint32_t HCUP7;
    __IO uint32_t HCUP8;
    __IO uint32_t HCUP9;
    __IO uint32_t HCUP10;
    __IO uint32_t HCUP11;
    __IO uint32_t HCUP12;
    uint32_t RESERVED0[19];
} stc_tmra_hcupr_bit_t;

typedef struct
{
    __IO uint32_t HCDO0;
    __IO uint32_t HCDO1;
    __IO uint32_t HCDO2;
    __IO uint32_t HCDO3;
    __IO uint32_t HCDO4;
    __IO uint32_t HCDO5;
    __IO uint32_t HCDO6;
    __IO uint32_t HCDO7;
    __IO uint32_t HCDO8;
    __IO uint32_t HCDO9;
    __IO uint32_t HCDO10;
    __IO uint32_t HCDO11;
    __IO uint32_t HCDO12;
    uint32_t RESERVED0[19];
} stc_tmra_hcdor_bit_t;

typedef struct
{
    __IO uint32_t ITEN1;
    __IO uint32_t ITEN2;
    __IO uint32_t ITEN3;
    __IO uint32_t ITEN4;
    uint32_t RESERVED0[28];
} stc_tmra_iconr_bit_t;

typedef struct
{
    __IO uint32_t ETEN1;
    __IO uint32_t ETEN2;
    __IO uint32_t ETEN3;
    __IO uint32_t ETEN4;
    uint32_t RESERVED0[28];
} stc_tmra_econr_bit_t;

typedef struct
{
    __IO uint32_t NOFIENTG;
    __IO uint32_t NOFICKTG0;
    __IO uint32_t NOFICKTG1;
    uint32_t RESERVED0[5];
    __IO uint32_t NOFIENCA;
    __IO uint32_t NOFICKCA0;
    __IO uint32_t NOFICKCA1;
    uint32_t RESERVED1[1];
    __IO uint32_t NOFIENCB;
    __IO uint32_t NOFICKCB0;
    __IO uint32_t NOFICKCB1;
    uint32_t RESERVED2[17];
} stc_tmra_fconr_bit_t;

typedef struct
{
    __IO uint32_t CMPF1;
    __IO uint32_t CMPF2;
    __IO uint32_t CMPF3;
    __IO uint32_t CMPF4;
    uint32_t RESERVED0[28];
} stc_tmra_stflr_bit_t;

typedef struct
{
    __IO uint32_t BEN;
    __IO uint32_t BSE0;
    __IO uint32_t BSE1;
    uint32_t RESERVED0[29];
} stc_tmra_bconr_bit_t;

typedef struct
{
    __IO uint32_t CAPMD;
    uint32_t RESERVED0[3];
    __IO uint32_t HICP0;
    __IO uint32_t HICP1;
    __IO uint32_t HICP2;
    uint32_t RESERVED1[1];
    __IO uint32_t HICP3;
    __IO uint32_t HICP4;
    uint32_t RESERVED2[2];
    __IO uint32_t NOFIENCP;
    __IO uint32_t NOFICKCP0;
    __IO uint32_t NOFICKCP1;
    uint32_t RESERVED3[17];
} stc_tmra_cconr_bit_t;

typedef struct
{
    __IO uint32_t STAC0;
    __IO uint32_t STAC1;
    __IO uint32_t STPC0;
    __IO uint32_t STPC1;
    __IO uint32_t CMPC0;
    __IO uint32_t CMPC1;
    __IO uint32_t PERC0;
    __IO uint32_t PERC1;
    __IO uint32_t FORC0;
    __IO uint32_t FORC1;
    uint32_t RESERVED0[2];
    __IO uint32_t OUTEN;
    uint32_t RESERVED1[19];
} stc_tmra_pconr_bit_t;

typedef struct
{
    __IO uint32_t EN;
    __IO uint32_t RUN;
    uint32_t RESERVED0[30];
} stc_trng_cr_bit_t;

typedef struct
{
    __IO uint32_t LOAD;
    uint32_t RESERVED0[31];
} stc_trng_mr_bit_t;

typedef struct
{
    __IO uint32_t PE;
    __IO uint32_t FE;
    uint32_t RESERVED0[1];
    __IO uint32_t ORE;
    __IO uint32_t BE;
    __IO uint32_t RXNE;
    __IO uint32_t TC;
    __IO uint32_t TXE;
    __IO uint32_t RTOF;
    __IO uint32_t WKUP;
    __IO uint32_t LBD;
    uint32_t RESERVED1[5];
    __IO uint32_t MPB;
    uint32_t RESERVED2[15];
} stc_usart_sr_bit_t;

typedef struct
{
    uint32_t RESERVED0[9];
    __IO uint32_t MPID;
    uint32_t RESERVED1[22];
} stc_usart_dr_bit_t;

typedef struct
{
    __IO uint32_t RTOE;
    __IO uint32_t RTOIE;
    __IO uint32_t RE;
    __IO uint32_t TE;
    __IO uint32_t SLME;
    __IO uint32_t RIE;
    __IO uint32_t TCIE;
    __IO uint32_t TXEIE;
    uint32_t RESERVED0[1];
    __IO uint32_t PS;
    __IO uint32_t PCE;
    uint32_t RESERVED1[1];
    __IO uint32_t M;
    uint32_t RESERVED2[2];
    __IO uint32_t OVER8;
    __IO uint32_t CPE;
    __IO uint32_t CFE;
    __IO uint32_t CNF;
    __IO uint32_t CORE;
    __IO uint32_t CRTOF;
    __IO uint32_t CBE;
    __IO uint32_t CWKUP;
    __IO uint32_t CLBD;
    __IO uint32_t MS;
    uint32_t RESERVED3[3];
    __IO uint32_t ML;
    __IO uint32_t FBME;
    __IO uint32_t NFE;
    __IO uint32_t SBS;
} stc_usart_cr1_bit_t;

typedef struct
{
    __IO uint32_t MPE;
    __IO uint32_t WKUPIE;
    __IO uint32_t BEIE;
    __IO uint32_t BEE;
    __IO uint32_t LBDIE;
    __IO uint32_t LBDL;
    __IO uint32_t SBKL0;
    __IO uint32_t SBKL1;
    __IO uint32_t WKUPE;
    uint32_t RESERVED0[2];
    __IO uint32_t CLKC0;
    __IO uint32_t CLKC1;
    __IO uint32_t STOP;
    __IO uint32_t LINEN;
    uint32_t RESERVED1[1];
    __IO uint32_t SBK;
    __IO uint32_t SBKM;
    uint32_t RESERVED2[14];
} stc_usart_cr2_bit_t;

typedef struct
{
    uint32_t RESERVED0[3];
    __IO uint32_t HDSEL;
    __IO uint32_t LOOP;
    __IO uint32_t SCEN;
    uint32_t RESERVED1[2];
    __IO uint32_t RTSE;
    __IO uint32_t CTSE;
    uint32_t RESERVED2[11];
    __IO uint32_t BCN0;
    __IO uint32_t BCN1;
    __IO uint32_t BCN2;
    uint32_t RESERVED3[8];
} stc_usart_cr3_bit_t;

typedef struct
{
    __IO uint32_t PSC0;
    __IO uint32_t PSC1;
    __IO uint32_t LBMPSC0;
    __IO uint32_t LBMPSC1;
    uint32_t RESERVED0[28];
} stc_usart_pr_bit_t;

typedef struct
{
    __IO uint32_t SESREQSCS;
    __IO uint32_t SESREQ;
    __IO uint32_t VBVALIDOVEN;
    __IO uint32_t VBVALIDOVVAL;
    __IO uint32_t AVALIDOVEN;
    __IO uint32_t AVALIDOVVAL;
    __IO uint32_t BVALIDOVEN;
    __IO uint32_t BVALIDOVVAL;
    __IO uint32_t HSTNEGSCS;
    __IO uint32_t HNPREQ;
    __IO uint32_t HSTSETHNPEN;
    __IO uint32_t DEVHNPEN;
    __IO uint32_t EHEN;
    uint32_t RESERVED0[2];
    __IO uint32_t DBNCEFLTRBYPASS;
    __IO uint32_t CONIDSTS;
    __IO uint32_t DBNCTIME;
    __IO uint32_t ASESVLD;
    __IO uint32_t BSESVLD;
    __IO uint32_t OTGVER;
    __IO uint32_t CURMOD;
    uint32_t RESERVED1[10];
} stc_usbfs_gotgctl_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t SESENDDET;
    uint32_t RESERVED1[5];
    __IO uint32_t SESREQSUCSTSCHNG;
    __IO uint32_t HSTNEGSUCSTSCHNG;
    uint32_t RESERVED2[7];
    __IO uint32_t HSTNEGDET;
    __IO uint32_t ADEVTOUTCHG;
    __IO uint32_t DBNCEDONE;
    uint32_t RESERVED3[12];
} stc_usbfs_gotgint_bit_t;

typedef struct
{
    __IO uint32_t GLBLINTRMSK;
    __IO uint32_t HBSTLEN0;
    __IO uint32_t HBSTLEN1;
    __IO uint32_t HBSTLEN2;
    __IO uint32_t HBSTLEN3;
    __IO uint32_t DMAEN;
    uint32_t RESERVED0[1];
    __IO uint32_t NPTXFEMPLVL;
    __IO uint32_t PTXFEMPLVL;
    uint32_t RESERVED1[12];
    __IO uint32_t REMMEMSUPP;
    __IO uint32_t NOTIALLDMAWRIT;
    __IO uint32_t AHBSINGLE;
    uint32_t RESERVED2[8];
} stc_usbfs_gahbcfg_bit_t;

typedef struct
{
    __IO uint32_t TOUTCAL0;
    __IO uint32_t TOUTCAL1;
    __IO uint32_t TOUTCAL2;
    __IO uint32_t PHYIF;
    uint32_t RESERVED0[1];
    __IO uint32_t FSINTF;
    __IO uint32_t PHYSEL;
    uint32_t RESERVED1[1];
    __IO uint32_t SRPCAP;
    __IO uint32_t HNPCAP;
    __IO uint32_t USBTRDTIM0;
    __IO uint32_t USBTRDTIM1;
    __IO uint32_t USBTRDTIM2;
    __IO uint32_t USBTRDTIM3;
    uint32_t RESERVED2[8];
    __IO uint32_t TERMSELDLPULSE;
    uint32_t RESERVED3[3];
    __IO uint32_t IC_USBCAP;
    uint32_t RESERVED4[1];
    __IO uint32_t TXENDDELAY;
    __IO uint32_t FORCEHSTMODE;
    __IO uint32_t FORCEDEVMODE;
    __IO uint32_t CORRUPTTXPKT;
} stc_usbfs_gusbcfg_bit_t;

typedef struct
{
    __IO uint32_t CSFTRST;
    __IO uint32_t PIUFSSFTRST;
    __IO uint32_t FRMCNTRRST;
    uint32_t RESERVED0[1];
    __IO uint32_t RXFFLSH;
    __IO uint32_t TXFFLSH;
    uint32_t RESERVED1[24];
    __IO uint32_t DMAREQ;
    __IO uint32_t AHBIDLE;
} stc_usbfs_grstctl_bit_t;

typedef struct
{
    __IO uint32_t CURMOD;
    __IO uint32_t MODEMIS;
    __IO uint32_t OTGINT;
    __IO uint32_t SOF;
    __IO uint32_t RXFLVL;
    __IO uint32_t NPTXFEMP;
    __IO uint32_t GINNAKEFF;
    __IO uint32_t GOUTNAKEFF;
    uint32_t RESERVED0[2];
    __IO uint32_t ERLYSUSP;
    __IO uint32_t USBSUSP;
    __IO uint32_t USBRST;
    __IO uint32_t ENUMDONE;
    __IO uint32_t ISOOUTDROP;
    __IO uint32_t EOPF;
    uint32_t RESERVED1[1];
    __IO uint32_t EPMIS;
    __IO uint32_t IEPINT;
    __IO uint32_t OEPINT;
    __IO uint32_t INCOMPISOIN;
    __IO uint32_t INCOMPLP;
    __IO uint32_t FETSUSP;
    __IO uint32_t RESETDET;
    __IO uint32_t PRTINT;
    __IO uint32_t HCHINT;
    __IO uint32_t PTXFEMP;
    __IO uint32_t LPM_INT;
    __IO uint32_t CONIDSTSCHNG;
    __IO uint32_t DISCONNINT;
    __IO uint32_t SESSREQINT;
    __IO uint32_t WKUPINT;
} stc_usbfs_gintsts_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t MODEMISMSK;
    __IO uint32_t OTGINTMSK;
    __IO uint32_t SOFMSK;
    __IO uint32_t RXFLVLMSK;
    __IO uint32_t NPTXFEMPMSK;
    __IO uint32_t GINNAKEFFMSK;
    __IO uint32_t GOUTNAKEFFMSK;
    uint32_t RESERVED1[2];
    __IO uint32_t ERLYSUSPMSK;
    __IO uint32_t USBSUSPMSK;
    __IO uint32_t USBRSTMSK;
    __IO uint32_t ENUMDONEMSK;
    __IO uint32_t ISOOUTDROPMSK;
    __IO uint32_t EOPFMSK;
    uint32_t RESERVED2[1];
    __IO uint32_t EPMISMSK;
    __IO uint32_t IEPINTMSK;
    __IO uint32_t OEPINTMSK;
    uint32_t RESERVED3[1];
    __IO uint32_t INCOMPLPMSK;
    __IO uint32_t FETSUSPMSK;
    __IO uint32_t RESETDETMSK;
    __IO uint32_t PRTINTMSK;
    __IO uint32_t HCHINTMSK;
    __IO uint32_t PTXFEMPMSK;
    __IO uint32_t LPM_INTMSK;
    __IO uint32_t CONIDSTSCHNGMSK;
    __IO uint32_t DISCONNINTMSK;
    __IO uint32_t SESSREQINTMSK;
    __IO uint32_t WKUPINTMSK;
} stc_usbfs_gintmsk_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t DPID0;
    __IO uint32_t DPID1;
    __IO uint32_t PKTSTS0;
    __IO uint32_t PKTSTS1;
    __IO uint32_t PKTSTS2;
    __IO uint32_t PKTSTS3;
    uint32_t RESERVED1[11];
} stc_usbfs_grxstsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t DPID0;
    __IO uint32_t DPID1;
    __IO uint32_t PKTSTS0;
    __IO uint32_t PKTSTS1;
    __IO uint32_t PKTSTS2;
    __IO uint32_t PKTSTS3;
    uint32_t RESERVED1[11];
} stc_usbfs_grxstsp_bit_t;

typedef struct
{
    __IO uint32_t RXFDEP0;
    __IO uint32_t RXFDEP1;
    __IO uint32_t RXFDEP2;
    __IO uint32_t RXFDEP3;
    __IO uint32_t RXFDEP4;
    __IO uint32_t RXFDEP5;
    __IO uint32_t RXFDEP6;
    __IO uint32_t RXFDEP7;
    __IO uint32_t RXFDEP8;
    __IO uint32_t RXFDEP9;
    uint32_t RESERVED0[22];
} stc_usbfs_grxfsiz_bit_t;

typedef struct
{
    uint32_t RESERVED0[24];
    __IO uint32_t NPTXQTOP0;
    __IO uint32_t NPTXQTOP1;
    __IO uint32_t NPTXQTOP2;
    __IO uint32_t NPTXQTOP3;
    __IO uint32_t NPTXQTOP4;
    __IO uint32_t NPTXQTOP5;
    __IO uint32_t NPTXQTOP6;
    uint32_t RESERVED1[1];
} stc_usbfs_gnptxsts_bit_t;

typedef struct
{
    __IO uint32_t LPMCAP;
    __IO uint32_t APPL1RES;
    __IO uint32_t HIRD0;
    __IO uint32_t HIRD1;
    __IO uint32_t HIRD2;
    __IO uint32_t HIRD3;
    __IO uint32_t BREMOTEWAKE;
    __IO uint32_t ENBLSLPM;
    __IO uint32_t HIRD_THRES0;
    __IO uint32_t HIRD_THRES1;
    __IO uint32_t HIRD_THRES2;
    __IO uint32_t HIRD_THRES3;
    __IO uint32_t HIRD_THRES4;
    __IO uint32_t COREL1RES0;
    __IO uint32_t COREL1RES1;
    __IO uint32_t SLPSTS;
    __IO uint32_t L1RESUMEOK;
    uint32_t RESERVED0[7];
    __IO uint32_t SNDLPM;
    uint32_t RESERVED1[3];
    __IO uint32_t LPM_ENBESL;
    __IO uint32_t LPM_RESTORESLPSTS;
    uint32_t RESERVED2[2];
} stc_usbfs_glpmcfg_bit_t;

typedef struct
{
    __IO uint32_t FSLSPCLKSEL0;
    __IO uint32_t FSLSPCLKSEL1;
    __IO uint32_t FSLSSUPP;
    uint32_t RESERVED0[4];
    __IO uint32_t ENA32KHZS;
    uint32_t RESERVED1[23];
    __IO uint32_t MODECHTIMEN;
} stc_usbfs_hcfg_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
    __IO uint32_t HFIRRLDCTRL;
    uint32_t RESERVED1[15];
} stc_usbfs_hfir_bit_t;

typedef struct
{
    uint32_t RESERVED0[24];
    __IO uint32_t PTXQTOP0;
    __IO uint32_t PTXQTOP1;
    __IO uint32_t PTXQTOP2;
    __IO uint32_t PTXQTOP3;
    __IO uint32_t PTXQTOP4;
    __IO uint32_t PTXQTOP5;
    __IO uint32_t PTXQTOP6;
    __IO uint32_t PTXQTOP7;
} stc_usbfs_hptxsts_bit_t;

typedef struct
{
    __IO uint32_t HAINT0;
    __IO uint32_t HAINT1;
    __IO uint32_t HAINT2;
    __IO uint32_t HAINT3;
    __IO uint32_t HAINT4;
    __IO uint32_t HAINT5;
    __IO uint32_t HAINT6;
    __IO uint32_t HAINT7;
    __IO uint32_t HAINT8;
    __IO uint32_t HAINT9;
    __IO uint32_t HAINT10;
    __IO uint32_t HAINT11;
    __IO uint32_t HAINT12;
    __IO uint32_t HAINT13;
    __IO uint32_t HAINT14;
    __IO uint32_t HAINT15;
    uint32_t RESERVED0[16];
} stc_usbfs_haint_bit_t;

typedef struct
{
    __IO uint32_t HAINTMSK0;
    __IO uint32_t HAINTMSK1;
    __IO uint32_t HAINTMSK2;
    __IO uint32_t HAINTMSK3;
    __IO uint32_t HAINTMSK4;
    __IO uint32_t HAINTMSK5;
    __IO uint32_t HAINTMSK6;
    __IO uint32_t HAINTMSK7;
    __IO uint32_t HAINTMSK8;
    __IO uint32_t HAINTMSK9;
    __IO uint32_t HAINTMSK10;
    __IO uint32_t HAINTMSK11;
    __IO uint32_t HAINTMSK12;
    __IO uint32_t HAINTMSK13;
    __IO uint32_t HAINTMSK14;
    __IO uint32_t HAINTMSK15;
    uint32_t RESERVED0[16];
} stc_usbfs_haintmsk_bit_t;

typedef struct
{
    __IO uint32_t PRTCONNSTS;
    __IO uint32_t PRTCONNDET;
    __IO uint32_t PRTENA;
    __IO uint32_t PRTENCHNG;
    __IO uint32_t PRTOVRCURRACT;
    __IO uint32_t PRTOVRCURRCHNG;
    __IO uint32_t PRTRES;
    __IO uint32_t PRTSUSP;
    __IO uint32_t PRTRST;
    uint32_t RESERVED0[1];
    __IO uint32_t PRTLNSTS0;
    __IO uint32_t PRTLNSTS1;
    __IO uint32_t PRTPWR;
    __IO uint32_t PRTTSTCTL0;
    __IO uint32_t PRTTSTCTL1;
    __IO uint32_t PRTTSTCTL2;
    __IO uint32_t PRTTSTCTL3;
    __IO uint32_t PRTSPD0;
    __IO uint32_t PRTSPD1;
    uint32_t RESERVED1[13];
} stc_usbfs_hprt_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    uint32_t RESERVED2[7];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar0_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt0_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint0_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk0_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz0_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar1_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt1_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint1_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk1_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz1_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar2_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt2_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint2_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk2_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz2_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar3_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt3_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint3_bit_t;

