levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk3_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz3_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar4_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt4_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint4_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk4_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz4_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar5_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt5_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint5_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk5_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz5_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar6_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt6_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint6_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk6_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz6_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar7_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt7_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint7_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk7_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz7_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar8_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt8_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint8_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk8_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz8_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar9_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt9_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint9_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk9_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz9_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar10_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt10_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint10_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk10_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz10_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar11_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt11_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint11_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk11_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz11_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar12_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt12_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint12_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk12_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz12_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar13_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt13_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint13_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk13_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz13_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar14_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt14_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint14_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk14_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz14_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t EPDIR;
    uint32_t RESERVED1[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[9];
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbfs_hcchar15_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED1[14];
    __IO uint32_t SPLTENA;
} stc_usbfs_hcsplt15_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbfs_hcint15_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbfs_hcintmsk15_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbfs_hctsiz15_bit_t;

typedef struct
{
    __IO uint32_t DEVSPD0;
    __IO uint32_t DEVSPD1;
    __IO uint32_t NZSTSOUTHSHK;
    __IO uint32_t ENA32KHZSUSP;
    uint32_t RESERVED0[7];
    __IO uint32_t PERFRINT0;
    __IO uint32_t PERFRINT1;
    uint32_t RESERVED1[1];
    __IO uint32_t XCVRDLY;
    __IO uint32_t ERRATICINTMSK;
    uint32_t RESERVED2[8];
    __IO uint32_t PERSCHINTVL0;
    __IO uint32_t PERSCHINTVL1;
    uint32_t RESERVED3[6];
} stc_usbfs_dcfg_bit_t;

typedef struct
{
    __IO uint32_t RMTWKUPSIG;
    __IO uint32_t SFTDISCON;
    __IO uint32_t GNPINNAKSTS;
    __IO uint32_t GOUTNAKSTS;
    __IO uint32_t TSTCTL0;
    __IO uint32_t TSTCTL1;
    __IO uint32_t TSTCTL2;
    __IO uint32_t SGNPINNAK;
    __IO uint32_t CGNPINNAK;
    __IO uint32_t SGOUTNAK;
    __IO uint32_t CGOUTNAK;
    __IO uint32_t PWRONPRGDONE;
    uint32_t RESERVED0[3];
    __IO uint32_t IGNRFRMNUM;
    __IO uint32_t NAKONBBLE;
    uint32_t RESERVED1[1];
    __IO uint32_t DEEPSLEEPBESLREJECT;
    __IO uint32_t SERVINT;
    uint32_t RESERVED2[12];
} stc_usbfs_dctl_bit_t;

typedef struct
{
    __IO uint32_t SUSPSTS;
    __IO uint32_t ENUMSPD0;
    __IO uint32_t ENUMSPD1;
    __IO uint32_t ERRTICERR;
    uint32_t RESERVED0[18];
    __IO uint32_t DEVLNSTS0;
    __IO uint32_t DEVLNSTS1;
    uint32_t RESERVED1[8];
} stc_usbfs_dsts_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t EPDISBLDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t TIMEOUTMSK;
    __IO uint32_t INTKNTXFEMPMSK;
    __IO uint32_t INTKNEPMISMSK;
    __IO uint32_t INEPNAKEFFMSK;
    uint32_t RESERVED0[1];
    __IO uint32_t TXFIFOUNDRNMSK;
    uint32_t RESERVED1[4];
    __IO uint32_t NAKMSK;
    uint32_t RESERVED2[18];
} stc_usbfs_diepmsk_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t EPDISBLDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t SETUPMSK;
    __IO uint32_t OUTTKNEPDISMSK;
    __IO uint32_t STSPHSERCVDMSK;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERRMSK;
    uint32_t RESERVED1[3];
    __IO uint32_t BBLEERRMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t NYETMSK;
    uint32_t RESERVED2[17];
} stc_usbfs_doepmsk_bit_t;

typedef struct
{
    __IO uint32_t INEPINT0;
    __IO uint32_t INEPINT1;
    __IO uint32_t INEPINT2;
    __IO uint32_t INEPINT3;
    __IO uint32_t INEPINT4;
    __IO uint32_t INEPINT5;
    __IO uint32_t INEPINT6;
    __IO uint32_t INEPINT7;
    __IO uint32_t INEPINT8;
    __IO uint32_t INEPINT9;
    __IO uint32_t INEPINT10;
    __IO uint32_t INEPINT11;
    __IO uint32_t INEPINT12;
    __IO uint32_t INEPINT13;
    __IO uint32_t INEPINT14;
    __IO uint32_t INEPINT15;
    __IO uint32_t OUTEPINT0;
    __IO uint32_t OUTEPINT1;
    __IO uint32_t OUTEPINT2;
    __IO uint32_t OUTEPINT3;
    __IO uint32_t OUTEPINT4;
    __IO uint32_t OUTEPINT5;
    __IO uint32_t OUTEPINT6;
    __IO uint32_t OUTEPINT7;
    __IO uint32_t OUTEPINT8;
    __IO uint32_t OUTEPINT9;
    __IO uint32_t OUTEPINT10;
    __IO uint32_t OUTEPINT11;
    __IO uint32_t OUTEPINT12;
    __IO uint32_t OUTEPINT13;
    __IO uint32_t OUTEPINT14;
    __IO uint32_t OUTEPINT15;
} stc_usbfs_daint_bit_t;

typedef struct
{
    __IO uint32_t INEPMSK0;
    __IO uint32_t INEPMSK1;
    __IO uint32_t INEPMSK2;
    __IO uint32_t INEPMSK3;
    __IO uint32_t INEPMSK4;
    __IO uint32_t INEPMSK5;
    __IO uint32_t INEPMSK6;
    __IO uint32_t INEPMSK7;
    __IO uint32_t INEPMSK8;
    __IO uint32_t INEPMSK9;
    __IO uint32_t INEPMSK10;
    __IO uint32_t INEPMSK11;
    __IO uint32_t INEPMSK12;
    __IO uint32_t INEPMSK13;
    __IO uint32_t INEPMSK14;
    __IO uint32_t INEPMSK15;
    __IO uint32_t OUTEPMSK0;
    __IO uint32_t OUTEPMSK1;
    __IO uint32_t OUTEPMSK2;
    __IO uint32_t OUTEPMSK3;
    __IO uint32_t OUTEPMSK4;
    __IO uint32_t OUTEPMSK5;
    __IO uint32_t OUTEPMSK6;
    __IO uint32_t OUTEPMSK7;
    __IO uint32_t OUTEPMSK8;
    __IO uint32_t OUTEPMSK9;
    __IO uint32_t OUTEPMSK10;
    __IO uint32_t OUTEPMSK11;
    __IO uint32_t OUTEPMSK12;
    __IO uint32_t OUTEPMSK13;
    __IO uint32_t OUTEPMSK14;
    __IO uint32_t OUTEPMSK15;
} stc_usbfs_daintmsk_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFEMPMSK0;
    __IO uint32_t INEPTXFEMPMSK1;
    __IO uint32_t INEPTXFEMPMSK2;
    __IO uint32_t INEPTXFEMPMSK3;
    __IO uint32_t INEPTXFEMPMSK4;
    __IO uint32_t INEPTXFEMPMSK5;
    __IO uint32_t INEPTXFEMPMSK6;
    __IO uint32_t INEPTXFEMPMSK7;
    __IO uint32_t INEPTXFEMPMSK8;
    __IO uint32_t INEPTXFEMPMSK9;
    __IO uint32_t INEPTXFEMPMSK10;
    __IO uint32_t INEPTXFEMPMSK11;
    __IO uint32_t INEPTXFEMPMSK12;
    __IO uint32_t INEPTXFEMPMSK13;
    __IO uint32_t INEPTXFEMPMSK14;
    __IO uint32_t INEPTXFEMPMSK15;
    uint32_t RESERVED0[16];
} stc_usbfs_diepempmsk_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    uint32_t RESERVED1[1];
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[1];
    __IO uint32_t STALL;
    uint32_t RESERVED3[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    uint32_t RESERVED4[2];
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl0_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint0_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbfs_dtxfsts0_bit_t;

