levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl1_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint1_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl2_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint2_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl3_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint3_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl4_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint4_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl5_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint5_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl6_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint6_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl7_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint7_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl8_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint8_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl9_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint9_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl10_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint10_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl11_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint11_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl12_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint12_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl13_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint13_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl14_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint14_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_diepctl15_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbfs_diepint15_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    uint32_t RESERVED1[1];
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    uint32_t RESERVED3[2];
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl0_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint0_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl1_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint1_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz1_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl2_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint2_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz2_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl3_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint3_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz3_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl4_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint4_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz4_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl5_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint5_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz5_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl6_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint6_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz6_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl7_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint7_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz7_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl8_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint8_bit_t;

