levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz8_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl9_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint9_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz9_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl10_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint10_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz10_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl11_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint11_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz11_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl12_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint12_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz12_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl13_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint13_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz13_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl14_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint14_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz14_bit_t;

typedef struct
{
    uint32_t RESERVED0[15];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbfs_doepctl15_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbfs_doepint15_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED1[1];
} stc_usbfs_doeptsiz15_bit_t;

typedef struct
{
    __IO uint32_t STOPPCLK;
    __IO uint32_t GATEHCLK;
    __IO uint32_t PWRCLMP;
    __IO uint32_t RSTPDWNMODULE;
    uint32_t RESERVED0[1];
    __IO uint32_t ENBL_L1GATING;
    __IO uint32_t PHYSLEEP;
    __IO uint32_t L1SUSPENDED;
    __IO uint32_t RESETAFTERSUSP;
    uint32_t RESERVED1[23];
} stc_usbfs_pcgcctl_bit_t;

typedef struct
{
    __IO uint32_t SESREQSCS;
    __IO uint32_t SESREQ;
    __IO uint32_t VBVALIDOVEN;
    __IO uint32_t VBVALIDOVVAL;
    __IO uint32_t AVALIDOVEN;
    __IO uint32_t AVALIDOVVAL;
    __IO uint32_t BVALIDOVEN;
    __IO uint32_t BVALIDOVVAL;
    __IO uint32_t HSTNEGSCS;
    __IO uint32_t HNPREQ;
    __IO uint32_t HSTSETHNPEN;
    __IO uint32_t DEVHNPEN;
    __IO uint32_t EHEN;
    uint32_t RESERVED0[2];
    __IO uint32_t DBNCEFLTRBYPASS;
    __IO uint32_t CONIDSTS;
    __IO uint32_t DBNCTIME;
    __IO uint32_t ASESVLD;
    __IO uint32_t BSESVLD;
    __IO uint32_t OTGVER;
    __IO uint32_t CURMOD;
    uint32_t RESERVED1[9];
    __IO uint32_t TESTMODE_CORR_EUSB2;
} stc_usbhs_gotgctl_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t SESENDDET;
    uint32_t RESERVED1[5];
    __IO uint32_t SESREQSUCSTSCHNG;
    __IO uint32_t HSTNEGSUCSTSCHNG;
    uint32_t RESERVED2[7];
    __IO uint32_t HSTNEGDET;
    __IO uint32_t ADEVTOUTCHG;
    __IO uint32_t DBNCEDONE;
    uint32_t RESERVED3[12];
} stc_usbhs_gotgint_bit_t;

typedef struct
{
    __IO uint32_t GLBLINTRMSK;
    __IO uint32_t HBSTLEN0;
    __IO uint32_t HBSTLEN1;
    __IO uint32_t HBSTLEN2;
    __IO uint32_t HBSTLEN3;
    __IO uint32_t DMAEN;
    uint32_t RESERVED0[1];
    __IO uint32_t NPTXFEMPLVL;
    __IO uint32_t PTXFEMPLVL;
    uint32_t RESERVED1[12];
    __IO uint32_t REMMEMSUPP;
    __IO uint32_t NOTIALLDMAWRIT;
    __IO uint32_t AHBSINGLE;
    uint32_t RESERVED2[8];
} stc_usbhs_gahbcfg_bit_t;

typedef struct
{
    __IO uint32_t TOUTCAL0;
    __IO uint32_t TOUTCAL1;
    __IO uint32_t TOUTCAL2;
    __IO uint32_t PHYIF;
    __IO uint32_t ULPI_UTMI_SEL;
    __IO uint32_t FSINTF;
    __IO uint32_t PHYSEL;
    __IO uint32_t DDRSEL;
    __IO uint32_t SRPCAP;
    __IO uint32_t HNPCAP;
    __IO uint32_t USBTRDTIM0;
    __IO uint32_t USBTRDTIM1;
    __IO uint32_t USBTRDTIM2;
    __IO uint32_t USBTRDTIM3;
    uint32_t RESERVED0[3];
    __IO uint32_t ULPIFSLS;
    __IO uint32_t ULPIAUTORES;
    __IO uint32_t ULPICLKSUSM;
    __IO uint32_t ULPIEXTVBUSDRV;
    __IO uint32_t ULPIEXTVBUSINDICATOR;
    __IO uint32_t TERMSELDLPULSE;
    __IO uint32_t COMPLEMENT;
    __IO uint32_t INDICATOR;
    __IO uint32_t ULPI;
    __IO uint32_t IC_USBCAP;
    uint32_t RESERVED1[1];
    __IO uint32_t TXENDDELAY;
    __IO uint32_t FORCEHSTMODE;
    __IO uint32_t FORCEDEVMODE;
    __IO uint32_t CORRUPTTXPKT;
} stc_usbhs_gusbcfg_bit_t;

typedef struct
{
    __IO uint32_t CSFTRST;
    __IO uint32_t PIUFSSFTRST;
    __IO uint32_t FRMCNTRRST;
    uint32_t RESERVED0[1];
    __IO uint32_t RXFFLSH;
    __IO uint32_t TXFFLSH;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t TXFNUM4;
    uint32_t RESERVED1[19];
    __IO uint32_t DMAREQ;
    __IO uint32_t AHBIDLE;
} stc_usbhs_grstctl_bit_t;

typedef struct
{
    __IO uint32_t CURMOD;
    __IO uint32_t MODEMIS;
    __IO uint32_t OTGINT;
    __IO uint32_t SOF;
    __IO uint32_t RXFLVL;
    __IO uint32_t NPTXFEMP;
    __IO uint32_t GINNAKEFF;
    __IO uint32_t GOUTNAKEFF;
    uint32_t RESERVED0[2];
    __IO uint32_t ERLYSUSP;
    __IO uint32_t USBSUSP;
    __IO uint32_t USBRST;
    __IO uint32_t ENUMDONE;
    __IO uint32_t ISOOUTDROP;
    __IO uint32_t EOPF;
    uint32_t RESERVED1[1];
    __IO uint32_t EPMIS;
    __IO uint32_t IEPINT;
    __IO uint32_t OEPINT;
    __IO uint32_t INCOMPISOIN;
    __IO uint32_t INCOMPLP;
    __IO uint32_t FETSUSP;
    __IO uint32_t RESETDET;
    __IO uint32_t PRTINT;
    __IO uint32_t HCHINT;
    __IO uint32_t PTXFEMP;
    __IO uint32_t LPM_INT;
    __IO uint32_t CONIDSTSCHNG;
    __IO uint32_t DISCONNINT;
    __IO uint32_t SESSREQINT;
    __IO uint32_t WKUPINT;
} stc_usbhs_gintsts_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t MODEMISMSK;
    __IO uint32_t OTGINTMSK;
    __IO uint32_t SOFMSK;
    __IO uint32_t RXFLVLMSK;
    __IO uint32_t NPTXFEMPMSK;
    __IO uint32_t GINNAKEFFMSK;
    __IO uint32_t GOUTNAKEFFMSK;
    uint32_t RESERVED1[2];
    __IO uint32_t ERLYSUSPMSK;
    __IO uint32_t USBSUSPMSK;
    __IO uint32_t USBRSTMSK;
    __IO uint32_t ENUMDONEMSK;
    __IO uint32_t ISOOUTDROPMSK;
    __IO uint32_t EOPFMSK;
    uint32_t RESERVED2[1];
    __IO uint32_t EPMISMSK;
    __IO uint32_t IEPINTMSK;
    __IO uint32_t OEPINTMSK;
    uint32_t RESERVED3[1];
    __IO uint32_t INCOMPLPMSK;
    __IO uint32_t FETSUSPMSK;
    __IO uint32_t RESETDETMSK;
    __IO uint32_t PRTINTMSK;
    __IO uint32_t HCHINTMSK;
    __IO uint32_t PTXFEMPMSK;
    __IO uint32_t LPM_INTMSK;
    __IO uint32_t CONIDSTSCHNGMSK;
    __IO uint32_t DISCONNINTMSK;
    __IO uint32_t SESSREQINTMSK;
    __IO uint32_t WKUPINTMSK;
} stc_usbhs_gintmsk_bit_t;

typedef struct
{
    __IO uint32_t CHNUM0;
    __IO uint32_t CHNUM1;
    __IO uint32_t CHNUM2;
    __IO uint32_t CHNUM3;
    __IO uint32_t BCNT0;
    __IO uint32_t BCNT1;
    __IO uint32_t BCNT2;
    __IO uint32_t BCNT3;
    __IO uint32_t BCNT4;
    __IO uint32_t BCNT5;
    __IO uint32_t BCNT6;
    __IO uint32_t BCNT7;
    __IO uint32_t BCNT8;
    __IO uint32_t BCNT9;
    __IO uint32_t BCNT10;
    __IO uint32_t DPID0;
    __IO uint32_t DPID1;
    __IO uint32_t PKTSTS0;
    __IO uint32_t PKTSTS1;
    __IO uint32_t PKTSTS2;
    __IO uint32_t PKTSTS3;
    __IO uint32_t FN0;
    __IO uint32_t FN1;
    __IO uint32_t FN2;
    __IO uint32_t FN3;
    uint32_t RESERVED0[7];
} stc_usbhs_grxstsr_bit_t;

typedef struct
{
    __IO uint32_t CHNUM0;
    __IO uint32_t CHNUM1;
    __IO uint32_t CHNUM2;
    __IO uint32_t CHNUM3;
    __IO uint32_t BCNT0;
    __IO uint32_t BCNT1;
    __IO uint32_t BCNT2;
    __IO uint32_t BCNT3;
    __IO uint32_t BCNT4;
    __IO uint32_t BCNT5;
    __IO uint32_t BCNT6;
    __IO uint32_t BCNT7;
    __IO uint32_t BCNT8;
    __IO uint32_t BCNT9;
    __IO uint32_t BCNT10;
    __IO uint32_t DPID0;
    __IO uint32_t DPID1;
    __IO uint32_t PKTSTS0;
    __IO uint32_t PKTSTS1;
    __IO uint32_t PKTSTS2;
    __IO uint32_t PKTSTS3;
    __IO uint32_t FN0;
    __IO uint32_t FN1;
    __IO uint32_t FN2;
    __IO uint32_t FN3;
    uint32_t RESERVED0[7];
} stc_usbhs_grxstsp_bit_t;

typedef struct
{
    __IO uint32_t RXFDEP0;
    __IO uint32_t RXFDEP1;
    __IO uint32_t RXFDEP2;
    __IO uint32_t RXFDEP3;
    __IO uint32_t RXFDEP4;
    __IO uint32_t RXFDEP5;
    __IO uint32_t RXFDEP6;
    __IO uint32_t RXFDEP7;
    __IO uint32_t RXFDEP8;
    __IO uint32_t RXFDEP9;
    __IO uint32_t RXFDEP10;
    __IO uint32_t RXFDEP11;
    uint32_t RESERVED0[20];
} stc_usbhs_grxfsiz_bit_t;

typedef struct
{
    __IO uint32_t NPTXFSTADDR0;
    __IO uint32_t NPTXFSTADDR1;
    __IO uint32_t NPTXFSTADDR2;
    __IO uint32_t NPTXFSTADDR3;
    __IO uint32_t NPTXFSTADDR4;
    __IO uint32_t NPTXFSTADDR5;
    __IO uint32_t NPTXFSTADDR6;
    __IO uint32_t NPTXFSTADDR7;
    __IO uint32_t NPTXFSTADDR8;
    __IO uint32_t NPTXFSTADDR9;
    __IO uint32_t NPTXFSTADDR10;
    __IO uint32_t NPTXFSTADDR11;
    uint32_t RESERVED0[4];
    __IO uint32_t NPTXFDEP0;
    __IO uint32_t NPTXFDEP1;
    __IO uint32_t NPTXFDEP2;
    __IO uint32_t NPTXFDEP3;
    __IO uint32_t NPTXFDEP4;
    __IO uint32_t NPTXFDEP5;
    __IO uint32_t NPTXFDEP6;
    __IO uint32_t NPTXFDEP7;
    __IO uint32_t NPTXFDEP8;
    __IO uint32_t NPTXFDEP9;
    __IO uint32_t NPTXFDEP10;
    __IO uint32_t NPTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_gnptxfsiz_bit_t;

typedef struct
{
    __IO uint32_t NPTXFSPCAVAIL0;
    __IO uint32_t NPTXFSPCAVAIL1;
    __IO uint32_t NPTXFSPCAVAIL2;
    __IO uint32_t NPTXFSPCAVAIL3;
    __IO uint32_t NPTXFSPCAVAIL4;
    __IO uint32_t NPTXFSPCAVAIL5;
    __IO uint32_t NPTXFSPCAVAIL6;
    __IO uint32_t NPTXFSPCAVAIL7;
    __IO uint32_t NPTXFSPCAVAIL8;
    __IO uint32_t NPTXFSPCAVAIL9;
    __IO uint32_t NPTXFSPCAVAIL10;
    __IO uint32_t NPTXFSPCAVAIL11;
    __IO uint32_t NPTXFSPCAVAIL12;
    __IO uint32_t NPTXFSPCAVAIL13;
    __IO uint32_t NPTXFSPCAVAIL14;
    __IO uint32_t NPTXFSPCAVAIL15;
    __IO uint32_t NPTXQSPCAVAIL0;
    __IO uint32_t NPTXQSPCAVAIL1;
    __IO uint32_t NPTXQSPCAVAIL2;
    __IO uint32_t NPTXQSPCAVAIL3;
    __IO uint32_t NPTXQSPCAVAIL4;
    __IO uint32_t NPTXQSPCAVAIL5;
    __IO uint32_t NPTXQSPCAVAIL6;
    __IO uint32_t NPTXQSPCAVAIL7;
    __IO uint32_t NPTXQTOP0;
    __IO uint32_t NPTXQTOP1;
    __IO uint32_t NPTXQTOP2;
    __IO uint32_t NPTXQTOP3;
    __IO uint32_t NPTXQTOP4;
    __IO uint32_t NPTXQTOP5;
    __IO uint32_t NPTXQTOP6;
    uint32_t RESERVED0[1];
} stc_usbhs_gnptxsts_bit_t;

typedef struct
{
    __IO uint32_t REGDATA0;
    __IO uint32_t REGDATA1;
    __IO uint32_t REGDATA2;
    __IO uint32_t REGDATA3;
    __IO uint32_t REGDATA4;
    __IO uint32_t REGDATA5;
    __IO uint32_t REGDATA6;
    __IO uint32_t REGDATA7;
    __IO uint32_t VCTRL0;
    __IO uint32_t VCTRL1;
    __IO uint32_t VCTRL2;
    __IO uint32_t VCTRL3;
    __IO uint32_t VCTRL4;
    __IO uint32_t VCTRL5;
    __IO uint32_t VCTRL6;
    __IO uint32_t VCTRL7;
    __IO uint32_t REGADDR0;
    __IO uint32_t REGADDR1;
    __IO uint32_t REGADDR2;
    __IO uint32_t REGADDR3;
    __IO uint32_t REGADDR4;
    __IO uint32_t REGADDR5;
    __IO uint32_t REGWR;
    uint32_t RESERVED0[2];
    __IO uint32_t NEWREGREQ;
    __IO uint32_t VSTSBSY;
    __IO uint32_t VSTSDONE;
    uint32_t RESERVED1[4];
} stc_usbhs_gpvndctl_bit_t;

typedef struct
{
    __IO uint32_t LPMCAP;
    __IO uint32_t APPL1RES;
    __IO uint32_t HIRD0;
    __IO uint32_t HIRD1;
    __IO uint32_t HIRD2;
    __IO uint32_t HIRD3;
    __IO uint32_t BREMOTEWAKE;
    __IO uint32_t ENBLSLPM;
    __IO uint32_t HIRD_THRES0;
    __IO uint32_t HIRD_THRES1;
    __IO uint32_t HIRD_THRES2;
    __IO uint32_t HIRD_THRES3;
    __IO uint32_t HIRD_THRES4;
    __IO uint32_t COREL1RES0;
    __IO uint32_t COREL1RES1;
    __IO uint32_t SLPSTS;
    __IO uint32_t L1RESUMEOK;
    __IO uint32_t LPM_CHNL_INDX0;
    __IO uint32_t LPM_CHNL_INDX1;
    __IO uint32_t LPM_CHNL_INDX2;
    __IO uint32_t LPM_CHNL_INDX3;
    __IO uint32_t LPM_RETRY_CNT0;
    __IO uint32_t LPM_RETRY_CNT1;
    __IO uint32_t LPM_RETRY_CNT2;
    __IO uint32_t SNDLPM;
    __IO uint32_t LPM_RETRYCNT_STS0;
    __IO uint32_t LPM_RETRYCNT_STS1;
    __IO uint32_t LPM_RETRYCNT_STS2;
    __IO uint32_t LPM_ENBESL;
    __IO uint32_t LPM_RESTORESLPSTS;
    uint32_t RESERVED0[2];
} stc_usbhs_glpmcfg_bit_t;

typedef struct
{
    __IO uint32_t GDFIFOCFG0;
    __IO uint32_t GDFIFOCFG1;
    __IO uint32_t GDFIFOCFG2;
    __IO uint32_t GDFIFOCFG3;
    __IO uint32_t GDFIFOCFG4;
    __IO uint32_t GDFIFOCFG5;
    __IO uint32_t GDFIFOCFG6;
    __IO uint32_t GDFIFOCFG7;
    __IO uint32_t GDFIFOCFG8;
    __IO uint32_t GDFIFOCFG9;
    __IO uint32_t GDFIFOCFG10;
    __IO uint32_t GDFIFOCFG11;
    __IO uint32_t GDFIFOCFG12;
    __IO uint32_t GDFIFOCFG13;
    __IO uint32_t GDFIFOCFG14;
    __IO uint32_t GDFIFOCFG15;
    __IO uint32_t EPINFOBASEADDR0;
    __IO uint32_t EPINFOBASEADDR1;
    __IO uint32_t EPINFOBASEADDR2;
    __IO uint32_t EPINFOBASEADDR3;
    __IO uint32_t EPINFOBASEADDR4;
    __IO uint32_t EPINFOBASEADDR5;
    __IO uint32_t EPINFOBASEADDR6;
    __IO uint32_t EPINFOBASEADDR7;
    __IO uint32_t EPINFOBASEADDR8;
    __IO uint32_t EPINFOBASEADDR9;
    __IO uint32_t EPINFOBASEADDR10;
    __IO uint32_t EPINFOBASEADDR11;
    __IO uint32_t EPINFOBASEADDR12;
    __IO uint32_t EPINFOBASEADDR13;
    __IO uint32_t EPINFOBASEADDR14;
    __IO uint32_t EPINFOBASEADDR15;
} stc_usbhs_gdfifocfg_bit_t;

typedef struct
{
    __IO uint32_t PTXFSTADDR0;
    __IO uint32_t PTXFSTADDR1;
    __IO uint32_t PTXFSTADDR2;
    __IO uint32_t PTXFSTADDR3;
    __IO uint32_t PTXFSTADDR4;
    __IO uint32_t PTXFSTADDR5;
    __IO uint32_t PTXFSTADDR6;
    __IO uint32_t PTXFSTADDR7;
    __IO uint32_t PTXFSTADDR8;
    __IO uint32_t PTXFSTADDR9;
    __IO uint32_t PTXFSTADDR10;
    __IO uint32_t PTXFSTADDR11;
    __IO uint32_t PTXFSTADDR12;
    uint32_t RESERVED0[3];
    __IO uint32_t PTXFSIZE0;
    __IO uint32_t PTXFSIZE1;
    __IO uint32_t PTXFSIZE2;
    __IO uint32_t PTXFSIZE3;
    __IO uint32_t PTXFSIZE4;
    __IO uint32_t PTXFSIZE5;
    __IO uint32_t PTXFSIZE6;
    __IO uint32_t PTXFSIZE7;
    __IO uint32_t PTXFSIZE8;
    __IO uint32_t PTXFSIZE9;
    __IO uint32_t PTXFSIZE10;
    __IO uint32_t PTXFSIZE11;
    uint32_t RESERVED1[4];
} stc_usbhs_hptxfsiz_bit_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    uint32_t RESERVED0[3];
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_dieptxf1_bit_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    uint32_t RESERVED0[3];
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_dieptxf2_bit_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    __IO uint32_t INEPNTXFSTADDR13;
    uint32_t RESERVED0[2];
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_dieptxf3_bit_t;

