levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    __IO uint32_t INEPNTXFSTADDR13;
    uint32_t RESERVED0[2];
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_dieptxf4_bit_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    __IO uint32_t INEPNTXFSTADDR13;
    uint32_t RESERVED0[2];
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_dieptxf5_bit_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    __IO uint32_t INEPNTXFSTADDR13;
    uint32_t RESERVED0[2];
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_dieptxf6_bit_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    __IO uint32_t INEPNTXFSTADDR13;
    __IO uint32_t INEPNTXFSTADDR14;
    uint32_t RESERVED0[1];
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_dieptxf7_bit_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    __IO uint32_t INEPNTXFSTADDR13;
    __IO uint32_t INEPNTXFSTADDR14;
    uint32_t RESERVED0[1];
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_dieptxf8_bit_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    __IO uint32_t INEPNTXFSTADDR13;
    __IO uint32_t INEPNTXFSTADDR14;
    uint32_t RESERVED0[1];
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_dieptxf9_bit_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    __IO uint32_t INEPNTXFSTADDR13;
    __IO uint32_t INEPNTXFSTADDR14;
    uint32_t RESERVED0[1];
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_dieptxf10_bit_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    __IO uint32_t INEPNTXFSTADDR13;
    __IO uint32_t INEPNTXFSTADDR14;
    uint32_t RESERVED0[1];
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_dieptxf11_bit_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    __IO uint32_t INEPNTXFSTADDR13;
    __IO uint32_t INEPNTXFSTADDR14;
    uint32_t RESERVED0[1];
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_dieptxf12_bit_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    __IO uint32_t INEPNTXFSTADDR13;
    __IO uint32_t INEPNTXFSTADDR14;
    uint32_t RESERVED0[1];
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_dieptxf13_bit_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    __IO uint32_t INEPNTXFSTADDR13;
    __IO uint32_t INEPNTXFSTADDR14;
    uint32_t RESERVED0[1];
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED1[4];
} stc_usbhs_dieptxf14_bit_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR0;
    __IO uint32_t INEPNTXFSTADDR1;
    __IO uint32_t INEPNTXFSTADDR2;
    __IO uint32_t INEPNTXFSTADDR3;
    __IO uint32_t INEPNTXFSTADDR4;
    __IO uint32_t INEPNTXFSTADDR5;
    __IO uint32_t INEPNTXFSTADDR6;
    __IO uint32_t INEPNTXFSTADDR7;
    __IO uint32_t INEPNTXFSTADDR8;
    __IO uint32_t INEPNTXFSTADDR9;
    __IO uint32_t INEPNTXFSTADDR10;
    __IO uint32_t INEPNTXFSTADDR11;
    __IO uint32_t INEPNTXFSTADDR12;
    __IO uint32_t INEPNTXFSTADDR13;
    __IO uint32_t INEPNTXFSTADDR14;
    __IO uint32_t INEPNTXFSTADDR15;
    __IO uint32_t INEPNTXFDEP0;
    __IO uint32_t INEPNTXFDEP1;
    __IO uint32_t INEPNTXFDEP2;
    __IO uint32_t INEPNTXFDEP3;
    __IO uint32_t INEPNTXFDEP4;
    __IO uint32_t INEPNTXFDEP5;
    __IO uint32_t INEPNTXFDEP6;
    __IO uint32_t INEPNTXFDEP7;
    __IO uint32_t INEPNTXFDEP8;
    __IO uint32_t INEPNTXFDEP9;
    __IO uint32_t INEPNTXFDEP10;
    __IO uint32_t INEPNTXFDEP11;
    uint32_t RESERVED0[4];
} stc_usbhs_dieptxf15_bit_t;

typedef struct
{
    __IO uint32_t FSLSPCLKSEL0;
    __IO uint32_t FSLSPCLKSEL1;
    __IO uint32_t FSLSSUPP;
    uint32_t RESERVED0[4];
    __IO uint32_t ENA32KHZS;
    __IO uint32_t RESVALID0;
    __IO uint32_t RESVALID1;
    __IO uint32_t RESVALID2;
    __IO uint32_t RESVALID3;
    __IO uint32_t RESVALID4;
    __IO uint32_t RESVALID5;
    __IO uint32_t RESVALID6;
    __IO uint32_t RESVALID7;
    uint32_t RESERVED1[15];
    __IO uint32_t MODECHTIMEN;
} stc_usbhs_hcfg_bit_t;

typedef struct
{
    __IO uint32_t FRINT0;
    __IO uint32_t FRINT1;
    __IO uint32_t FRINT2;
    __IO uint32_t FRINT3;
    __IO uint32_t FRINT4;
    __IO uint32_t FRINT5;
    __IO uint32_t FRINT6;
    __IO uint32_t FRINT7;
    __IO uint32_t FRINT8;
    __IO uint32_t FRINT9;
    __IO uint32_t FRINT10;
    __IO uint32_t FRINT11;
    __IO uint32_t FRINT12;
    __IO uint32_t FRINT13;
    __IO uint32_t FRINT14;
    __IO uint32_t FRINT15;
    __IO uint32_t HFIRRLDCTRL;
    uint32_t RESERVED0[15];
} stc_usbhs_hfir_bit_t;

typedef struct
{
    __IO uint32_t FRNUM0;
    __IO uint32_t FRNUM1;
    __IO uint32_t FRNUM2;
    __IO uint32_t FRNUM3;
    __IO uint32_t FRNUM4;
    __IO uint32_t FRNUM5;
    __IO uint32_t FRNUM6;
    __IO uint32_t FRNUM7;
    __IO uint32_t FRNUM8;
    __IO uint32_t FRNUM9;
    __IO uint32_t FRNUM10;
    __IO uint32_t FRNUM11;
    __IO uint32_t FRNUM12;
    __IO uint32_t FRNUM13;
    __IO uint32_t FRNUM14;
    __IO uint32_t FRNUM15;
    __IO uint32_t FRREM0;
    __IO uint32_t FRREM1;
    __IO uint32_t FRREM2;
    __IO uint32_t FRREM3;
    __IO uint32_t FRREM4;
    __IO uint32_t FRREM5;
    __IO uint32_t FRREM6;
    __IO uint32_t FRREM7;
    __IO uint32_t FRREM8;
    __IO uint32_t FRREM9;
    __IO uint32_t FRREM10;
    __IO uint32_t FRREM11;
    __IO uint32_t FRREM12;
    __IO uint32_t FRREM13;
    __IO uint32_t FRREM14;
    __IO uint32_t FRREM15;
} stc_usbhs_hfnum_bit_t;

typedef struct
{
    __IO uint32_t PTXFSPCAVAIL0;
    __IO uint32_t PTXFSPCAVAIL1;
    __IO uint32_t PTXFSPCAVAIL2;
    __IO uint32_t PTXFSPCAVAIL3;
    __IO uint32_t PTXFSPCAVAIL4;
    __IO uint32_t PTXFSPCAVAIL5;
    __IO uint32_t PTXFSPCAVAIL6;
    __IO uint32_t PTXFSPCAVAIL7;
    __IO uint32_t PTXFSPCAVAIL8;
    __IO uint32_t PTXFSPCAVAIL9;
    __IO uint32_t PTXFSPCAVAIL10;
    __IO uint32_t PTXFSPCAVAIL11;
    __IO uint32_t PTXFSPCAVAIL12;
    __IO uint32_t PTXFSPCAVAIL13;
    __IO uint32_t PTXFSPCAVAIL14;
    __IO uint32_t PTXFSPCAVAIL15;
    __IO uint32_t PTXQSPCAVAIL0;
    __IO uint32_t PTXQSPCAVAIL1;
    __IO uint32_t PTXQSPCAVAIL2;
    __IO uint32_t PTXQSPCAVAIL3;
    __IO uint32_t PTXQSPCAVAIL4;
    __IO uint32_t PTXQSPCAVAIL5;
    __IO uint32_t PTXQSPCAVAIL6;
    __IO uint32_t PTXQSPCAVAIL7;
    __IO uint32_t PTXQTOP0;
    __IO uint32_t PTXQTOP1;
    __IO uint32_t PTXQTOP2;
    __IO uint32_t PTXQTOP3;
    __IO uint32_t PTXQTOP4;
    __IO uint32_t PTXQTOP5;
    __IO uint32_t PTXQTOP6;
    __IO uint32_t PTXQTOP7;
} stc_usbhs_hptxsts_bit_t;

typedef struct
{
    __IO uint32_t HAINT0;
    __IO uint32_t HAINT1;
    __IO uint32_t HAINT2;
    __IO uint32_t HAINT3;
    __IO uint32_t HAINT4;
    __IO uint32_t HAINT5;
    __IO uint32_t HAINT6;
    __IO uint32_t HAINT7;
    __IO uint32_t HAINT8;
    __IO uint32_t HAINT9;
    __IO uint32_t HAINT10;
    __IO uint32_t HAINT11;
    __IO uint32_t HAINT12;
    __IO uint32_t HAINT13;
    __IO uint32_t HAINT14;
    __IO uint32_t HAINT15;
    uint32_t RESERVED0[16];
} stc_usbhs_haint_bit_t;

typedef struct
{
    __IO uint32_t HAINTMSK0;
    __IO uint32_t HAINTMSK1;
    __IO uint32_t HAINTMSK2;
    __IO uint32_t HAINTMSK3;
    __IO uint32_t HAINTMSK4;
    __IO uint32_t HAINTMSK5;
    __IO uint32_t HAINTMSK6;
    __IO uint32_t HAINTMSK7;
    __IO uint32_t HAINTMSK8;
    __IO uint32_t HAINTMSK9;
    __IO uint32_t HAINTMSK10;
    __IO uint32_t HAINTMSK11;
    __IO uint32_t HAINTMSK12;
    __IO uint32_t HAINTMSK13;
    __IO uint32_t HAINTMSK14;
    __IO uint32_t HAINTMSK15;
    uint32_t RESERVED0[16];
} stc_usbhs_haintmsk_bit_t;

typedef struct
{
    __IO uint32_t PRTCONNSTS;
    __IO uint32_t PRTCONNDET;
    __IO uint32_t PRTENA;
    __IO uint32_t PRTENCHNG;
    __IO uint32_t PRTOVRCURRACT;
    __IO uint32_t PRTOVRCURRCHNG;
    __IO uint32_t PRTRES;
    __IO uint32_t PRTSUSP;
    __IO uint32_t PRTRST;
    uint32_t RESERVED0[1];
    __IO uint32_t PRTLNSTS0;
    __IO uint32_t PRTLNSTS1;
    __IO uint32_t PRTPWR;
    __IO uint32_t PRTTSTCTL0;
    __IO uint32_t PRTTSTCTL1;
    __IO uint32_t PRTTSTCTL2;
    __IO uint32_t PRTTSTCTL3;
    __IO uint32_t PRTSPD0;
    __IO uint32_t PRTSPD1;
    uint32_t RESERVED1[13];
} stc_usbhs_hprt_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar0_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt0_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint0_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk0_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz0_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar1_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt1_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint1_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk1_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz1_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar2_bit_t;

