levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt2_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint2_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk2_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz2_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar3_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt3_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint3_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk3_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz3_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar4_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt4_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint4_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk4_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz4_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar5_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt5_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint5_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk5_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz5_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar6_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt6_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint6_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk6_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz6_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar7_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt7_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint7_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk7_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz7_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar8_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt8_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint8_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk8_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz8_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar9_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt9_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint9_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk9_bit_t;

