levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz9_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar10_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt10_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint10_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk10_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz10_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar11_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt11_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint11_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk11_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz11_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar12_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt12_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint12_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk12_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz12_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar13_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt13_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint13_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk13_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz13_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar14_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt14_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint14_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk14_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz14_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    __IO uint32_t EPNUM0;
    __IO uint32_t EPNUM1;
    __IO uint32_t EPNUM2;
    __IO uint32_t EPNUM3;
    __IO uint32_t EPDIR;
    uint32_t RESERVED0[1];
    __IO uint32_t LSPDDEV;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t EC0;
    __IO uint32_t EC1;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t ODDFRM;
    __IO uint32_t CHDIS;
    __IO uint32_t CHENA;
} stc_usbhs_hcchar15_bit_t;

typedef struct
{
    __IO uint32_t PRTADDR0;
    __IO uint32_t PRTADDR1;
    __IO uint32_t PRTADDR2;
    __IO uint32_t PRTADDR3;
    __IO uint32_t PRTADDR4;
    __IO uint32_t PRTADDR5;
    __IO uint32_t PRTADDR6;
    __IO uint32_t HUBADDR0;
    __IO uint32_t HUBADDR1;
    __IO uint32_t HUBADDR2;
    __IO uint32_t HUBADDR3;
    __IO uint32_t HUBADDR4;
    __IO uint32_t HUBADDR5;
    __IO uint32_t HUBADDR6;
    __IO uint32_t XACTPOS0;
    __IO uint32_t XACTPOS1;
    __IO uint32_t COMPSPLT;
    uint32_t RESERVED0[14];
    __IO uint32_t SPLTENA;
} stc_usbhs_hcsplt15_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t CHHLTD;
    __IO uint32_t AHBERR;
    __IO uint32_t STALL;
    __IO uint32_t NAK;
    __IO uint32_t ACK;
    __IO uint32_t NYET;
    __IO uint32_t XACTERR;
    __IO uint32_t BBLERR;
    __IO uint32_t FRMOVRUN;
    __IO uint32_t DATATGLERR;
    uint32_t RESERVED0[21];
} stc_usbhs_hcint15_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t CHHLTDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t STALLMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t ACKMSK;
    __IO uint32_t NYETMSK;
    __IO uint32_t XACTERRMSK;
    __IO uint32_t BBLERRMSK;
    __IO uint32_t FRMOVRUNMSK;
    __IO uint32_t DATATGLERRMSK;
    uint32_t RESERVED0[21];
} stc_usbhs_hcintmsk15_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t PID0;
    __IO uint32_t PID1;
    __IO uint32_t DOPNG;
} stc_usbhs_hctsiz15_bit_t;

typedef struct
{
    __IO uint32_t DEVSPD0;
    __IO uint32_t DEVSPD1;
    __IO uint32_t NZSTSOUTHSHK;
    __IO uint32_t ENA32KHZSUSP;
    __IO uint32_t DEVADDR0;
    __IO uint32_t DEVADDR1;
    __IO uint32_t DEVADDR2;
    __IO uint32_t DEVADDR3;
    __IO uint32_t DEVADDR4;
    __IO uint32_t DEVADDR5;
    __IO uint32_t DEVADDR6;
    __IO uint32_t PERFRINT0;
    __IO uint32_t PERFRINT1;
    uint32_t RESERVED0[1];
    __IO uint32_t XCVRDLY;
    __IO uint32_t ERRATICINTMSK;
    uint32_t RESERVED1[1];
    __IO uint32_t IPGISOCSUPT;
    uint32_t RESERVED2[6];
    __IO uint32_t PERSCHINTVL0;
    __IO uint32_t PERSCHINTVL1;
    __IO uint32_t RESVALID0;
    __IO uint32_t RESVALID1;
    __IO uint32_t RESVALID2;
    __IO uint32_t RESVALID3;
    __IO uint32_t RESVALID4;
    __IO uint32_t RESVALID5;
} stc_usbhs_dcfg_bit_t;

typedef struct
{
    __IO uint32_t RMTWKUPSIG;
    __IO uint32_t SFTDISCON;
    __IO uint32_t GNPINNAKSTS;
    __IO uint32_t GOUTNAKSTS;
    __IO uint32_t TSTCTL0;
    __IO uint32_t TSTCTL1;
    __IO uint32_t TSTCTL2;
    __IO uint32_t SGNPINNAK;
    __IO uint32_t CGNPINNAK;
    __IO uint32_t SGOUTNAK;
    __IO uint32_t CGOUTNAK;
    __IO uint32_t PWRONPRGDONE;
    uint32_t RESERVED0[3];
    __IO uint32_t IGNRFRMNUM;
    __IO uint32_t NAKONBBLE;
    uint32_t RESERVED1[1];
    __IO uint32_t DEEPSLEEPBESLREJECT;
    __IO uint32_t SERVINT;
    uint32_t RESERVED2[12];
} stc_usbhs_dctl_bit_t;

typedef struct
{
    __IO uint32_t SUSPSTS;
    __IO uint32_t ENUMSPD0;
    __IO uint32_t ENUMSPD1;
    __IO uint32_t ERRTICERR;
    uint32_t RESERVED0[4];
    __IO uint32_t SOFFN0;
    __IO uint32_t SOFFN1;
    __IO uint32_t SOFFN2;
    __IO uint32_t SOFFN3;
    __IO uint32_t SOFFN4;
    __IO uint32_t SOFFN5;
    __IO uint32_t SOFFN6;
    __IO uint32_t SOFFN7;
    __IO uint32_t SOFFN8;
    __IO uint32_t SOFFN9;
    __IO uint32_t SOFFN10;
    __IO uint32_t SOFFN11;
    __IO uint32_t SOFFN12;
    __IO uint32_t SOFFN13;
    __IO uint32_t DEVLNSTS0;
    __IO uint32_t DEVLNSTS1;
    uint32_t RESERVED1[8];
} stc_usbhs_dsts_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t EPDISBLDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t TIMEOUTMSK;
    __IO uint32_t INTKNTXFEMPMSK;
    __IO uint32_t INTKNEPMISMSK;
    __IO uint32_t INEPNAKEFFMSK;
    uint32_t RESERVED0[1];
    __IO uint32_t TXFIFOUNDRNMSK;
    uint32_t RESERVED1[4];
    __IO uint32_t NAKMSK;
    uint32_t RESERVED2[18];
} stc_usbhs_diepmsk_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t EPDISBLDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t SETUPMSK;
    __IO uint32_t OUTTKNEPDISMSK;
    __IO uint32_t STSPHSERCVDMSK;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERRMSK;
    uint32_t RESERVED1[3];
    __IO uint32_t BBLEERRMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t NYETMSK;
    uint32_t RESERVED2[17];
} stc_usbhs_doepmsk_bit_t;

typedef struct
{
    __IO uint32_t INEPINT0;
    __IO uint32_t INEPINT1;
    __IO uint32_t INEPINT2;
    __IO uint32_t INEPINT3;
    __IO uint32_t INEPINT4;
    __IO uint32_t INEPINT5;
    __IO uint32_t INEPINT6;
    __IO uint32_t INEPINT7;
    __IO uint32_t INEPINT8;
    __IO uint32_t INEPINT9;
    __IO uint32_t INEPINT10;
    __IO uint32_t INEPINT11;
    __IO uint32_t INEPINT12;
    __IO uint32_t INEPINT13;
    __IO uint32_t INEPINT14;
    __IO uint32_t INEPINT15;
    __IO uint32_t OUTEPINT0;
    __IO uint32_t OUTEPINT1;
    __IO uint32_t OUTEPINT2;
    __IO uint32_t OUTEPINT3;
    __IO uint32_t OUTEPINT4;
    __IO uint32_t OUTEPINT5;
    __IO uint32_t OUTEPINT6;
    __IO uint32_t OUTEPINT7;
    __IO uint32_t OUTEPINT8;
    __IO uint32_t OUTEPINT9;
    __IO uint32_t OUTEPINT10;
    __IO uint32_t OUTEPINT11;
    __IO uint32_t OUTEPINT12;
    __IO uint32_t OUTEPINT13;
    __IO uint32_t OUTEPINT14;
    __IO uint32_t OUTEPINT15;
} stc_usbhs_daint_bit_t;

