levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    __IO uint32_t INEPMSK0;
    __IO uint32_t INEPMSK1;
    __IO uint32_t INEPMSK2;
    __IO uint32_t INEPMSK3;
    __IO uint32_t INEPMSK4;
    __IO uint32_t INEPMSK5;
    __IO uint32_t INEPMSK6;
    __IO uint32_t INEPMSK7;
    __IO uint32_t INEPMSK8;
    __IO uint32_t INEPMSK9;
    __IO uint32_t INEPMSK10;
    __IO uint32_t INEPMSK11;
    __IO uint32_t INEPMSK12;
    __IO uint32_t INEPMSK13;
    __IO uint32_t INEPMSK14;
    __IO uint32_t INEPMSK15;
    __IO uint32_t OUTEPMSK0;
    __IO uint32_t OUTEPMSK1;
    __IO uint32_t OUTEPMSK2;
    __IO uint32_t OUTEPMSK3;
    __IO uint32_t OUTEPMSK4;
    __IO uint32_t OUTEPMSK5;
    __IO uint32_t OUTEPMSK6;
    __IO uint32_t OUTEPMSK7;
    __IO uint32_t OUTEPMSK8;
    __IO uint32_t OUTEPMSK9;
    __IO uint32_t OUTEPMSK10;
    __IO uint32_t OUTEPMSK11;
    __IO uint32_t OUTEPMSK12;
    __IO uint32_t OUTEPMSK13;
    __IO uint32_t OUTEPMSK14;
    __IO uint32_t OUTEPMSK15;
} stc_usbhs_daintmsk_bit_t;

typedef struct
{
    __IO uint32_t NONISOTHREN;
    __IO uint32_t ISOTHREN;
    __IO uint32_t TXTHRLEN0;
    __IO uint32_t TXTHRLEN1;
    __IO uint32_t TXTHRLEN2;
    __IO uint32_t TXTHRLEN3;
    __IO uint32_t TXTHRLEN4;
    __IO uint32_t TXTHRLEN5;
    __IO uint32_t TXTHRLEN6;
    __IO uint32_t TXTHRLEN7;
    __IO uint32_t TXTHRLEN8;
    __IO uint32_t AHBTHRRATIO0;
    __IO uint32_t AHBTHRRATIO1;
    uint32_t RESERVED0[3];
    __IO uint32_t RXTHREN;
    __IO uint32_t RXTHRLEN0;
    __IO uint32_t RXTHRLEN1;
    __IO uint32_t RXTHRLEN2;
    __IO uint32_t RXTHRLEN3;
    __IO uint32_t RXTHRLEN4;
    __IO uint32_t RXTHRLEN5;
    __IO uint32_t RXTHRLEN6;
    __IO uint32_t RXTHRLEN7;
    __IO uint32_t RXTHRLEN8;
    uint32_t RESERVED1[1];
    __IO uint32_t ARBPRKEN;
    uint32_t RESERVED2[4];
} stc_usbhs_dthrctl_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFEMPMSK0;
    __IO uint32_t INEPTXFEMPMSK1;
    __IO uint32_t INEPTXFEMPMSK2;
    __IO uint32_t INEPTXFEMPMSK3;
    __IO uint32_t INEPTXFEMPMSK4;
    __IO uint32_t INEPTXFEMPMSK5;
    __IO uint32_t INEPTXFEMPMSK6;
    __IO uint32_t INEPTXFEMPMSK7;
    __IO uint32_t INEPTXFEMPMSK8;
    __IO uint32_t INEPTXFEMPMSK9;
    __IO uint32_t INEPTXFEMPMSK10;
    __IO uint32_t INEPTXFEMPMSK11;
    __IO uint32_t INEPTXFEMPMSK12;
    __IO uint32_t INEPTXFEMPMSK13;
    __IO uint32_t INEPTXFEMPMSK14;
    __IO uint32_t INEPTXFEMPMSK15;
    uint32_t RESERVED0[16];
} stc_usbhs_diepempmsk_bit_t;

typedef struct
{
    __IO uint32_t ECHINEPINT0;
    __IO uint32_t ECHINEPINT1;
    __IO uint32_t ECHINEPINT2;
    __IO uint32_t ECHINEPINT3;
    __IO uint32_t ECHINEPINT4;
    __IO uint32_t ECHINEPINT5;
    __IO uint32_t ECHINEPINT6;
    __IO uint32_t ECHINEPINT7;
    __IO uint32_t ECHINEPINT8;
    __IO uint32_t ECHINEPINT9;
    __IO uint32_t ECHINEPINT10;
    __IO uint32_t ECHINEPINT11;
    __IO uint32_t ECHINEPINT12;
    __IO uint32_t ECHINEPINT13;
    __IO uint32_t ECHINEPINT14;
    __IO uint32_t ECHINEPINT15;
    __IO uint32_t ECHOUTEPINT0;
    __IO uint32_t ECHOUTEPINT1;
    __IO uint32_t ECHOUTEPINT2;
    __IO uint32_t ECHOUTEPINT3;
    __IO uint32_t ECHOUTEPINT4;
    __IO uint32_t ECHOUTEPINT5;
    __IO uint32_t ECHOUTEPINT6;
    __IO uint32_t ECHOUTEPINT7;
    __IO uint32_t ECHOUTEPINT8;
    __IO uint32_t ECHOUTEPINT9;
    __IO uint32_t ECHOUTEPINT10;
    __IO uint32_t ECHOUTEPINT11;
    __IO uint32_t ECHOUTEPINT12;
    __IO uint32_t ECHOUTEPINT13;
    __IO uint32_t ECHOUTEPINT14;
    __IO uint32_t ECHOUTEPINT15;
} stc_usbhs_deachint_bit_t;

typedef struct
{
    __IO uint32_t ECHINEPMSK0;
    __IO uint32_t ECHINEPMSK1;
    __IO uint32_t ECHINEPMSK2;
    __IO uint32_t ECHINEPMSK3;
    __IO uint32_t ECHINEPMSK4;
    __IO uint32_t ECHINEPMSK5;
    __IO uint32_t ECHINEPMSK6;
    __IO uint32_t ECHINEPMSK7;
    __IO uint32_t ECHINEPMSK8;
    __IO uint32_t ECHINEPMSK9;
    __IO uint32_t ECHINEPMSK10;
    __IO uint32_t ECHINEPMSK11;
    __IO uint32_t ECHINEPMSK12;
    __IO uint32_t ECHINEPMSK13;
    __IO uint32_t ECHINEPMSK14;
    __IO uint32_t ECHINEPMSK15;
    __IO uint32_t ECHOUTEPMSK0;
    __IO uint32_t ECHOUTEPMSK1;
    __IO uint32_t ECHOUTEPMSK2;
    __IO uint32_t ECHOUTEPMSK3;
    __IO uint32_t ECHOUTEPMSK4;
    __IO uint32_t ECHOUTEPMSK5;
    __IO uint32_t ECHOUTEPMSK6;
    __IO uint32_t ECHOUTEPMSK7;
    __IO uint32_t ECHOUTEPMSK8;
    __IO uint32_t ECHOUTEPMSK9;
    __IO uint32_t ECHOUTEPMSK10;
    __IO uint32_t ECHOUTEPMSK11;
    __IO uint32_t ECHOUTEPMSK12;
    __IO uint32_t ECHOUTEPMSK13;
    __IO uint32_t ECHOUTEPMSK14;
    __IO uint32_t ECHOUTEPMSK15;
} stc_usbhs_deachintmsk_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t EPDISBLDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t TIMEOUTMSK;
    __IO uint32_t INTKNTXFEMPMSK;
    __IO uint32_t INTKNEPMISMSK;
    __IO uint32_t INEPNAKEFFMSK;
    uint32_t RESERVED0[1];
    __IO uint32_t TXFIFOUNDRNMSK;
    uint32_t RESERVED1[4];
    __IO uint32_t NAKMSK;
    uint32_t RESERVED2[18];
} stc_usbhs_diepeachmsk1_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPLMSK;
    __IO uint32_t EPDISBLDMSK;
    __IO uint32_t AHBERRMSK;
    __IO uint32_t SETUPMSK;
    __IO uint32_t OUTTKNEPDISMSK;
    __IO uint32_t STSPHSRCVDMSK;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERRMSK;
    uint32_t RESERVED1[3];
    __IO uint32_t BBLEERRMSK;
    __IO uint32_t NAKMSK;
    __IO uint32_t NYETMSK;
    uint32_t RESERVED2[17];
} stc_usbhs_doepeachmsk1_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    uint32_t RESERVED0[13];
    __IO uint32_t USBACTEP;
    uint32_t RESERVED1[1];
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED2[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    uint32_t RESERVED3[2];
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl0_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint0_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    uint32_t RESERVED0[12];
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    uint32_t RESERVED1[11];
} stc_usbhs_dieptsiz0_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts0_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl1_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint1_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz1_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts1_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl2_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint2_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz2_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts2_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl3_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint3_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz3_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts3_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl4_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint4_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz4_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts4_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl5_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint5_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz5_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts5_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl6_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint6_bit_t;

