levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz6_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts6_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl7_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint7_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz7_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts7_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl8_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint8_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz8_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts8_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl9_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint9_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz9_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts9_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl10_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint10_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz10_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts10_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl11_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint11_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz11_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts11_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl12_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint12_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz12_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts12_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl13_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint13_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz13_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts13_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl14_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint14_bit_t;

