levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz14_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts14_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    uint32_t RESERVED1[1];
    __IO uint32_t STALL;
    __IO uint32_t TXFNUM0;
    __IO uint32_t TXFNUM1;
    __IO uint32_t TXFNUM2;
    __IO uint32_t TXFNUM3;
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_diepctl15_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t TIMEOUT;
    __IO uint32_t INTKNTXFEMP;
    __IO uint32_t INTKNEPMIS;
    __IO uint32_t INEPNAKEFF;
    __IO uint32_t TXFEMP;
    __IO uint32_t TXFIFOUNDRN;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED0[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    uint32_t RESERVED1[17];
} stc_usbhs_diepint15_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t MC0;
    __IO uint32_t MC1;
    uint32_t RESERVED0[1];
} stc_usbhs_dieptsiz15_bit_t;

typedef struct
{
    __IO uint32_t INEPTXFSPCAVAIL0;
    __IO uint32_t INEPTXFSPCAVAIL1;
    __IO uint32_t INEPTXFSPCAVAIL2;
    __IO uint32_t INEPTXFSPCAVAIL3;
    __IO uint32_t INEPTXFSPCAVAIL4;
    __IO uint32_t INEPTXFSPCAVAIL5;
    __IO uint32_t INEPTXFSPCAVAIL6;
    __IO uint32_t INEPTXFSPCAVAIL7;
    __IO uint32_t INEPTXFSPCAVAIL8;
    __IO uint32_t INEPTXFSPCAVAIL9;
    __IO uint32_t INEPTXFSPCAVAIL10;
    __IO uint32_t INEPTXFSPCAVAIL11;
    __IO uint32_t INEPTXFSPCAVAIL12;
    __IO uint32_t INEPTXFSPCAVAIL13;
    __IO uint32_t INEPTXFSPCAVAIL14;
    __IO uint32_t INEPTXFSPCAVAIL15;
    uint32_t RESERVED0[16];
} stc_usbhs_dtxfsts15_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    uint32_t RESERVED0[13];
    __IO uint32_t USBACTEP;
    uint32_t RESERVED1[1];
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED2[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    uint32_t RESERVED3[2];
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl0_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint0_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    uint32_t RESERVED0[12];
    __IO uint32_t PKTCNT;
    uint32_t RESERVED1[9];
    __IO uint32_t SUPCNT0;
    __IO uint32_t SUPCNT1;
    uint32_t RESERVED2[1];
} stc_usbhs_doeptsiz0_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl1_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint1_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz1_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl2_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint2_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz2_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl3_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint3_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz3_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl4_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint4_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz4_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl5_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint5_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz5_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl6_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint6_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz6_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl7_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint7_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz7_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl8_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint8_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz8_bit_t;

