levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl9_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint9_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz9_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl10_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint10_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz10_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl11_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint11_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz11_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl12_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint12_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz12_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl13_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint13_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz13_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl14_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint14_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz14_bit_t;

typedef struct
{
    __IO uint32_t MPS0;
    __IO uint32_t MPS1;
    __IO uint32_t MPS2;
    __IO uint32_t MPS3;
    __IO uint32_t MPS4;
    __IO uint32_t MPS5;
    __IO uint32_t MPS6;
    __IO uint32_t MPS7;
    __IO uint32_t MPS8;
    __IO uint32_t MPS9;
    __IO uint32_t MPS10;
    uint32_t RESERVED0[4];
    __IO uint32_t USBACTEP;
    __IO uint32_t DPID;
    __IO uint32_t NAKSTS;
    __IO uint32_t EPTYPE0;
    __IO uint32_t EPTYPE1;
    __IO uint32_t SNP;
    __IO uint32_t STALL;
    uint32_t RESERVED1[4];
    __IO uint32_t CNAK;
    __IO uint32_t SNAK;
    __IO uint32_t SETD0PID;
    __IO uint32_t SETD1PID;
    __IO uint32_t EPDIS;
    __IO uint32_t EPENA;
} stc_usbhs_doepctl15_bit_t;

typedef struct
{
    __IO uint32_t XFERCOMPL;
    __IO uint32_t EPDISBLD;
    __IO uint32_t AHBERR;
    __IO uint32_t SETUP;
    __IO uint32_t OUTTKNEPDIS;
    __IO uint32_t STSPHSERCVD;
    __IO uint32_t BACK2BACKSETUP;
    uint32_t RESERVED0[1];
    __IO uint32_t OUTPKTERR;
    __IO uint32_t BNAINTR;
    uint32_t RESERVED1[1];
    __IO uint32_t PKTDRPSTS;
    __IO uint32_t BBLEERR;
    __IO uint32_t NAKINTRPT;
    __IO uint32_t NYETINTRPT;
    __IO uint32_t STUPPKTRCVD;
    uint32_t RESERVED2[16];
} stc_usbhs_doepint15_bit_t;

typedef struct
{
    __IO uint32_t XFERSIZE0;
    __IO uint32_t XFERSIZE1;
    __IO uint32_t XFERSIZE2;
    __IO uint32_t XFERSIZE3;
    __IO uint32_t XFERSIZE4;
    __IO uint32_t XFERSIZE5;
    __IO uint32_t XFERSIZE6;
    __IO uint32_t XFERSIZE7;
    __IO uint32_t XFERSIZE8;
    __IO uint32_t XFERSIZE9;
    __IO uint32_t XFERSIZE10;
    __IO uint32_t XFERSIZE11;
    __IO uint32_t XFERSIZE12;
    __IO uint32_t XFERSIZE13;
    __IO uint32_t XFERSIZE14;
    __IO uint32_t XFERSIZE15;
    __IO uint32_t XFERSIZE16;
    __IO uint32_t XFERSIZE17;
    __IO uint32_t XFERSIZE18;
    __IO uint32_t PKTCNT0;
    __IO uint32_t PKTCNT1;
    __IO uint32_t PKTCNT2;
    __IO uint32_t PKTCNT3;
    __IO uint32_t PKTCNT4;
    __IO uint32_t PKTCNT5;
    __IO uint32_t PKTCNT6;
    __IO uint32_t PKTCNT7;
    __IO uint32_t PKTCNT8;
    __IO uint32_t PKTCNT9;
    __IO uint32_t RXDPID0;
    __IO uint32_t RXDPID1;
    uint32_t RESERVED0[1];
} stc_usbhs_doeptsiz15_bit_t;

typedef struct
{
    __IO uint32_t STOPPCLK;
    __IO uint32_t GATEHCLK;
    __IO uint32_t PWRCLMP;
    __IO uint32_t RSTPDWNMODULE;
    uint32_t RESERVED0[1];
    __IO uint32_t ENBL_L1GATING;
    __IO uint32_t PHYSLEEP;
    __IO uint32_t L1SUSPENDED;
    __IO uint32_t RESETAFTERSUSP;
    uint32_t RESERVED1[23];
} stc_usbhs_pcgcctl_bit_t;

typedef struct
{
    __IO uint32_t PERI0;
    __IO uint32_t PERI1;
    uint32_t RESERVED0[2];
    __IO uint32_t CKS0;
    __IO uint32_t CKS1;
    __IO uint32_t CKS2;
    __IO uint32_t CKS3;
    __IO uint32_t WDPT0;
    __IO uint32_t WDPT1;
    __IO uint32_t WDPT2;
    __IO uint32_t WDPT3;
    uint32_t RESERVED1[4];
    __IO uint32_t SLPOFF;
    uint32_t RESERVED2[14];
    __IO uint32_t ITS;
} stc_wdt_cr_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
    __IO uint32_t UDF;
    __IO uint32_t REF;
    uint32_t RESERVED1[14];
} stc_wdt_sr_bit_t;


typedef struct
{
    stc_adc_str_bit_t                        STR_b;
    uint32_t                                 RESERVED0[8];
    stc_adc_cr0_bit_t                        CR0_b;
    stc_adc_cr1_bit_t                        CR1_b;
    uint32_t                                 RESERVED1[32];
    stc_adc_trgsr_bit_t                      TRGSR_b;
    stc_adc_chselra_bit_t                    CHSELRA_b;
    stc_adc_chselrb_bit_t                    CHSELRB_b;
    stc_adc_avchselr_bit_t                   AVCHSELR_b;
    stc_adc_exchselr_bit_t                   EXCHSELR_b;
    uint32_t                                 RESERVED2[8];
    stc_adc_shcr_bit_t                       SHCR_b;
    uint32_t                                 RESERVED3[224];
    stc_adc_chmuxr0_bit_t                    CHMUXR0_b;
    stc_adc_chmuxr1_bit_t                    CHMUXR1_b;
    stc_adc_chmuxr2_bit_t                    CHMUXR2_b;
    stc_adc_chmuxr3_bit_t                    CHMUXR3_b;
    uint32_t                                 RESERVED4[32];
    stc_adc_isr_bit_t                        ISR_b;
    stc_adc_icr_bit_t                        ICR_b;
    stc_adc_isclrr_bit_t                     ISCLRR_b;
    uint32_t                                 RESERVED5[40];
    stc_adc_synccr_bit_t                     SYNCCR_b;
    uint32_t                                 RESERVED6[656];
    stc_adc_awdcr_bit_t                      AWDCR_b;
    stc_adc_awdsr_bit_t                      AWDSR_b;
    stc_adc_awdsclrr_bit_t                   AWDSCLRR_b;
    uint32_t                                 RESERVED7[32];
    stc_adc_awd0chsr_bit_t                   AWD0CHSR_b;
    uint32_t                                 RESERVED8[48];
    stc_adc_awd1chsr_bit_t                   AWD1CHSR_b;
    uint32_t                                 RESERVED9[112];
    stc_adc_pgacr1_bit_t                     PGACR1_b;
    stc_adc_pgacr2_bit_t                     PGACR2_b;
    stc_adc_pgacr3_bit_t                     PGACR3_b;
    uint32_t                                 RESERVED10[8];
    stc_adc_pgavssenr_bit_t                  PGAVSSENR_b;
} bM4_ADC_TypeDef;

typedef struct
{
    stc_aes_cr_bit_t                         CR_b;
} bM4_AES_TypeDef;

typedef struct
{
    stc_aos_int_sfttrg_bit_t                 INT_SFTTRG_b;
    stc_aos_dcu_1_trgsel_bit_t               DCU_1_TRGSEL_b;
    stc_aos_dcu_2_trgsel_bit_t               DCU_2_TRGSEL_b;
    stc_aos_dcu_3_trgsel_bit_t               DCU_3_TRGSEL_b;
    stc_aos_dcu_4_trgsel_bit_t               DCU_4_TRGSEL_b;
    stc_aos_dma_1_trgsel_bit_t               DMA_1_TRGSEL0_b;
    stc_aos_dma_1_trgsel_bit_t               DMA_1_TRGSEL1_b;
    stc_aos_dma_1_trgsel_bit_t               DMA_1_TRGSEL2_b;
    stc_aos_dma_1_trgsel_bit_t               DMA_1_TRGSEL3_b;
    stc_aos_dma_1_trgsel_bit_t               DMA_1_TRGSEL4_b;
    stc_aos_dma_1_trgsel_bit_t               DMA_1_TRGSEL5_b;
    stc_aos_dma_1_trgsel_bit_t               DMA_1_TRGSEL6_b;
    stc_aos_dma_1_trgsel_bit_t               DMA_1_TRGSEL7_b;
    stc_aos_dma_2_trgsel_bit_t               DMA_2_TRGSEL0_b;
    stc_aos_dma_2_trgsel_bit_t               DMA_2_TRGSEL1_b;
    stc_aos_dma_2_trgsel_bit_t               DMA_2_TRGSEL2_b;
    stc_aos_dma_2_trgsel_bit_t               DMA_2_TRGSEL3_b;
    stc_aos_dma_2_trgsel_bit_t               DMA_2_TRGSEL4_b;
    stc_aos_dma_2_trgsel_bit_t               DMA_2_TRGSEL5_b;
    stc_aos_dma_2_trgsel_bit_t               DMA_2_TRGSEL6_b;
    stc_aos_dma_2_trgsel_bit_t               DMA_2_TRGSEL7_b;
    stc_aos_dma_trgselrc_bit_t               DMA_TRGSELRC_b;
    stc_aos_tmr6_htssr_bit_t                 TMR6_HTSSR1_b;
    stc_aos_tmr6_htssr_bit_t                 TMR6_HTSSR2_b;
    stc_aos_tmr6_htssr_bit_t                 TMR6_HTSSR3_b;
    stc_aos_tmr6_htssr_bit_t                 TMR6_HTSSR4_b;
    stc_aos_port_pevnttrgsr12_bit_t          PORT_PEVNTTRGSR12_b;
    stc_aos_port_pevnttrgsr34_bit_t          PORT_PEVNTTRGSR34_b;
    stc_aos_tmr0_htssr_bit_t                 TMR0_HTSSR_b;
    stc_aos_tmr2_htssr_bit_t                 TMR2_HTSSR_b;
    stc_aos_hash_itrgsela_bit_t              HASH_ITRGSELA_b;
    stc_aos_hash_itrgselb_bit_t              HASH_ITRGSELB_b;
    stc_aos_tmra_htssr_bit_t                 TMRA_HTSSR0_b;
    stc_aos_tmra_htssr_bit_t                 TMRA_HTSSR1_b;
    stc_aos_tmra_htssr_bit_t                 TMRA_HTSSR2_b;
    stc_aos_tmra_htssr_bit_t                 TMRA_HTSSR3_b;
    stc_aos_ots_trg_bit_t                    OTS_TRG_b;
    stc_aos_adc_1_itrgselr_bit_t             ADC_1_ITRGSELR0_b;
    stc_aos_adc_1_itrgselr_bit_t             ADC_1_ITRGSELR1_b;
    stc_aos_adc_2_itrgselr_bit_t             ADC_2_ITRGSELR0_b;
    stc_aos_adc_2_itrgselr_bit_t             ADC_2_ITRGSELR1_b;
    stc_aos_adc_3_itrgselr_bit_t             ADC_3_ITRGSELR0_b;
    stc_aos_adc_3_itrgselr_bit_t             ADC_3_ITRGSELR1_b;
    uint32_t                                 RESERVED0[672];
    stc_aos_gpio_pevntdirr_bit_t             GPIO_PEVNTDIRR1_b;
    stc_aos_gpio_pevntidr_bit_t              GPIO_PEVNTIDR1_b;
    stc_aos_gpio_pevntodr_bit_t              GPIO_PEVNTODR1_b;
    stc_aos_gpio_pevntorr_bit_t              GPIO_PEVNTORR1_b;
    stc_aos_gpio_pevntosr_bit_t              GPIO_PEVNTOSR1_b;
    stc_aos_gpio_pevntrisr_bit_t             GPIO_PEVNTRISR1_b;
    stc_aos_gpio_pevntfal_bit_t              GPIO_PEVNTFAL1_b;
    stc_aos_gpio_pevntdirr_bit_t             GPIO_PEVNTDIRR2_b;
    stc_aos_gpio_pevntidr_bit_t              GPIO_PEVNTIDR2_b;
    stc_aos_gpio_pevntodr_bit_t              GPIO_PEVNTODR2_b;
    stc_aos_gpio_pevntorr_bit_t              GPIO_PEVNTORR2_b;
    stc_aos_gpio_pevntosr_bit_t              GPIO_PEVNTOSR2_b;
    stc_aos_gpio_pevntrisr_bit_t             GPIO_PEVNTRISR2_b;
    stc_aos_gpio_pevntfal_bit_t              GPIO_PEVNTFAL2_b;
    stc_aos_gpio_pevntdirr_bit_t             GPIO_PEVNTDIRR3_b;
    stc_aos_gpio_pevntidr_bit_t              GPIO_PEVNTIDR3_b;
    stc_aos_gpio_pevntodr_bit_t              GPIO_PEVNTODR3_b;
    stc_aos_gpio_pevntorr_bit_t              GPIO_PEVNTORR3_b;
    stc_aos_gpio_pevntosr_bit_t              GPIO_PEVNTOSR3_b;
    stc_aos_gpio_pevntrisr_bit_t             GPIO_PEVNTRISR3_b;
    stc_aos_gpio_pevntfal_bit_t              GPIO_PEVNTFAL3_b;
    stc_aos_gpio_pevntdirr_bit_t             GPIO_PEVNTDIRR4_b;
    stc_aos_gpio_pevntidr_bit_t              GPIO_PEVNTIDR4_b;
    stc_aos_gpio_pevntodr_bit_t              GPIO_PEVNTODR4_b;
    stc_aos_gpio_pevntorr_bit_t              GPIO_PEVNTORR4_b;
    stc_aos_gpio_pevntosr_bit_t              GPIO_PEVNTOSR4_b;
    stc_aos_gpio_pevntrisr_bit_t             GPIO_PEVNTRISR4_b;
    stc_aos_gpio_pevntfal_bit_t              GPIO_PEVNTFAL4_b;
    stc_aos_gpio_pevntnfcr_bit_t             GPIO_PEVNTNFCR_b;
} bM4_AOS_TypeDef;

