levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    uint32_t                                 RESERVED0[1280];
    stc_can_cfg_stat_bit_t                   CFG_STAT_b;
    stc_can_tcmd_bit_t                       TCMD_b;
    stc_can_tctrl_bit_t                      TCTRL_b;
    stc_can_rctrl_bit_t                      RCTRL_b;
    stc_can_rtie_bit_t                       RTIE_b;
    stc_can_rtif_bit_t                       RTIF_b;
    stc_can_errint_bit_t                     ERRINT_b;
    stc_can_limit_bit_t                      LIMIT_b;
    stc_can_sbt_bit_t                        SBT_b;
    stc_can_fbt_bit_t                        FBT_b;
    stc_can_ealcap_bit_t                     EALCAP_b;
    stc_can_tdc_bit_t                        TDC_b;
    uint32_t                                 RESERVED1[16];
    stc_can_acfctrl_bit_t                    ACFCTRL_b;
    uint32_t                                 RESERVED2[8];
    stc_can_acfen_bit_t                      ACFEN_b;
    stc_can_acf_bit_t                        ACF_b;
    uint32_t                                 RESERVED3[16];
    stc_can_tbslot_bit_t                     TBSLOT_b;
    stc_can_ttcfg_bit_t                      TTCFG_b;
    stc_can_ref_msg_bit_t                    REF_MSG_b;
    stc_can_trg_cfg_bit_t                    TRG_CFG_b;
} bM4_CAN_TypeDef;

typedef struct
{
    stc_cmp_mdr_bit_t                        MDR_b;
    stc_cmp_fir_bit_t                        FIR_b;
    stc_cmp_ocr_bit_t                        OCR_b;
    stc_cmp_pmsr_bit_t                       PMSR_b;
    stc_cmp_twsr_bit_t                       TWSR_b;
    stc_cmp_twpr_bit_t                       TWPR_b;
    stc_cmp_visr_bit_t                       VISR_b;
} bM4_CMP_TypeDef;

typedef struct
{
    stc_cmu_xtal32cr_bit_t                   XTAL32CR_b;
    uint32_t                                 RESERVED0[216];
    stc_cmu_lrccr_bit_t                      LRCCR_b;
    uint32_t                                 RESERVED1[24];
    stc_cmu_rtclrccr_bit_t                   RTCLRCCR_b;
    uint32_t                                 RESERVED2[17080];
    stc_cmu_xtalcfgr_bit_t                   XTALCFGR_b;
    uint32_t                                 RESERVED3[236936];
    stc_cmu_pllhcr_bit_t                     PLLHCR_b;
    uint32_t                                 RESERVED4[24];
    stc_cmu_pllacr_bit_t                     PLLACR_b;
    uint32_t                                 RESERVED5[24];
    stc_cmu_xtalcr_bit_t                     XTALCR_b;
    uint32_t                                 RESERVED6[24];
    stc_cmu_hrccr_bit_t                      HRCCR_b;
    uint32_t                                 RESERVED7[8];
    stc_cmu_mrccr_bit_t                      MRCCR_b;
    uint32_t                                 RESERVED8[24];
    stc_cmu_oscstbsr_bit_t                   OSCSTBSR_b;
    stc_cmu_mco1cfgr_bit_t                   MCO1CFGR_b;
    stc_cmu_mco2cfgr_bit_t                   MCO2CFGR_b;
    stc_cmu_tpiuckcfgr_bit_t                 TPIUCKCFGR_b;
    stc_cmu_xtalstdcr_bit_t                  XTALSTDCR_b;
    stc_cmu_xtalstdsr_bit_t                  XTALSTDSR_b;
    uint32_t                                 RESERVED9[1520];
    stc_cmu_pllhcfgr_bit_t                   PLLHCFGR_b;
} bM4_CMU_TypeDef;

typedef struct
{
    stc_crc_cr_bit_t                         CR_b;
} bM4_CRC_TypeDef;

typedef struct
{
    stc_ctc_cr1_bit_t                        CR1_b;
    stc_ctc_cr2_bit_t                        CR2_b;
    stc_ctc_str_bit_t                        STR_b;
} bM4_CTC_TypeDef;

typedef struct
{
    stc_dac_dadr1_bit_t                      DADR1_b;
    stc_dac_dadr2_bit_t                      DADR2_b;
    stc_dac_dacr_bit_t                       DACR_b;
    stc_dac_daadpcr_bit_t                    DAADPCR_b;
    uint32_t                                 RESERVED0[160];
    stc_dac_daocr_bit_t                      DAOCR_b;
} bM4_DAC_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[128];
    stc_dbgc_mcustat_bit_t                   MCUSTAT_b;
    stc_dbgc_mcuctl_bit_t                    MCUCTL_b;
    stc_dbgc_fmcctl_bit_t                    FMCCTL_b;
    stc_dbgc_mcudbgcstat_bit_t               MCUDBGCSTAT_b;
    stc_dbgc_mcustpctl_bit_t                 MCUSTPCTL_b;
    stc_dbgc_mcutracectl_bit_t               MCUTRACECTL_b;
    stc_dbgc_mcustpctl2_bit_t                MCUSTPCTL2_b;
} bM4_DBGC_TypeDef;

typedef struct
{
    stc_dcu_ctl_bit_t                        CTL_b;
    stc_dcu_flag_bit_t                       FLAG_b;
    uint32_t                                 RESERVED0[96];
    stc_dcu_flagclr_bit_t                    FLAGCLR_b;
    stc_dcu_intevtsel_bit_t                  INTEVTSEL_b;
} bM4_DCU_TypeDef;

typedef struct
{
    stc_dma_en_bit_t                         EN_b;
    stc_dma_intstat0_bit_t                   INTSTAT0_b;
    stc_dma_intstat1_bit_t                   INTSTAT1_b;
    stc_dma_intmask0_bit_t                   INTMASK0_b;
    stc_dma_intmask1_bit_t                   INTMASK1_b;
    stc_dma_intclr0_bit_t                    INTCLR0_b;
    stc_dma_intclr1_bit_t                    INTCLR1_b;
    stc_dma_chen_bit_t                       CHEN_b;
    stc_dma_reqstat_bit_t                    REQSTAT_b;
    stc_dma_chstat_bit_t                     CHSTAT_b;
    uint32_t                                 RESERVED0[32];
    stc_dma_rcfgctl_bit_t                    RCFGCTL_b;
    uint32_t                                 RESERVED1[32];
    stc_dma_chenclr_bit_t                    CHENCLR_b;
    uint32_t                                 RESERVED2[384];
    stc_dma_chctl_bit_t                      CHCTL0_b;
    uint32_t                                 RESERVED3[512];
    stc_dma_chctl_bit_t                      CHCTL1_b;
    uint32_t                                 RESERVED4[512];
    stc_dma_chctl_bit_t                      CHCTL2_b;
    uint32_t                                 RESERVED5[512];
    stc_dma_chctl_bit_t                      CHCTL3_b;
    uint32_t                                 RESERVED6[512];
    stc_dma_chctl_bit_t                      CHCTL4_b;
    uint32_t                                 RESERVED7[512];
    stc_dma_chctl_bit_t                      CHCTL5_b;
    uint32_t                                 RESERVED8[512];
    stc_dma_chctl_bit_t                      CHCTL6_b;
    uint32_t                                 RESERVED9[512];
    stc_dma_chctl_bit_t                      CHCTL7_b;
} bM4_DMA_TypeDef;

typedef struct
{
    stc_dvp_ctr_bit_t                        CTR_b;
    uint32_t                                 RESERVED0[32];
    stc_dvp_str_bit_t                        STR_b;
    stc_dvp_ier_bit_t                        IER_b;
} bM4_DVP_TypeDef;

typedef struct
{
    stc_efm_faprt_bit_t                      FAPRT_b;
    uint32_t                                 RESERVED0[128];
    stc_efm_fstp_bit_t                       FSTP_b;
    stc_efm_frmc_bit_t                       FRMC_b;
    stc_efm_fwmc_bit_t                       FWMC_b;
    stc_efm_fsr_bit_t                        FSR_b;
    stc_efm_fsclr_bit_t                      FSCLR_b;
    stc_efm_fite_bit_t                       FITE_b;
    stc_efm_fswp_bit_t                       FSWP_b;
    uint32_t                                 RESERVED1[1664];
    stc_mmf_remprt_bit_t                     REMPRT_b;
    stc_mmf_remcr0_bit_t                     REMCR0_b;
    stc_mmf_remcr1_bit_t                     REMCR1_b;
    uint32_t                                 RESERVED2[928];
    stc_efm_wlock_bit_t                      WLOCK_b;
} bM4_EFM_TypeDef;

typedef struct
{
    stc_emb_ctl1_bit_t                       CTL1_b;
    stc_emb_ctl2_bit_t                       CTL2_b;
    stc_emb_soe_bit_t                        SOE_b;
    stc_emb_stat_bit_t                       STAT_b;
    stc_emb_statclr_bit_t                    STATCLR_b;
    stc_emb_inten_bit_t                      INTEN_b;
    stc_emb_rlssel_bit_t                     RLSSEL_b;
} bM4_EMB_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[172160];
    stc_eth_mac_ifconfr_bit_t                MAC_IFCONFR_b;
    uint32_t                                 RESERVED1[352096];
    stc_eth_mac_configr_bit_t                MAC_CONFIGR_b;
    stc_eth_mac_fltctlr_bit_t                MAC_FLTCTLR_b;
    uint32_t                                 RESERVED2[64];
    stc_eth_mac_smiaddr_bit_t                MAC_SMIADDR_b;
    uint32_t                                 RESERVED3[32];
    stc_eth_mac_floctlr_bit_t                MAC_FLOCTLR_b;
    stc_eth_mac_vtafltr_bit_t                MAC_VTAFLTR_b;
    uint32_t                                 RESERVED4[32];
    stc_eth_mac_macstsr_bit_t                MAC_MACSTSR_b;
    uint32_t                                 RESERVED5[32];
    stc_eth_mac_pmtctlr_bit_t                MAC_PMTCTLR_b;
    uint32_t                                 RESERVED6[64];
    stc_eth_mac_intstsr_bit_t                MAC_INTSTSR_b;
    stc_eth_mac_intmskr_bit_t                MAC_INTMSKR_b;
    stc_eth_mac_macadhr0_bit_t               MAC_MACADHR0_b;
    uint32_t                                 RESERVED7[32];
    stc_eth_mac_macadhr1_bit_t               MAC_MACADHR1_b;
    uint32_t                                 RESERVED8[32];
    stc_eth_mac_macadhr2_bit_t               MAC_MACADHR2_b;
    uint32_t                                 RESERVED9[32];
    stc_eth_mac_macadhr3_bit_t               MAC_MACADHR3_b;
    uint32_t                                 RESERVED10[32];
    stc_eth_mac_macadhr4_bit_t               MAC_MACADHR4_b;
    uint32_t                                 RESERVED11[1248];
    stc_eth_mmc_mmcctlr_bit_t                MMC_MMCCTLR_b;
    stc_eth_mmc_revstsr_bit_t                MMC_REVSTSR_b;
    stc_eth_mmc_trsstsr_bit_t                MMC_TRSSTSR_b;
    stc_eth_mmc_ritctlr_bit_t                MMC_RITCTLR_b;
    stc_eth_mmc_titctlr_bit_t                MMC_TITCTLR_b;
    uint32_t                                 RESERVED12[5984];
    stc_eth_mac_l34ctlr_bit_t                MAC_L34CTLR_b;
    uint32_t                                 RESERVED13[3072];
    stc_eth_mac_vtactlr_bit_t                MAC_VTACTLR_b;
    uint32_t                                 RESERVED14[3008];
    stc_eth_ptp_tspctlr_bit_t                PTP_TSPCTLR_b;
    uint32_t                                 RESERVED15[128];
    stc_eth_ptp_tmunser_bit_t                PTP_TMUNSER_b;
    uint32_t                                 RESERVED16[128];
    stc_eth_ptp_tspstsr_bit_t                PTP_TSPSTSR_b;
    stc_eth_ptp_ppsctlr_bit_t                PTP_PPSCTLR_b;
    uint32_t                                 RESERVED17[18048];
    stc_eth_dma_busmodr_bit_t                DMA_BUSMODR_b;
    uint32_t                                 RESERVED18[128];
    stc_eth_dma_dmastsr_bit_t                DMA_DMASTSR_b;
    stc_eth_dma_oprmodr_bit_t                DMA_OPRMODR_b;
    stc_eth_dma_intenar_bit_t                DMA_INTENAR_b;
    stc_eth_dma_rfrcntr_bit_t                DMA_RFRCNTR_b;
} bM4_ETH_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[96];
    stc_fcm_str_bit_t                        STR_b;
    uint32_t                                 RESERVED1[32];
    stc_fcm_rccr_bit_t                       RCCR_b;
    stc_fcm_rier_bit_t                       RIER_b;
    stc_fcm_sr_bit_t                         SR_b;
    stc_fcm_clr_bit_t                        CLR_b;
} bM4_FCM_TypeDef;

typedef struct
{
    stc_fmac_enr_bit_t                       ENR_b;
    stc_fmac_ctr_bit_t                       CTR_b;
    stc_fmac_ier_bit_t                       IER_b;
    stc_fmac_dtr_bit_t                       DTR_b;
    uint32_t                                 RESERVED0[64];
    stc_fmac_str_bit_t                       STR_b;
    uint32_t                                 RESERVED1[32];
    stc_fmac_cor0_bit_t                      COR0_b;
    stc_fmac_cor1_bit_t                      COR1_b;
    stc_fmac_cor2_bit_t                      COR2_b;
    stc_fmac_cor3_bit_t                      COR3_b;
    stc_fmac_cor4_bit_t                      COR4_b;
    stc_fmac_cor5_bit_t                      COR5_b;
    stc_fmac_cor6_bit_t                      COR6_b;
    stc_fmac_cor7_bit_t                      COR7_b;
    stc_fmac_cor8_bit_t                      COR8_b;
    stc_fmac_cor9_bit_t                      COR9_b;
    stc_fmac_cor10_bit_t                     COR10_b;
    stc_fmac_cor11_bit_t                     COR11_b;
    stc_fmac_cor12_bit_t                     COR12_b;
    stc_fmac_cor13_bit_t                     COR13_b;
    stc_fmac_cor14_bit_t                     COR14_b;
    stc_fmac_cor15_bit_t                     COR15_b;
    stc_fmac_cor16_bit_t                     COR16_b;
} bM4_FMAC_TypeDef;

