levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    uint32_t                                 RESERVED0[32];
    stc_intc_nmienr_bit_t                    NMIENR_b;
    stc_intc_nmifr_bit_t                     NMIFR_b;
    stc_intc_nmicfr_bit_t                    NMICFR_b;
    stc_intc_eirqcr_bit_t                    EIRQCR0_b;
    stc_intc_eirqcr_bit_t                    EIRQCR1_b;
    stc_intc_eirqcr_bit_t                    EIRQCR2_b;
    stc_intc_eirqcr_bit_t                    EIRQCR3_b;
    stc_intc_eirqcr_bit_t                    EIRQCR4_b;
    stc_intc_eirqcr_bit_t                    EIRQCR5_b;
    stc_intc_eirqcr_bit_t                    EIRQCR6_b;
    stc_intc_eirqcr_bit_t                    EIRQCR7_b;
    stc_intc_eirqcr_bit_t                    EIRQCR8_b;
    stc_intc_eirqcr_bit_t                    EIRQCR9_b;
    stc_intc_eirqcr_bit_t                    EIRQCR10_b;
    stc_intc_eirqcr_bit_t                    EIRQCR11_b;
    stc_intc_eirqcr_bit_t                    EIRQCR12_b;
    stc_intc_eirqcr_bit_t                    EIRQCR13_b;
    stc_intc_eirqcr_bit_t                    EIRQCR14_b;
    stc_intc_eirqcr_bit_t                    EIRQCR15_b;
    stc_intc_wupen_bit_t                     WUPEN_b;
    stc_intc_eifr_bit_t                      EIFR_b;
    stc_intc_eicfr_bit_t                     EICFR_b;
    uint32_t                                 RESERVED1[4096];
    stc_intc_vssel_bit_t                     VSSEL128_b;
    stc_intc_vssel_bit_t                     VSSEL129_b;
    stc_intc_vssel_bit_t                     VSSEL130_b;
    stc_intc_vssel_bit_t                     VSSEL131_b;
    stc_intc_vssel_bit_t                     VSSEL132_b;
    stc_intc_vssel_bit_t                     VSSEL133_b;
    stc_intc_vssel_bit_t                     VSSEL134_b;
    stc_intc_vssel_bit_t                     VSSEL135_b;
    stc_intc_vssel_bit_t                     VSSEL136_b;
    stc_intc_vssel_bit_t                     VSSEL137_b;
    stc_intc_vssel_bit_t                     VSSEL138_b;
    stc_intc_vssel_bit_t                     VSSEL139_b;
    stc_intc_vssel_bit_t                     VSSEL140_b;
    stc_intc_vssel_bit_t                     VSSEL141_b;
    stc_intc_vssel_bit_t                     VSSEL142_b;
    stc_intc_vssel_bit_t                     VSSEL143_b;
    stc_intc_swier_bit_t                     SWIER_b;
    stc_intc_evter_bit_t                     EVTER_b;
    stc_intc_ier_bit_t                       IER_b;
} bM4_INTC_TypeDef;

typedef struct
{
    stc_keyscan_scr_bit_t                    SCR_b;
    stc_keyscan_ser_bit_t                    SER_b;
} bM4_KEYSCAN_TypeDef;

typedef struct
{
    stc_mau_csr_bit_t                        CSR_b;
    uint32_t                                 RESERVED0[64];
    stc_mau_rtr0_bit_t                       RTR0_b;
    stc_mau_dtr1_bit_t                       DTR1_b;
    stc_mau_rtr1_bit_t                       RTR1_b;
} bM4_MAU_TypeDef;

typedef struct
{
    stc_mpu_rgd0_bit_t                       RGD0_b;
    uint32_t                                 RESERVED0[480];
    stc_mpu_sr_bit_t                         SR_b;
    stc_mpu_eclr_bit_t                       ECLR_b;
    stc_mpu_wp_bit_t                         WP_b;
    stc_mpu_ippr_bit_t                       IPPR_b;
    stc_mpu_s1rge_bit_t                      S1RGE_b;
    stc_mpu_s1rgwp_bit_t                     S1RGWP_b;
    stc_mpu_s1rgrp_bit_t                     S1RGRP_b;
    stc_mpu_s1cr_bit_t                       S1CR_b;
    stc_mpu_s2rge_bit_t                      S2RGE_b;
    stc_mpu_s2rgwp_bit_t                     S2RGWP_b;
    stc_mpu_s2rgrp_bit_t                     S2RGRP_b;
    stc_mpu_s2cr_bit_t                       S2CR_b;
    stc_mpu_frge_bit_t                       FRGE_b;
    stc_mpu_frgwp_bit_t                      FRGWP_b;
    stc_mpu_frgrp_bit_t                      FRGRP_b;
    stc_mpu_fcr_bit_t                        FCR_b;
    stc_mpu_hrge_bit_t                       HRGE_b;
    stc_mpu_hrgwp_bit_t                      HRGWP_b;
    stc_mpu_hrgrp_bit_t                      HRGRP_b;
    stc_mpu_hcr_bit_t                        HCR_b;
    stc_mpu_erge_bit_t                       ERGE_b;
    stc_mpu_ergwp_bit_t                      ERGWP_b;
    stc_mpu_ergrp_bit_t                      ERGRP_b;
    stc_mpu_ecr_bit_t                        ECR_b;
} bM4_MPU_TypeDef;

typedef struct
{
    stc_ots_ctl_bit_t                        CTL_b;
    uint32_t                                 RESERVED0[48];
    stc_ots_lpr_bit_t                        LPR_b;
} bM4_OTS_TypeDef;

typedef struct
{
    stc_peric_usb_syctlreg_bit_t             USB_SYCTLREG_b;
    stc_peric_sdioc_syctlreg_bit_t           SDIOC_SYCTLREG_b;
    stc_peric_nfc_syctlreg_bit_t             NFC_SYCTLREG_b;
    stc_peric_exmc_enar_bit_t                EXMC_ENAR_b;
    uint32_t                                 RESERVED0[64];
    stc_peric_can_syctlreg_bit_t             CAN_SYCTLREG_b;
    stc_peric_usart1_nfc_bit_t               USART1_NFC_b;
    uint32_t                                 RESERVED1[64];
    stc_peric_nfc_systatreg_bit_t            NFC_SYSTATREG_b;
} bM4_PERIC_TypeDef;

typedef struct
{
    stc_pwc_fcg0_bit_t                       FCG0_b;
    stc_pwc_fcg1_bit_t                       FCG1_b;
    stc_pwc_fcg2_bit_t                       FCG2_b;
    stc_pwc_fcg3_bit_t                       FCG3_b;
    stc_pwc_fcg0pc_bit_t                     FCG0PC_b;
    uint32_t                                 RESERVED0[139616];
    stc_pwc_vbatcr_bit_t                     VBATCR_b;
    uint32_t                                 RESERVED1[184];
    stc_pwc_wktc2_bit_t                      WKTC2_b;
    uint32_t                                 RESERVED2[15672];
    stc_pwc_pwrc0_bit_t                      PWRC0_b;
    uint32_t                                 RESERVED3[24];
    stc_pwc_pwrc1_bit_t                      PWRC1_b;
    uint32_t                                 RESERVED4[24];
    stc_pwc_pwrc2_bit_t                      PWRC2_b;
    uint32_t                                 RESERVED5[56];
    stc_pwc_pwrc4_bit_t                      PWRC4_b;
    uint32_t                                 RESERVED6[24];
    stc_pwc_pvdcr0_bit_t                     PVDCR0_b;
    uint32_t                                 RESERVED7[24];
    stc_pwc_pvdcr1_bit_t                     PVDCR1_b;
    uint32_t                                 RESERVED8[24];
    stc_pwc_pvdfcr_bit_t                     PVDFCR_b;
    uint32_t                                 RESERVED9[24];
    stc_pwc_pvdlcr_bit_t                     PVDLCR_b;
    uint32_t                                 RESERVED10[56];
    stc_pwc_pdwke0_bit_t                     PDWKE0_b;
    uint32_t                                 RESERVED11[24];
    stc_pwc_pdwke1_bit_t                     PDWKE1_b;
    uint32_t                                 RESERVED12[24];
    stc_pwc_pdwke2_bit_t                     PDWKE2_b;
    uint32_t                                 RESERVED13[24];
    stc_pwc_pdwkes_bit_t                     PDWKES_b;
    uint32_t                                 RESERVED14[24];
    stc_pwc_pdwkf0_bit_t                     PDWKF0_b;
    uint32_t                                 RESERVED15[24];
    stc_pwc_pdwkf1_bit_t                     PDWKF1_b;
    uint32_t                                 RESERVED16[1304];
    stc_pwc_rampc0_bit_t                     RAMPC0_b;
    stc_pwc_ramopm_bit_t                     RAMOPM_b;
    stc_pwc_pramlpc_bit_t                    PRAMLPC_b;
    uint32_t                                 RESERVED17[32];
    stc_pwc_pvdicr_bit_t                     PVDICR_b;
    uint32_t                                 RESERVED18[24];
    stc_pwc_pvddsr_bit_t                     PVDDSR_b;
    uint32_t                                 RESERVED19[235704];
    stc_pwc_stpmcr_bit_t                     STPMCR_b;
    uint32_t                                 RESERVED20[8064];
    stc_pwc_fprc_bit_t                       FPRC_b;
} bM4_PWC_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[1984];
    stc_rmu_prstcr0_bit_t                    PRSTCR0_b;
    uint32_t                                 RESERVED1[24];
    stc_rmu_rstf0_bit_t                      RSTF0_b;
} bM4_RMU_TypeDef;

typedef struct
{
    stc_rtc_cr0_bit_t                        CR0_b;
    uint32_t                                 RESERVED0[24];
    stc_rtc_cr1_bit_t                        CR1_b;
    uint32_t                                 RESERVED1[24];
    stc_rtc_cr2_bit_t                        CR2_b;
    uint32_t                                 RESERVED2[24];
    stc_rtc_cr3_bit_t                        CR3_b;
    uint32_t                                 RESERVED3[88];
    stc_rtc_hour_bit_t                       HOUR_b;
    uint32_t                                 RESERVED4[24];
    stc_rtc_week_bit_t                       WEEK_b;
    uint32_t                                 RESERVED5[152];
    stc_rtc_almhour_bit_t                    ALMHOUR_b;
    uint32_t                                 RESERVED6[24];
    stc_rtc_almweek_bit_t                    ALMWEEK_b;
    uint32_t                                 RESERVED7[24];
    stc_rtc_errcrh_bit_t                     ERRCRH_b;
    uint32_t                                 RESERVED8[56];
    stc_rtc_tpcr0_bit_t                      TPCR0_b;
    uint32_t                                 RESERVED9[24];
    stc_rtc_tpcr1_bit_t                      TPCR1_b;
    uint32_t                                 RESERVED10[24];
    stc_rtc_tpsr_bit_t                       TPSR_b;
    uint32_t                                 RESERVED11[88];
    stc_rtc_hourtp_bit_t                     HOURTP_b;
} bM4_RTC_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[96];
    stc_sdioc_transmode_bit_t                TRANSMODE_b;
    stc_sdioc_cmd_bit_t                      CMD_b;
    uint32_t                                 RESERVED1[160];
    stc_sdioc_pstat_bit_t                    PSTAT_b;
    stc_sdioc_hostcon_bit_t                  HOSTCON_b;
    stc_sdioc_pwrcon_bit_t                   PWRCON_b;
    stc_sdioc_blkgpcon_bit_t                 BLKGPCON_b;
    uint32_t                                 RESERVED2[8];
    stc_sdioc_clkcon_bit_t                   CLKCON_b;
    stc_sdioc_toutcon_bit_t                  TOUTCON_b;
    stc_sdioc_sftrst_bit_t                   SFTRST_b;
    stc_sdioc_norintst_bit_t                 NORINTST_b;
    stc_sdioc_errintst_bit_t                 ERRINTST_b;
    stc_sdioc_norintsten_bit_t               NORINTSTEN_b;
    stc_sdioc_errintsten_bit_t               ERRINTSTEN_b;
    stc_sdioc_norintsgen_bit_t               NORINTSGEN_b;
    stc_sdioc_errintsgen_bit_t               ERRINTSGEN_b;
    stc_sdioc_atcerrst_bit_t                 ATCERRST_b;
    uint32_t                                 RESERVED3[144];
    stc_sdioc_fea_bit_t                      FEA_b;
    stc_sdioc_fee_bit_t                      FEE_b;
} bM4_SDIOC_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[32];
    stc_spi_cr1_bit_t                        CR1_b;
    uint32_t                                 RESERVED1[32];
    stc_spi_cfg1_bit_t                       CFG1_b;
    uint32_t                                 RESERVED2[32];
    stc_spi_sr_bit_t                         SR_b;
    stc_spi_cfg2_bit_t                       CFG2_b;
} bM4_SPI_TypeDef;

typedef struct
{
    stc_sramc_wtcr_bit_t                     WTCR_b;
    stc_sramc_wtpr_bit_t                     WTPR_b;
    stc_sramc_ckcr_bit_t                     CKCR_b;
    stc_sramc_ckpr_bit_t                     CKPR_b;
    stc_sramc_cksr_bit_t                     CKSR_b;
} bM4_SRAMC_TypeDef;

typedef struct
{
    stc_swdt_cr_bit_t                        CR_b;
    stc_swdt_sr_bit_t                        SR_b;
} bM4_SWDT_TypeDef;

typedef struct
{
    stc_tmr0_cntar_bit_t                     CNTAR_b;
    stc_tmr0_cntbr_bit_t                     CNTBR_b;
    stc_tmr0_cmpar_bit_t                     CMPAR_b;
    stc_tmr0_cmpbr_bit_t                     CMPBR_b;
    stc_tmr0_bconr_bit_t                     BCONR_b;
    stc_tmr0_stflr_bit_t                     STFLR_b;
} bM4_TMR0_TypeDef;

typedef struct
{
    stc_tmr2_cntar_bit_t                     CNTAR_b;
    stc_tmr2_cntbr_bit_t                     CNTBR_b;
    stc_tmr2_cmpar_bit_t                     CMPAR_b;
    stc_tmr2_cmpbr_bit_t                     CMPBR_b;
    stc_tmr2_bconr_bit_t                     BCONR_b;
    stc_tmr2_iconr_bit_t                     ICONR_b;
    stc_tmr2_pconr_bit_t                     PCONR_b;
    stc_tmr2_hconr_bit_t                     HCONR_b;
    stc_tmr2_stflr_bit_t                     STFLR_b;
} bM4_TMR2_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[192];
    stc_tmr4_ocsr_bit_t                      OCSRU_b;
    stc_tmr4_ocer_bit_t                      OCERU_b;
    stc_tmr4_ocsr_bit_t                      OCSRV_b;
    stc_tmr4_ocer_bit_t                      OCERV_b;
    stc_tmr4_ocsr_bit_t                      OCSRW_b;
    stc_tmr4_ocer_bit_t                      OCERW_b;
    stc_tmr4_ocmrh_bit_t                     OCMRHUH_b;
    uint32_t                                 RESERVED1[16];
    stc_tmr4_ocmrl_bit_t                     OCMRLUL_b;
    stc_tmr4_ocmrh_bit_t                     OCMRHVH_b;
    uint32_t                                 RESERVED2[16];
    stc_tmr4_ocmrl_bit_t                     OCMRLVL_b;
    stc_tmr4_ocmrh_bit_t                     OCMRHWH_b;
    uint32_t                                 RESERVED3[16];
    stc_tmr4_ocmrl_bit_t                     OCMRLWL_b;
    uint32_t                                 RESERVED4[96];
    stc_tmr4_ccsr_bit_t                      CCSR_b;
    uint32_t                                 RESERVED5[624];
    stc_tmr4_pocr_bit_t                      POCRU_b;
    uint32_t                                 RESERVED6[16];
    stc_tmr4_pocr_bit_t                      POCRV_b;
    uint32_t                                 RESERVED7[16];
    stc_tmr4_pocr_bit_t                      POCRW_b;
    uint32_t                                 RESERVED8[16];
    stc_tmr4_rcsr_bit_t                      RCSR_b;
    uint32_t                                 RESERVED9[272];
    stc_tmr4_scsr_bit_t                      SCSRUH_b;
    stc_tmr4_scmr_bit_t                      SCMRUH_b;
    stc_tmr4_scsr_bit_t                      SCSRUL_b;
    stc_tmr4_scmr_bit_t                      SCMRUL_b;
    stc_tmr4_scsr_bit_t                      SCSRVH_b;
    stc_tmr4_scmr_bit_t                      SCMRVH_b;
    stc_tmr4_scsr_bit_t                      SCSRVL_b;
    stc_tmr4_scmr_bit_t                      SCMRVL_b;
    stc_tmr4_scsr_bit_t                      SCSRWH_b;
    stc_tmr4_scmr_bit_t                      SCMRWH_b;
    stc_tmr4_scsr_bit_t                      SCSRWL_b;
    stc_tmr4_scmr_bit_t                      SCMRWL_b;
    stc_tmr4_pscr_bit_t                      PSCR_b;
    stc_tmr4_scer_bit_t                      SCER_b;
} bM4_TMR4_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[2560];
    stc_tmr6_gconr_bit_t                     GCONR_b;
    stc_tmr6_iconr_bit_t                     ICONR_b;
    stc_tmr6_bconr_bit_t                     BCONR_b;
    stc_tmr6_dconr_bit_t                     DCONR_b;
    uint32_t                                 RESERVED1[32];
    stc_tmr6_pcnar_bit_t                     PCNAR_b;
    stc_tmr6_pcnbr_bit_t                     PCNBR_b;
    stc_tmr6_fcngr_bit_t                     FCNGR_b;
    stc_tmr6_vperr_bit_t                     VPERR_b;
    stc_tmr6_stflr_bit_t                     STFLR_b;
    uint32_t                                 RESERVED2[192];
    stc_tmr6_hstar_bit_t                     HSTAR_b;
    stc_tmr6_hstpr_bit_t                     HSTPR_b;
    stc_tmr6_hclrr_bit_t                     HCLRR_b;
    stc_tmr6_hupdr_bit_t                     HUPDR_b;
    stc_tmr6_hcpar_bit_t                     HCPAR_b;
    stc_tmr6_hcpbr_bit_t                     HCPBR_b;
    stc_tmr6_hcupr_bit_t                     HCUPR_b;
    stc_tmr6_hcdor_bit_t                     HCDOR_b;
    uint32_t                                 RESERVED3[4704];
    stc_tmr6_fcntr_bit_t                     FCNTR_b;
    stc_tmr6_sstar_bit_t                     SSTAR_b;
    stc_tmr6_sstpr_bit_t                     SSTPR_b;
    stc_tmr6_sclrr_bit_t                     SCLRR_b;
    stc_tmr6_supdr_bit_t                     SUPDR_b;
} bM4_TMR6_TypeDef;

typedef struct
{
    stc_tmra_cnter_bit_t                     CNTER_b;
    stc_tmra_perar_bit_t                     PERAR_b;
    uint32_t                                 RESERVED0[448];
    stc_tmra_cmpar1_bit_t                    CMPAR1_b;
    stc_tmra_cmpar2_bit_t                    CMPAR2_b;
    stc_tmra_cmpar3_bit_t                    CMPAR3_b;
    stc_tmra_cmpar4_bit_t                    CMPAR4_b;
    uint32_t                                 RESERVED1[384];
    stc_tmra_bcstr_bit_t                     BCSTR_b;
    stc_tmra_hconr_bit_t                     HCONR_b;
    stc_tmra_hcupr_bit_t                     HCUPR_b;
    stc_tmra_hcdor_bit_t                     HCDOR_b;
    stc_tmra_iconr_bit_t                     ICONR_b;
    stc_tmra_econr_bit_t                     ECONR_b;
    stc_tmra_fconr_bit_t                     FCONR_b;
    stc_tmra_stflr_bit_t                     STFLR_b;
    uint32_t                                 RESERVED2[256];
    stc_tmra_bconr_bit_t                     BCONR1_b;
    uint32_t                                 RESERVED3[32];
    stc_tmra_bconr_bit_t                     BCONR2_b;
    uint32_t                                 RESERVED4[416];
    stc_tmra_cconr_bit_t                     CCONR1_b;
    stc_tmra_cconr_bit_t                     CCONR2_b;
    stc_tmra_cconr_bit_t                     CCONR3_b;
    stc_tmra_cconr_bit_t                     CCONR4_b;
    uint32_t                                 RESERVED5[384];
    stc_tmra_pconr_bit_t                     PCONR1_b;
    stc_tmra_pconr_bit_t                     PCONR2_b;
    stc_tmra_pconr_bit_t                     PCONR3_b;
    stc_tmra_pconr_bit_t                     PCONR4_b;
} bM4_TMRA_TypeDef;

typedef struct
{
    stc_trng_cr_bit_t                        CR_b;
    stc_trng_mr_bit_t                        MR_b;
} bM4_TRNG_TypeDef;

typedef struct
{
    stc_usart_sr_bit_t                       SR_b;
    stc_usart_dr_bit_t                       DR_b;
    uint32_t                                 RESERVED0[32];
    stc_usart_cr1_bit_t                      CR1_b;
    stc_usart_cr2_bit_t                      CR2_b;
    stc_usart_cr3_bit_t                      CR3_b;
    stc_usart_pr_bit_t                       PR_b;
} bM4_USART_TypeDef;

