levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    stc_usbfs_gotgctl_bit_t                  GOTGCTL_b;
    stc_usbfs_gotgint_bit_t                  GOTGINT_b;
    stc_usbfs_gahbcfg_bit_t                  GAHBCFG_b;
    stc_usbfs_gusbcfg_bit_t                  GUSBCFG_b;
    stc_usbfs_grstctl_bit_t                  GRSTCTL_b;
    stc_usbfs_gintsts_bit_t                  GINTSTS_b;
    stc_usbfs_gintmsk_bit_t                  GINTMSK_b;
    stc_usbfs_grxstsr_bit_t                  GRXSTSR_b;
    stc_usbfs_grxstsp_bit_t                  GRXSTSP_b;
    stc_usbfs_grxfsiz_bit_t                  GRXFSIZ_b;
    uint32_t                                 RESERVED0[32];
    stc_usbfs_gnptxsts_bit_t                 GNPTXSTS_b;
    uint32_t                                 RESERVED1[288];
    stc_usbfs_glpmcfg_bit_t                  GLPMCFG_b;
    uint32_t                                 RESERVED2[7488];
    stc_usbfs_hcfg_bit_t                     HCFG_b;
    stc_usbfs_hfir_bit_t                     HFIR_b;
    uint32_t                                 RESERVED3[64];
    stc_usbfs_hptxsts_bit_t                  HPTXSTS_b;
    stc_usbfs_haint_bit_t                    HAINT_b;
    stc_usbfs_haintmsk_bit_t                 HAINTMSK_b;
    uint32_t                                 RESERVED4[288];
    stc_usbfs_hprt_bit_t                     HPRT_b;
    uint32_t                                 RESERVED5[1504];
    stc_usbfs_hcchar0_bit_t                  HCCHAR0_b;
    stc_usbfs_hcsplt0_bit_t                  HCSPLT0_b;
    stc_usbfs_hcint0_bit_t                   HCINT0_b;
    stc_usbfs_hcintmsk0_bit_t                HCINTMSK0_b;
    stc_usbfs_hctsiz0_bit_t                  HCTSIZ0_b;
    uint32_t                                 RESERVED6[96];
    stc_usbfs_hcchar1_bit_t                  HCCHAR1_b;
    stc_usbfs_hcsplt1_bit_t                  HCSPLT1_b;
    stc_usbfs_hcint1_bit_t                   HCINT1_b;
    stc_usbfs_hcintmsk1_bit_t                HCINTMSK1_b;
    stc_usbfs_hctsiz1_bit_t                  HCTSIZ1_b;
    uint32_t                                 RESERVED7[96];
    stc_usbfs_hcchar2_bit_t                  HCCHAR2_b;
    stc_usbfs_hcsplt2_bit_t                  HCSPLT2_b;
    stc_usbfs_hcint2_bit_t                   HCINT2_b;
    stc_usbfs_hcintmsk2_bit_t                HCINTMSK2_b;
    stc_usbfs_hctsiz2_bit_t                  HCTSIZ2_b;
    uint32_t                                 RESERVED8[96];
    stc_usbfs_hcchar3_bit_t                  HCCHAR3_b;
    stc_usbfs_hcsplt3_bit_t                  HCSPLT3_b;
    stc_usbfs_hcint3_bit_t                   HCINT3_b;
    stc_usbfs_hcintmsk3_bit_t                HCINTMSK3_b;
    stc_usbfs_hctsiz3_bit_t                  HCTSIZ3_b;
    uint32_t                                 RESERVED9[96];
    stc_usbfs_hcchar4_bit_t                  HCCHAR4_b;
    stc_usbfs_hcsplt4_bit_t                  HCSPLT4_b;
    stc_usbfs_hcint4_bit_t                   HCINT4_b;
    stc_usbfs_hcintmsk4_bit_t                HCINTMSK4_b;
    stc_usbfs_hctsiz4_bit_t                  HCTSIZ4_b;
    uint32_t                                 RESERVED10[96];
    stc_usbfs_hcchar5_bit_t                  HCCHAR5_b;
    stc_usbfs_hcsplt5_bit_t                  HCSPLT5_b;
    stc_usbfs_hcint5_bit_t                   HCINT5_b;
    stc_usbfs_hcintmsk5_bit_t                HCINTMSK5_b;
    stc_usbfs_hctsiz5_bit_t                  HCTSIZ5_b;
    uint32_t                                 RESERVED11[96];
    stc_usbfs_hcchar6_bit_t                  HCCHAR6_b;
    stc_usbfs_hcsplt6_bit_t                  HCSPLT6_b;
    stc_usbfs_hcint6_bit_t                   HCINT6_b;
    stc_usbfs_hcintmsk6_bit_t                HCINTMSK6_b;
    stc_usbfs_hctsiz6_bit_t                  HCTSIZ6_b;
    uint32_t                                 RESERVED12[96];
    stc_usbfs_hcchar7_bit_t                  HCCHAR7_b;
    stc_usbfs_hcsplt7_bit_t                  HCSPLT7_b;
    stc_usbfs_hcint7_bit_t                   HCINT7_b;
    stc_usbfs_hcintmsk7_bit_t                HCINTMSK7_b;
    stc_usbfs_hctsiz7_bit_t                  HCTSIZ7_b;
    uint32_t                                 RESERVED13[96];
    stc_usbfs_hcchar8_bit_t                  HCCHAR8_b;
    stc_usbfs_hcsplt8_bit_t                  HCSPLT8_b;
    stc_usbfs_hcint8_bit_t                   HCINT8_b;
    stc_usbfs_hcintmsk8_bit_t                HCINTMSK8_b;
    stc_usbfs_hctsiz8_bit_t                  HCTSIZ8_b;
    uint32_t                                 RESERVED14[96];
    stc_usbfs_hcchar9_bit_t                  HCCHAR9_b;
    stc_usbfs_hcsplt9_bit_t                  HCSPLT9_b;
    stc_usbfs_hcint9_bit_t                   HCINT9_b;
    stc_usbfs_hcintmsk9_bit_t                HCINTMSK9_b;
    stc_usbfs_hctsiz9_bit_t                  HCTSIZ9_b;
    uint32_t                                 RESERVED15[96];
    stc_usbfs_hcchar10_bit_t                 HCCHAR10_b;
    stc_usbfs_hcsplt10_bit_t                 HCSPLT10_b;
    stc_usbfs_hcint10_bit_t                  HCINT10_b;
    stc_usbfs_hcintmsk10_bit_t               HCINTMSK10_b;
    stc_usbfs_hctsiz10_bit_t                 HCTSIZ10_b;
    uint32_t                                 RESERVED16[96];
    stc_usbfs_hcchar11_bit_t                 HCCHAR11_b;
    stc_usbfs_hcsplt11_bit_t                 HCSPLT11_b;
    stc_usbfs_hcint11_bit_t                  HCINT11_b;
    stc_usbfs_hcintmsk11_bit_t               HCINTMSK11_b;
    stc_usbfs_hctsiz11_bit_t                 HCTSIZ11_b;
    uint32_t                                 RESERVED17[96];
    stc_usbfs_hcchar12_bit_t                 HCCHAR12_b;
    stc_usbfs_hcsplt12_bit_t                 HCSPLT12_b;
    stc_usbfs_hcint12_bit_t                  HCINT12_b;
    stc_usbfs_hcintmsk12_bit_t               HCINTMSK12_b;
    stc_usbfs_hctsiz12_bit_t                 HCTSIZ12_b;
    uint32_t                                 RESERVED18[96];
    stc_usbfs_hcchar13_bit_t                 HCCHAR13_b;
    stc_usbfs_hcsplt13_bit_t                 HCSPLT13_b;
    stc_usbfs_hcint13_bit_t                  HCINT13_b;
    stc_usbfs_hcintmsk13_bit_t               HCINTMSK13_b;
    stc_usbfs_hctsiz13_bit_t                 HCTSIZ13_b;
    uint32_t                                 RESERVED19[96];
    stc_usbfs_hcchar14_bit_t                 HCCHAR14_b;
    stc_usbfs_hcsplt14_bit_t                 HCSPLT14_b;
    stc_usbfs_hcint14_bit_t                  HCINT14_b;
    stc_usbfs_hcintmsk14_bit_t               HCINTMSK14_b;
    stc_usbfs_hctsiz14_bit_t                 HCTSIZ14_b;
    uint32_t                                 RESERVED20[96];
    stc_usbfs_hcchar15_bit_t                 HCCHAR15_b;
    stc_usbfs_hcsplt15_bit_t                 HCSPLT15_b;
    stc_usbfs_hcint15_bit_t                  HCINT15_b;
    stc_usbfs_hcintmsk15_bit_t               HCINTMSK15_b;
    stc_usbfs_hctsiz15_bit_t                 HCTSIZ15_b;
    uint32_t                                 RESERVED21[2144];
    stc_usbfs_dcfg_bit_t                     DCFG_b;
    stc_usbfs_dctl_bit_t                     DCTL_b;
    stc_usbfs_dsts_bit_t                     DSTS_b;
    uint32_t                                 RESERVED22[32];
    stc_usbfs_diepmsk_bit_t                  DIEPMSK_b;
    stc_usbfs_doepmsk_bit_t                  DOEPMSK_b;
    stc_usbfs_daint_bit_t                    DAINT_b;
    stc_usbfs_daintmsk_bit_t                 DAINTMSK_b;
    uint32_t                                 RESERVED23[160];
    stc_usbfs_diepempmsk_bit_t               DIEPEMPMSK_b;
    uint32_t                                 RESERVED24[1600];
    stc_usbfs_diepctl0_bit_t                 DIEPCTL0_b;
    uint32_t                                 RESERVED25[32];
    stc_usbfs_diepint0_bit_t                 DIEPINT0_b;
    uint32_t                                 RESERVED26[96];
    stc_usbfs_dtxfsts0_bit_t                 DTXFSTS0_b;
    uint32_t                                 RESERVED27[32];
    stc_usbfs_diepctl1_bit_t                 DIEPCTL1_b;
    uint32_t                                 RESERVED28[32];
    stc_usbfs_diepint1_bit_t                 DIEPINT1_b;
    uint32_t                                 RESERVED29[160];
    stc_usbfs_diepctl2_bit_t                 DIEPCTL2_b;
    uint32_t                                 RESERVED30[32];
    stc_usbfs_diepint2_bit_t                 DIEPINT2_b;
    uint32_t                                 RESERVED31[160];
    stc_usbfs_diepctl3_bit_t                 DIEPCTL3_b;
    uint32_t                                 RESERVED32[32];
    stc_usbfs_diepint3_bit_t                 DIEPINT3_b;
    uint32_t                                 RESERVED33[160];
    stc_usbfs_diepctl4_bit_t                 DIEPCTL4_b;
    uint32_t                                 RESERVED34[32];
    stc_usbfs_diepint4_bit_t                 DIEPINT4_b;
    uint32_t                                 RESERVED35[160];
    stc_usbfs_diepctl5_bit_t                 DIEPCTL5_b;
    uint32_t                                 RESERVED36[32];
    stc_usbfs_diepint5_bit_t                 DIEPINT5_b;
    uint32_t                                 RESERVED37[160];
    stc_usbfs_diepctl6_bit_t                 DIEPCTL6_b;
    uint32_t                                 RESERVED38[32];
    stc_usbfs_diepint6_bit_t                 DIEPINT6_b;
    uint32_t                                 RESERVED39[160];
    stc_usbfs_diepctl7_bit_t                 DIEPCTL7_b;
    uint32_t                                 RESERVED40[32];
    stc_usbfs_diepint7_bit_t                 DIEPINT7_b;
    uint32_t                                 RESERVED41[160];
    stc_usbfs_diepctl8_bit_t                 DIEPCTL8_b;
    uint32_t                                 RESERVED42[32];
    stc_usbfs_diepint8_bit_t                 DIEPINT8_b;
    uint32_t                                 RESERVED43[160];
    stc_usbfs_diepctl9_bit_t                 DIEPCTL9_b;
    uint32_t                                 RESERVED44[32];
    stc_usbfs_diepint9_bit_t                 DIEPINT9_b;
    uint32_t                                 RESERVED45[160];
    stc_usbfs_diepctl10_bit_t                DIEPCTL10_b;
    uint32_t                                 RESERVED46[32];
    stc_usbfs_diepint10_bit_t                DIEPINT10_b;
    uint32_t                                 RESERVED47[160];
    stc_usbfs_diepctl11_bit_t                DIEPCTL11_b;
    uint32_t                                 RESERVED48[32];
    stc_usbfs_diepint11_bit_t                DIEPINT11_b;
    uint32_t                                 RESERVED49[160];
    stc_usbfs_diepctl12_bit_t                DIEPCTL12_b;
    uint32_t                                 RESERVED50[32];
    stc_usbfs_diepint12_bit_t                DIEPINT12_b;
    uint32_t                                 RESERVED51[160];
    stc_usbfs_diepctl13_bit_t                DIEPCTL13_b;
    uint32_t                                 RESERVED52[32];
    stc_usbfs_diepint13_bit_t                DIEPINT13_b;
    uint32_t                                 RESERVED53[160];
    stc_usbfs_diepctl14_bit_t                DIEPCTL14_b;
    uint32_t                                 RESERVED54[32];
    stc_usbfs_diepint14_bit_t                DIEPINT14_b;
    uint32_t                                 RESERVED55[160];
    stc_usbfs_diepctl15_bit_t                DIEPCTL15_b;
    uint32_t                                 RESERVED56[32];
    stc_usbfs_diepint15_bit_t                DIEPINT15_b;
    uint32_t                                 RESERVED57[160];
    stc_usbfs_doepctl0_bit_t                 DOEPCTL0_b;
    uint32_t                                 RESERVED58[32];
    stc_usbfs_doepint0_bit_t                 DOEPINT0_b;
    uint32_t                                 RESERVED59[160];
    stc_usbfs_doepctl1_bit_t                 DOEPCTL1_b;
    uint32_t                                 RESERVED60[32];
    stc_usbfs_doepint1_bit_t                 DOEPINT1_b;
    uint32_t                                 RESERVED61[32];
    stc_usbfs_doeptsiz1_bit_t                DOEPTSIZ1_b;
    uint32_t                                 RESERVED62[96];
    stc_usbfs_doepctl2_bit_t                 DOEPCTL2_b;
    uint32_t                                 RESERVED63[32];
    stc_usbfs_doepint2_bit_t                 DOEPINT2_b;
    uint32_t                                 RESERVED64[32];
    stc_usbfs_doeptsiz2_bit_t                DOEPTSIZ2_b;
    uint32_t                                 RESERVED65[96];
    stc_usbfs_doepctl3_bit_t                 DOEPCTL3_b;
    uint32_t                                 RESERVED66[32];
    stc_usbfs_doepint3_bit_t                 DOEPINT3_b;
    uint32_t                                 RESERVED67[32];
    stc_usbfs_doeptsiz3_bit_t                DOEPTSIZ3_b;
    uint32_t                                 RESERVED68[96];
    stc_usbfs_doepctl4_bit_t                 DOEPCTL4_b;
    uint32_t                                 RESERVED69[32];
    stc_usbfs_doepint4_bit_t                 DOEPINT4_b;
    uint32_t                                 RESERVED70[32];
    stc_usbfs_doeptsiz4_bit_t                DOEPTSIZ4_b;
    uint32_t                                 RESERVED71[96];
    stc_usbfs_doepctl5_bit_t                 DOEPCTL5_b;
    uint32_t                                 RESERVED72[32];
    stc_usbfs_doepint5_bit_t                 DOEPINT5_b;
    uint32_t                                 RESERVED73[32];
    stc_usbfs_doeptsiz5_bit_t                DOEPTSIZ5_b;
    uint32_t                                 RESERVED74[96];
    stc_usbfs_doepctl6_bit_t                 DOEPCTL6_b;
    uint32_t                                 RESERVED75[32];
    stc_usbfs_doepint6_bit_t                 DOEPINT6_b;
    uint32_t                                 RESERVED76[32];
    stc_usbfs_doeptsiz6_bit_t                DOEPTSIZ6_b;
    uint32_t                                 RESERVED77[96];
    stc_usbfs_doepctl7_bit_t                 DOEPCTL7_b;
    uint32_t                                 RESERVED78[32];
    stc_usbfs_doepint7_bit_t                 DOEPINT7_b;
    uint32_t                                 RESERVED79[32];
    stc_usbfs_doeptsiz7_bit_t                DOEPTSIZ7_b;
    uint32_t                                 RESERVED80[96];
    stc_usbfs_doepctl8_bit_t                 DOEPCTL8_b;
    uint32_t                                 RESERVED81[32];
    stc_usbfs_doepint8_bit_t                 DOEPINT8_b;
    uint32_t                                 RESERVED82[32];
    stc_usbfs_doeptsiz8_bit_t                DOEPTSIZ8_b;
    uint32_t                                 RESERVED83[96];
    stc_usbfs_doepctl9_bit_t                 DOEPCTL9_b;
    uint32_t                                 RESERVED84[32];
    stc_usbfs_doepint9_bit_t                 DOEPINT9_b;
    uint32_t                                 RESERVED85[32];
    stc_usbfs_doeptsiz9_bit_t                DOEPTSIZ9_b;
    uint32_t                                 RESERVED86[96];
    stc_usbfs_doepctl10_bit_t                DOEPCTL10_b;
    uint32_t                                 RESERVED87[32];
    stc_usbfs_doepint10_bit_t                DOEPINT10_b;
    uint32_t                                 RESERVED88[32];
    stc_usbfs_doeptsiz10_bit_t               DOEPTSIZ10_b;
    uint32_t                                 RESERVED89[96];
    stc_usbfs_doepctl11_bit_t                DOEPCTL11_b;
    uint32_t                                 RESERVED90[32];
    stc_usbfs_doepint11_bit_t                DOEPINT11_b;
    uint32_t                                 RESERVED91[32];
    stc_usbfs_doeptsiz11_bit_t               DOEPTSIZ11_b;
    uint32_t                                 RESERVED92[96];
    stc_usbfs_doepctl12_bit_t                DOEPCTL12_b;
    uint32_t                                 RESERVED93[32];
    stc_usbfs_doepint12_bit_t                DOEPINT12_b;
    uint32_t                                 RESERVED94[32];
    stc_usbfs_doeptsiz12_bit_t               DOEPTSIZ12_b;
    uint32_t                                 RESERVED95[96];
    stc_usbfs_doepctl13_bit_t                DOEPCTL13_b;
    uint32_t                                 RESERVED96[32];
    stc_usbfs_doepint13_bit_t                DOEPINT13_b;
    uint32_t                                 RESERVED97[32];
    stc_usbfs_doeptsiz13_bit_t               DOEPTSIZ13_b;
    uint32_t                                 RESERVED98[96];
    stc_usbfs_doepctl14_bit_t                DOEPCTL14_b;
    uint32_t                                 RESERVED99[32];
    stc_usbfs_doepint14_bit_t                DOEPINT14_b;
    uint32_t                                 RESERVED100[32];
    stc_usbfs_doeptsiz14_bit_t               DOEPTSIZ14_b;
    uint32_t                                 RESERVED101[96];
    stc_usbfs_doepctl15_bit_t                DOEPCTL15_b;
    uint32_t                                 RESERVED102[32];
    stc_usbfs_doepint15_bit_t                DOEPINT15_b;
    uint32_t                                 RESERVED103[32];
    stc_usbfs_doeptsiz15_bit_t               DOEPTSIZ15_b;
    uint32_t                                 RESERVED104[2144];
    stc_usbfs_pcgcctl_bit_t                  PCGCCTL_b;
} bM4_USBFS_TypeDef;

