levizh/my_lvgl_tutorial/mcu/common/hc32f4a0_.h
typedef struct
{
    stc_usbhs_gotgctl_bit_t                  GOTGCTL_b;
    stc_usbhs_gotgint_bit_t                  GOTGINT_b;
    stc_usbhs_gahbcfg_bit_t                  GAHBCFG_b;
    stc_usbhs_gusbcfg_bit_t                  GUSBCFG_b;
    stc_usbhs_grstctl_bit_t                  GRSTCTL_b;
    stc_usbhs_gintsts_bit_t                  GINTSTS_b;
    stc_usbhs_gintmsk_bit_t                  GINTMSK_b;
    stc_usbhs_grxstsr_bit_t                  GRXSTSR_b;
    stc_usbhs_grxstsp_bit_t                  GRXSTSP_b;
    stc_usbhs_grxfsiz_bit_t                  GRXFSIZ_b;
    stc_usbhs_gnptxfsiz_bit_t                GNPTXFSIZ_b;
    stc_usbhs_gnptxsts_bit_t                 GNPTXSTS_b;
    uint32_t                                 RESERVED0[32];
    stc_usbhs_gpvndctl_bit_t                 GPVNDCTL_b;
    uint32_t                                 RESERVED1[224];
    stc_usbhs_glpmcfg_bit_t                  GLPMCFG_b;
    uint32_t                                 RESERVED2[32];
    stc_usbhs_gdfifocfg_bit_t                GDFIFOCFG_b;
    uint32_t                                 RESERVED3[1280];
    stc_usbhs_hptxfsiz_bit_t                 HPTXFSIZ_b;
    stc_usbhs_dieptxf1_bit_t                 DIEPTXF1_b;
    stc_usbhs_dieptxf2_bit_t                 DIEPTXF2_b;
    stc_usbhs_dieptxf3_bit_t                 DIEPTXF3_b;
    stc_usbhs_dieptxf4_bit_t                 DIEPTXF4_b;
    stc_usbhs_dieptxf5_bit_t                 DIEPTXF5_b;
    stc_usbhs_dieptxf6_bit_t                 DIEPTXF6_b;
    stc_usbhs_dieptxf7_bit_t                 DIEPTXF7_b;
    stc_usbhs_dieptxf8_bit_t                 DIEPTXF8_b;
    stc_usbhs_dieptxf9_bit_t                 DIEPTXF9_b;
    stc_usbhs_dieptxf10_bit_t                DIEPTXF10_b;
    stc_usbhs_dieptxf11_bit_t                DIEPTXF11_b;
    stc_usbhs_dieptxf12_bit_t                DIEPTXF12_b;
    stc_usbhs_dieptxf13_bit_t                DIEPTXF13_b;
    stc_usbhs_dieptxf14_bit_t                DIEPTXF14_b;
    stc_usbhs_dieptxf15_bit_t                DIEPTXF15_b;
    uint32_t                                 RESERVED4[5632];
    stc_usbhs_hcfg_bit_t                     HCFG_b;
    stc_usbhs_hfir_bit_t                     HFIR_b;
    stc_usbhs_hfnum_bit_t                    HFNUM_b;
    uint32_t                                 RESERVED5[32];
    stc_usbhs_hptxsts_bit_t                  HPTXSTS_b;
    stc_usbhs_haint_bit_t                    HAINT_b;
    stc_usbhs_haintmsk_bit_t                 HAINTMSK_b;
    uint32_t                                 RESERVED6[288];
    stc_usbhs_hprt_bit_t                     HPRT_b;
    uint32_t                                 RESERVED7[1504];
    stc_usbhs_hcchar0_bit_t                  HCCHAR0_b;
    stc_usbhs_hcsplt0_bit_t                  HCSPLT0_b;
    stc_usbhs_hcint0_bit_t                   HCINT0_b;
    stc_usbhs_hcintmsk0_bit_t                HCINTMSK0_b;
    stc_usbhs_hctsiz0_bit_t                  HCTSIZ0_b;
    uint32_t                                 RESERVED8[96];
    stc_usbhs_hcchar1_bit_t                  HCCHAR1_b;
    stc_usbhs_hcsplt1_bit_t                  HCSPLT1_b;
    stc_usbhs_hcint1_bit_t                   HCINT1_b;
    stc_usbhs_hcintmsk1_bit_t                HCINTMSK1_b;
    stc_usbhs_hctsiz1_bit_t                  HCTSIZ1_b;
    uint32_t                                 RESERVED9[96];
    stc_usbhs_hcchar2_bit_t                  HCCHAR2_b;
    stc_usbhs_hcsplt2_bit_t                  HCSPLT2_b;
    stc_usbhs_hcint2_bit_t                   HCINT2_b;
    stc_usbhs_hcintmsk2_bit_t                HCINTMSK2_b;
    stc_usbhs_hctsiz2_bit_t                  HCTSIZ2_b;
    uint32_t                                 RESERVED10[96];
    stc_usbhs_hcchar3_bit_t                  HCCHAR3_b;
    stc_usbhs_hcsplt3_bit_t                  HCSPLT3_b;
    stc_usbhs_hcint3_bit_t                   HCINT3_b;
    stc_usbhs_hcintmsk3_bit_t                HCINTMSK3_b;
    stc_usbhs_hctsiz3_bit_t                  HCTSIZ3_b;
    uint32_t                                 RESERVED11[96];
    stc_usbhs_hcchar4_bit_t                  HCCHAR4_b;
    stc_usbhs_hcsplt4_bit_t                  HCSPLT4_b;
    stc_usbhs_hcint4_bit_t                   HCINT4_b;
    stc_usbhs_hcintmsk4_bit_t                HCINTMSK4_b;
    stc_usbhs_hctsiz4_bit_t                  HCTSIZ4_b;
    uint32_t                                 RESERVED12[96];
    stc_usbhs_hcchar5_bit_t                  HCCHAR5_b;
    stc_usbhs_hcsplt5_bit_t                  HCSPLT5_b;
    stc_usbhs_hcint5_bit_t                   HCINT5_b;
    stc_usbhs_hcintmsk5_bit_t                HCINTMSK5_b;
    stc_usbhs_hctsiz5_bit_t                  HCTSIZ5_b;
    uint32_t                                 RESERVED13[96];
    stc_usbhs_hcchar6_bit_t                  HCCHAR6_b;
    stc_usbhs_hcsplt6_bit_t                  HCSPLT6_b;
    stc_usbhs_hcint6_bit_t                   HCINT6_b;
    stc_usbhs_hcintmsk6_bit_t                HCINTMSK6_b;
    stc_usbhs_hctsiz6_bit_t                  HCTSIZ6_b;
    uint32_t                                 RESERVED14[96];
    stc_usbhs_hcchar7_bit_t                  HCCHAR7_b;
    stc_usbhs_hcsplt7_bit_t                  HCSPLT7_b;
    stc_usbhs_hcint7_bit_t                   HCINT7_b;
    stc_usbhs_hcintmsk7_bit_t                HCINTMSK7_b;
    stc_usbhs_hctsiz7_bit_t                  HCTSIZ7_b;
    uint32_t                                 RESERVED15[96];
    stc_usbhs_hcchar8_bit_t                  HCCHAR8_b;
    stc_usbhs_hcsplt8_bit_t                  HCSPLT8_b;
    stc_usbhs_hcint8_bit_t                   HCINT8_b;
    stc_usbhs_hcintmsk8_bit_t                HCINTMSK8_b;
    stc_usbhs_hctsiz8_bit_t                  HCTSIZ8_b;
    uint32_t                                 RESERVED16[96];
    stc_usbhs_hcchar9_bit_t                  HCCHAR9_b;
    stc_usbhs_hcsplt9_bit_t                  HCSPLT9_b;
    stc_usbhs_hcint9_bit_t                   HCINT9_b;
    stc_usbhs_hcintmsk9_bit_t                HCINTMSK9_b;
    stc_usbhs_hctsiz9_bit_t                  HCTSIZ9_b;
    uint32_t                                 RESERVED17[96];
    stc_usbhs_hcchar10_bit_t                 HCCHAR10_b;
    stc_usbhs_hcsplt10_bit_t                 HCSPLT10_b;
    stc_usbhs_hcint10_bit_t                  HCINT10_b;
    stc_usbhs_hcintmsk10_bit_t               HCINTMSK10_b;
    stc_usbhs_hctsiz10_bit_t                 HCTSIZ10_b;
    uint32_t                                 RESERVED18[96];
    stc_usbhs_hcchar11_bit_t                 HCCHAR11_b;
    stc_usbhs_hcsplt11_bit_t                 HCSPLT11_b;
    stc_usbhs_hcint11_bit_t                  HCINT11_b;
    stc_usbhs_hcintmsk11_bit_t               HCINTMSK11_b;
    stc_usbhs_hctsiz11_bit_t                 HCTSIZ11_b;
    uint32_t                                 RESERVED19[96];
    stc_usbhs_hcchar12_bit_t                 HCCHAR12_b;
    stc_usbhs_hcsplt12_bit_t                 HCSPLT12_b;
    stc_usbhs_hcint12_bit_t                  HCINT12_b;
    stc_usbhs_hcintmsk12_bit_t               HCINTMSK12_b;
    stc_usbhs_hctsiz12_bit_t                 HCTSIZ12_b;
    uint32_t                                 RESERVED20[96];
    stc_usbhs_hcchar13_bit_t                 HCCHAR13_b;
    stc_usbhs_hcsplt13_bit_t                 HCSPLT13_b;
    stc_usbhs_hcint13_bit_t                  HCINT13_b;
    stc_usbhs_hcintmsk13_bit_t               HCINTMSK13_b;
    stc_usbhs_hctsiz13_bit_t                 HCTSIZ13_b;
    uint32_t                                 RESERVED21[96];
    stc_usbhs_hcchar14_bit_t                 HCCHAR14_b;
    stc_usbhs_hcsplt14_bit_t                 HCSPLT14_b;
    stc_usbhs_hcint14_bit_t                  HCINT14_b;
    stc_usbhs_hcintmsk14_bit_t               HCINTMSK14_b;
    stc_usbhs_hctsiz14_bit_t                 HCTSIZ14_b;
    uint32_t                                 RESERVED22[96];
    stc_usbhs_hcchar15_bit_t                 HCCHAR15_b;
    stc_usbhs_hcsplt15_bit_t                 HCSPLT15_b;
    stc_usbhs_hcint15_bit_t                  HCINT15_b;
    stc_usbhs_hcintmsk15_bit_t               HCINTMSK15_b;
    stc_usbhs_hctsiz15_bit_t                 HCTSIZ15_b;
    uint32_t                                 RESERVED23[2144];
    stc_usbhs_dcfg_bit_t                     DCFG_b;
    stc_usbhs_dctl_bit_t                     DCTL_b;
    stc_usbhs_dsts_bit_t                     DSTS_b;
    uint32_t                                 RESERVED24[32];
    stc_usbhs_diepmsk_bit_t                  DIEPMSK_b;
    stc_usbhs_doepmsk_bit_t                  DOEPMSK_b;
    stc_usbhs_daint_bit_t                    DAINT_b;
    stc_usbhs_daintmsk_bit_t                 DAINTMSK_b;
    uint32_t                                 RESERVED25[128];
    stc_usbhs_dthrctl_bit_t                  DTHRCTL_b;
    stc_usbhs_diepempmsk_bit_t               DIEPEMPMSK_b;
    stc_usbhs_deachint_bit_t                 DEACHINT_b;
    stc_usbhs_deachintmsk_bit_t              DEACHINTMSK_b;
    uint32_t                                 RESERVED26[32];
    stc_usbhs_diepeachmsk1_bit_t             DIEPEACHMSK1_b;
    uint32_t                                 RESERVED27[480];
    stc_usbhs_doepeachmsk1_bit_t             DOEPEACHMSK1_b;
    uint32_t                                 RESERVED28[960];
    stc_usbhs_diepctl0_bit_t                 DIEPCTL0_b;
    uint32_t                                 RESERVED29[32];
    stc_usbhs_diepint0_bit_t                 DIEPINT0_b;
    uint32_t                                 RESERVED30[32];
    stc_usbhs_dieptsiz0_bit_t                DIEPTSIZ0_b;
    uint32_t                                 RESERVED31[32];
    stc_usbhs_dtxfsts0_bit_t                 DTXFSTS0_b;
    uint32_t                                 RESERVED32[32];
    stc_usbhs_diepctl1_bit_t                 DIEPCTL1_b;
    uint32_t                                 RESERVED33[32];
    stc_usbhs_diepint1_bit_t                 DIEPINT1_b;
    uint32_t                                 RESERVED34[32];
    stc_usbhs_dieptsiz1_bit_t                DIEPTSIZ1_b;
    uint32_t                                 RESERVED35[32];
    stc_usbhs_dtxfsts1_bit_t                 DTXFSTS1_b;
    uint32_t                                 RESERVED36[32];
    stc_usbhs_diepctl2_bit_t                 DIEPCTL2_b;
    uint32_t                                 RESERVED37[32];
    stc_usbhs_diepint2_bit_t                 DIEPINT2_b;
    uint32_t                                 RESERVED38[32];
    stc_usbhs_dieptsiz2_bit_t                DIEPTSIZ2_b;
    uint32_t                                 RESERVED39[32];
    stc_usbhs_dtxfsts2_bit_t                 DTXFSTS2_b;
    uint32_t                                 RESERVED40[32];
    stc_usbhs_diepctl3_bit_t                 DIEPCTL3_b;
    uint32_t                                 RESERVED41[32];
    stc_usbhs_diepint3_bit_t                 DIEPINT3_b;
    uint32_t                                 RESERVED42[32];
    stc_usbhs_dieptsiz3_bit_t                DIEPTSIZ3_b;
    uint32_t                                 RESERVED43[32];
    stc_usbhs_dtxfsts3_bit_t                 DTXFSTS3_b;
    uint32_t                                 RESERVED44[32];
    stc_usbhs_diepctl4_bit_t                 DIEPCTL4_b;
    uint32_t                                 RESERVED45[32];
    stc_usbhs_diepint4_bit_t                 DIEPINT4_b;
    uint32_t                                 RESERVED46[32];
    stc_usbhs_dieptsiz4_bit_t                DIEPTSIZ4_b;
    uint32_t                                 RESERVED47[32];
    stc_usbhs_dtxfsts4_bit_t                 DTXFSTS4_b;
    uint32_t                                 RESERVED48[32];
    stc_usbhs_diepctl5_bit_t                 DIEPCTL5_b;
    uint32_t                                 RESERVED49[32];
    stc_usbhs_diepint5_bit_t                 DIEPINT5_b;
    uint32_t                                 RESERVED50[32];
    stc_usbhs_dieptsiz5_bit_t                DIEPTSIZ5_b;
    uint32_t                                 RESERVED51[32];
    stc_usbhs_dtxfsts5_bit_t                 DTXFSTS5_b;
    uint32_t                                 RESERVED52[32];
    stc_usbhs_diepctl6_bit_t                 DIEPCTL6_b;
    uint32_t                                 RESERVED53[32];
    stc_usbhs_diepint6_bit_t                 DIEPINT6_b;
    uint32_t                                 RESERVED54[32];
    stc_usbhs_dieptsiz6_bit_t                DIEPTSIZ6_b;
    uint32_t                                 RESERVED55[32];
    stc_usbhs_dtxfsts6_bit_t                 DTXFSTS6_b;
    uint32_t                                 RESERVED56[32];
    stc_usbhs_diepctl7_bit_t                 DIEPCTL7_b;
    uint32_t                                 RESERVED57[32];
    stc_usbhs_diepint7_bit_t                 DIEPINT7_b;
    uint32_t                                 RESERVED58[32];
    stc_usbhs_dieptsiz7_bit_t                DIEPTSIZ7_b;
    uint32_t                                 RESERVED59[32];
    stc_usbhs_dtxfsts7_bit_t                 DTXFSTS7_b;
    uint32_t                                 RESERVED60[32];
    stc_usbhs_diepctl8_bit_t                 DIEPCTL8_b;
    uint32_t                                 RESERVED61[32];
    stc_usbhs_diepint8_bit_t                 DIEPINT8_b;
    uint32_t                                 RESERVED62[32];
    stc_usbhs_dieptsiz8_bit_t                DIEPTSIZ8_b;
    uint32_t                                 RESERVED63[32];
    stc_usbhs_dtxfsts8_bit_t                 DTXFSTS8_b;
    uint32_t                                 RESERVED64[32];
    stc_usbhs_diepctl9_bit_t                 DIEPCTL9_b;
    uint32_t                                 RESERVED65[32];
    stc_usbhs_diepint9_bit_t                 DIEPINT9_b;
    uint32_t                                 RESERVED66[32];
    stc_usbhs_dieptsiz9_bit_t                DIEPTSIZ9_b;
    uint32_t                                 RESERVED67[32];
    stc_usbhs_dtxfsts9_bit_t                 DTXFSTS9_b;
    uint32_t                                 RESERVED68[32];
    stc_usbhs_diepctl10_bit_t                DIEPCTL10_b;
    uint32_t                                 RESERVED69[32];
    stc_usbhs_diepint10_bit_t                DIEPINT10_b;
    uint32_t                                 RESERVED70[32];
    stc_usbhs_dieptsiz10_bit_t               DIEPTSIZ10_b;
    uint32_t                                 RESERVED71[32];
    stc_usbhs_dtxfsts10_bit_t                DTXFSTS10_b;
    uint32_t                                 RESERVED72[32];
    stc_usbhs_diepctl11_bit_t                DIEPCTL11_b;
    uint32_t                                 RESERVED73[32];
    stc_usbhs_diepint11_bit_t                DIEPINT11_b;
    uint32_t                                 RESERVED74[32];
    stc_usbhs_dieptsiz11_bit_t               DIEPTSIZ11_b;
    uint32_t                                 RESERVED75[32];
    stc_usbhs_dtxfsts11_bit_t                DTXFSTS11_b;
    uint32_t                                 RESERVED76[32];
    stc_usbhs_diepctl12_bit_t                DIEPCTL12_b;
    uint32_t                                 RESERVED77[32];
    stc_usbhs_diepint12_bit_t                DIEPINT12_b;
    uint32_t                                 RESERVED78[32];
    stc_usbhs_dieptsiz12_bit_t               DIEPTSIZ12_b;
    uint32_t                                 RESERVED79[32];
    stc_usbhs_dtxfsts12_bit_t                DTXFSTS12_b;
    uint32_t                                 RESERVED80[32];
    stc_usbhs_diepctl13_bit_t                DIEPCTL13_b;
    uint32_t                                 RESERVED81[32];
    stc_usbhs_diepint13_bit_t                DIEPINT13_b;
    uint32_t                                 RESERVED82[32];
    stc_usbhs_dieptsiz13_bit_t               DIEPTSIZ13_b;
    uint32_t                                 RESERVED83[32];
    stc_usbhs_dtxfsts13_bit_t                DTXFSTS13_b;
    uint32_t                                 RESERVED84[32];
    stc_usbhs_diepctl14_bit_t                DIEPCTL14_b;
    uint32_t                                 RESERVED85[32];
    stc_usbhs_diepint14_bit_t                DIEPINT14_b;
    uint32_t                                 RESERVED86[32];
    stc_usbhs_dieptsiz14_bit_t               DIEPTSIZ14_b;
    uint32_t                                 RESERVED87[32];
    stc_usbhs_dtxfsts14_bit_t                DTXFSTS14_b;
    uint32_t                                 RESERVED88[32];
    stc_usbhs_diepctl15_bit_t                DIEPCTL15_b;
    uint32_t                                 RESERVED89[32];
    stc_usbhs_diepint15_bit_t                DIEPINT15_b;
    uint32_t                                 RESERVED90[32];
    stc_usbhs_dieptsiz15_bit_t               DIEPTSIZ15_b;
    uint32_t                                 RESERVED91[32];
    stc_usbhs_dtxfsts15_bit_t                DTXFSTS15_b;
    uint32_t                                 RESERVED92[32];
    stc_usbhs_doepctl0_bit_t                 DOEPCTL0_b;
    uint32_t                                 RESERVED93[32];
    stc_usbhs_doepint0_bit_t                 DOEPINT0_b;
    uint32_t                                 RESERVED94[32];
    stc_usbhs_doeptsiz0_bit_t                DOEPTSIZ0_b;
    uint32_t                                 RESERVED95[96];
    stc_usbhs_doepctl1_bit_t                 DOEPCTL1_b;
    uint32_t                                 RESERVED96[32];
    stc_usbhs_doepint1_bit_t                 DOEPINT1_b;
    uint32_t                                 RESERVED97[32];
    stc_usbhs_doeptsiz1_bit_t                DOEPTSIZ1_b;
    uint32_t                                 RESERVED98[96];
    stc_usbhs_doepctl2_bit_t                 DOEPCTL2_b;
    uint32_t                                 RESERVED99[32];
    stc_usbhs_doepint2_bit_t                 DOEPINT2_b;
    uint32_t                                 RESERVED100[32];
    stc_usbhs_doeptsiz2_bit_t                DOEPTSIZ2_b;
    uint32_t                                 RESERVED101[96];
    stc_usbhs_doepctl3_bit_t                 DOEPCTL3_b;
    uint32_t                                 RESERVED102[32];
    stc_usbhs_doepint3_bit_t                 DOEPINT3_b;
    uint32_t                                 RESERVED103[32];
    stc_usbhs_doeptsiz3_bit_t                DOEPTSIZ3_b;
    uint32_t                                 RESERVED104[96];
    stc_usbhs_doepctl4_bit_t                 DOEPCTL4_b;
    uint32_t                                 RESERVED105[32];
    stc_usbhs_doepint4_bit_t                 DOEPINT4_b;
    uint32_t                                 RESERVED106[32];
    stc_usbhs_doeptsiz4_bit_t                DOEPTSIZ4_b;
    uint32_t                                 RESERVED107[96];
    stc_usbhs_doepctl5_bit_t                 DOEPCTL5_b;
    uint32_t                                 RESERVED108[32];
    stc_usbhs_doepint5_bit_t                 DOEPINT5_b;
    uint32_t                                 RESERVED109[32];
    stc_usbhs_doeptsiz5_bit_t                DOEPTSIZ5_b;
    uint32_t                                 RESERVED110[96];
    stc_usbhs_doepctl6_bit_t                 DOEPCTL6_b;
    uint32_t                                 RESERVED111[32];
    stc_usbhs_doepint6_bit_t                 DOEPINT6_b;
    uint32_t                                 RESERVED112[32];
    stc_usbhs_doeptsiz6_bit_t                DOEPTSIZ6_b;
    uint32_t                                 RESERVED113[96];
    stc_usbhs_doepctl7_bit_t                 DOEPCTL7_b;
    uint32_t                                 RESERVED114[32];
    stc_usbhs_doepint7_bit_t                 DOEPINT7_b;
    uint32_t                                 RESERVED115[32];
    stc_usbhs_doeptsiz7_bit_t                DOEPTSIZ7_b;
    uint32_t                                 RESERVED116[96];
    stc_usbhs_doepctl8_bit_t                 DOEPCTL8_b;
    uint32_t                                 RESERVED117[32];
    stc_usbhs_doepint8_bit_t                 DOEPINT8_b;
    uint32_t                                 RESERVED118[32];
    stc_usbhs_doeptsiz8_bit_t                DOEPTSIZ8_b;
    uint32_t                                 RESERVED119[96];
    stc_usbhs_doepctl9_bit_t                 DOEPCTL9_b;
    uint32_t                                 RESERVED120[32];
    stc_usbhs_doepint9_bit_t                 DOEPINT9_b;
    uint32_t                                 RESERVED121[32];
    stc_usbhs_doeptsiz9_bit_t                DOEPTSIZ9_b;
    uint32_t                                 RESERVED122[96];
    stc_usbhs_doepctl10_bit_t                DOEPCTL10_b;
    uint32_t                                 RESERVED123[32];
    stc_usbhs_doepint10_bit_t                DOEPINT10_b;
    uint32_t                                 RESERVED124[32];
    stc_usbhs_doeptsiz10_bit_t               DOEPTSIZ10_b;
    uint32_t                                 RESERVED125[96];
    stc_usbhs_doepctl11_bit_t                DOEPCTL11_b;
    uint32_t                                 RESERVED126[32];
    stc_usbhs_doepint11_bit_t                DOEPINT11_b;
    uint32_t                                 RESERVED127[32];
    stc_usbhs_doeptsiz11_bit_t               DOEPTSIZ11_b;
    uint32_t                                 RESERVED128[96];
    stc_usbhs_doepctl12_bit_t                DOEPCTL12_b;
    uint32_t                                 RESERVED129[32];
    stc_usbhs_doepint12_bit_t                DOEPINT12_b;
    uint32_t                                 RESERVED130[32];
    stc_usbhs_doeptsiz12_bit_t               DOEPTSIZ12_b;
    uint32_t                                 RESERVED131[96];
    stc_usbhs_doepctl13_bit_t                DOEPCTL13_b;
    uint32_t                                 RESERVED132[32];
    stc_usbhs_doepint13_bit_t                DOEPINT13_b;
    uint32_t                                 RESERVED133[32];
    stc_usbhs_doeptsiz13_bit_t               DOEPTSIZ13_b;
    uint32_t                                 RESERVED134[96];
    stc_usbhs_doepctl14_bit_t                DOEPCTL14_b;
    uint32_t                                 RESERVED135[32];
    stc_usbhs_doepint14_bit_t                DOEPINT14_b;
    uint32_t                                 RESERVED136[32];
    stc_usbhs_doeptsiz14_bit_t               DOEPTSIZ14_b;
    uint32_t                                 RESERVED137[96];
    stc_usbhs_doepctl15_bit_t                DOEPCTL15_b;
    uint32_t                                 RESERVED138[32];
    stc_usbhs_doepint15_bit_t                DOEPINT15_b;
    uint32_t                                 RESERVED139[32];
    stc_usbhs_doeptsiz15_bit_t               DOEPTSIZ15_b;
    uint32_t                                 RESERVED140[2144];
    stc_usbhs_pcgcctl_bit_t                  PCGCCTL_b;
} bM4_USBHS_TypeDef;

typedef struct
{
    stc_wdt_cr_bit_t                         CR_b;
    stc_wdt_sr_bit_t                         SR_b;
} bM4_WDT_TypeDef;



/******************************************************************************/
/*      Device Specific Peripheral bit_band declaration & memory map          */
/******************************************************************************/

